[{
  "funny": 0,
  "user_id": "OKDEyRXR-eOt-wUZAT8MfQ",
  "review_id": "-0sVtYr8T9gNO3nYWDPHhg",
  "text": "I love this costco, I come at least twice a week.Today though, was not a good experience. I had a lot of little things I bought and needed a box. I asked for one, but there lady putting the stuff in my cart looked at me and said \"we're out sweetie\", as I'm staring at a cart full one lane over to her. So I walked over and grabbed box, so she could put the stuff in it (it was raining outside and did not feel like putting stuff in the box on my own with the rain. So, I start talking to the cashier, pay and turn around to see the damn box set ON TOP of my cart.... EMPTY! I'm in awe! Why are people at work NOT working?",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 4,
  "date": "2017-02-12",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "s03Hbpkhb2uklGs9y6k9DQ",
  "review_id": "QgLgUGYR1xngDCjcFtoEcQ",
  "text": "I have been here three times and the food here is awesome!  I didn't even know about this restaurant until my mom asked us to go with her.  The first time I went I ordered camarones al mojo de ajo (garlic shrimp) which was delish.  During yesterday's visit I ordered 1 chile relleno burrito, 1 tongue taco, 1 adobada taco.  I asked for rice to be added to the burrito, and this was done :). The burrito was great with a lot of cheese.  The tacos had so much flavor.  The day before I tried the tacos from Taco Tijuana but the tacos at\nEl cordobes are better that Taco Tijuana.  \nTaco Ranking so far FYI\n#1 spot- Las Taquizas on Lamb and Bonanza. \n#2 spot- El Cordobes\n#3 spot- Taco Tijuana\nYou can read my reviews for all.  \nEl cordobes has very good prices for their food.  Everything I had was 1 burrito, 2 tacos and 1 soda all for $10.50.  When I walk into this place it feels as if I were walking into my grandmas home to eat her food.  The only problem here is that they do not have flavored water like horchata, tamarindo and Jamaica.  All they have are sodas and beers, but the food is soo good that it makes up for this.  Please make sure you get the refried beans with your food!!  Also, I think it's cash only.  I payed cash but I think I saw a sign that said no debit/credit.",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2013-06-01",
  "useful": 3,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "ly8ljxaWuNWIkfQEDvMixQ",
  "review_id": "pT1Kq-LLecCcB5pWM4s_TA",
  "text": "Recently stopped in for a beer and to gamble with my girlfriend. From the moment we walk in the bartenders were friendly. As soon as we sat down the bartender(short guy with jet black hair) approached us and got us drinks.  We started gaming and he suggested we should sign up for a card.  So my girlfriend signed up. Overall this was a great experience and we will be back a lot more often.",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 5,
  "date": "2014-03-24",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "MkJlV9K296QfSdklvQpFLQ",
  "review_id": "LZn_UQvQTaNQXjcabmmr_w",
  "text": "Don't order the rib eye steak. The cut is all fat. No center. Have had good steaks before, but they must be cutting corners and still charging a higher price. Have had a great rib eye at Tony romos on Fremont for less the price.",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 1,
  "date": "2017-07-01",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "cE5-O3TseC04rJEvdD29xQ",
  "review_id": "1veo014dg1lwiPcI8NH5aA",
  "text": "As soon as you walk in the place is very hot.  No customer, we were the only one.  . They have fans on which help.  The place looks nice.     They must have the temperature at 85 degrees.  We  were greeted by what looks like the owner. He did not say hello just said \" how many \" with a frown on his face.  Looks like he just lost his paycheck at the casino.  When I ordered the chicken noodle soup \" mien ga\" he said \"No eggs ok?\" While pointing to the picture of the egg on the menu.  When my father ordered the Vietnamese pancake appetizer he just said \"NO \" in a very stern voice.  I don't think he was being rude to us but it's the personality of a thug or someone who may have grew up in a bad place.   While we waited ,The owner and his friend was chatting at one of the tables. I heard some profanity \" mother fxxker\" in Vietnamese.  Not too professional.  \n\n\nWhen we got the food it was average. Every time the owner brought us something like water, menus , food, I said the thank you.  He didn't reply.  \n\n\nOverall I can not recommend this place.  Average food , poor customer service, uncomfortably hot environment.",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 2,
  "date": "2017-08-08",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "T_kSBZ3Eci6FQdeavJ_bkA",
  "review_id": "9Xfe3OVbsQrtPg7bknbUvQ",
  "text": "My parents and I tried this place after finding out that the Vietnamese place in the food court was closed. This place is a nice mom and pop establishment with friendly and respectful service. The pho didn't taste bad and was a good portion, it was a little on the fatty side. I typically add a little more fat to my pho, but I didn't have to with this broth. Take that as you will, some people like it lean some don't. \n\nBe sure to check out the signs on the wall since they have other dishes that may not be in the menu. This place seems to be starting out and growing, hopefully they do well! Check them out.",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 4,
  "date": "2017-07-23",
  "useful": 3,
  "cool": 1
}, {
  "funny": 1,
  "user_id": "ABrS2sgtZA1hSH3YTmNFPA",
  "review_id": "2T7rohuqQ9U6Dwy3c2jZkA",
  "text": "Yessssss!!!! I'm so happy to FINALLY have a Skinny Fats on this side of town! Skinny Fats is located at the old Ribs n Burger location in Downtown Summerlin and they have a great patio area. Downtown Summerlin is also bringing in Makers and Finders, so happy to see them supporting local businesses instead of the giant chain restaurants.\n\nI popped in to Skinny Fats on a Saturday morning right after they opened and ordered a couple breakfast dishes as well as the Caulifire (because I CANNOT come to Skinny Fats and not order the Caulifire).\n\nIf you haven't been to Skinny Fats, the idea is that half the menu is Indulgent and the other half is Healthy (though still delicious). It's a great low-key date place because you can order one entree from each side and share, and not feel too guilty. \n\n...My only issue (and it's kind of a big one) is that if you're a low-carb eater or eat a keto / ketogenic diet, there are very few options. Both sides of the menu are pretty carb heavy. Granted, they will customize. (We ordered the Smotherload burrito minus the potatoes and minus the tortilla as well as the Wake n Bacon minus the bun and they were happy to oblige.)  Buuuuut....it would be nice if they had a couple more non-carby options. I will definitely be trying that Zucchini bowl though!",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 4,
  "date": "2017-12-07",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "bexCf4iW__wENRLAe7sC_g",
  "review_id": "Pjj8wCavSejD0v9_Q2m6GQ",
  "text": "We were sad that Benjarong closed and changed hands but when we saw our favourite server, Cherry, we knew we were in good hands. The food was actually on par and perhaps had a few more innovative options than the previous restaurant. We heard it's a new chef, new menu, new everything. Just pleased to still have good Thai food nearby",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 5,
  "date": "2017-11-08",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "UaETDPkPzEALg8wd55iFkA",
  "review_id": "acwviCfqIPVIKo1K05TSig",
  "text": "A simple family night turned into the worst experience ever.... Our server Dani was so slow and non-engaged with her customers it ruined the while evening. Not to mention, getting here at 7:30 and not receiving all of the food in a decent amount of time. At 9:00 we cancelled the remaining order that had not been received.  After asking for the check twice it was in correct with items we didn't even order. Never had a bad experience with Friday's chain in any state until we go Lt to Sam's Town....",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 1,
  "date": "2017-06-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "AE2ojMUjqHH3qC_PGIRM0w",
  "review_id": "eG2KzLjnuag8eDiY6TlFAg",
  "text": "Nothing but homemade style food here!! Always a must visit while in Las Vegas. Try the Chile relleno plate, campechana cocktail & any of the combo plates! $3 bohemias;)",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2016-09-25",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "byV70bKT87SHgN0uRtow6w",
  "review_id": "xc-44-RXXWdseXEtZXmpZw",
  "text": "Ok so... I wasn't expecting the best deli I've ever been to coming in.   I usually notice that the larger a chain gets the less the quality of the food is important.  Also, this location hasn't been open for very long so there are going to be a few kinks no matter what. \n\nUpon walking in we had no idea what to do.   Someone at the meat counter was very friendly and asked if we wanted a sample of anything which is very nice but we were lost.   There were quite a large amount of employees but they all seemed to be being trained. \n\nWe went to a register that was closed but the girl standing there didn't acknowledge us or point us in the right direction.  Finally I asked what looked like the manager and she told us there was only one register. \n\nThe cashier at this register was training 2 others and he was very nice and friendly.   \n\nThe food we ordered was actually better than I expected!  The corned beef was delicious and I've never had pickled green tomatoes and I thought they were great.  The potato knish had a great flavor but the outside was super tough.   Like I could hardly rip it tough.   If I ate gluten  (the knish totally has gluten and I had hives for it but it was that good inside) I totally would have ordered a bagel because they looked pretty delicious. \n\nOverall I think this place succumbs to typical Vegas Strip chain eating.   Very expensive but pretty mediocre.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 3,
  "date": "2017-11-15",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "NbhMH4XcHylnROs4oUlfSw",
  "review_id": "elCFVUfZF2zBDVpPIEAXHA",
  "text": "The food is really delicious and they offer the \"healthy side\" which is under 600 calories. It's an American restaurant with burgers, drinks and salads. The location is awesome! They got a nice indoor and outdoor seating are. Outside you also have a fireplace table. It's cute and nice here. Inside you can sit at the bar or normal tables with chairs. Catering is available.",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 5,
  "date": "2017-11-25",
  "useful": 1,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "_eM7is7Mgh4qtr2GiJfviw",
  "review_id": "gm740-OLWeADRd2P63Fg3A",
  "text": "5/5 for food and service. The food is superb and made with love. \n\nTri-tip sandwich: Delicious and paired well extra garlic spread. It came in a fresh baguette with 3-4 thick slices of lean meat, caramelized onions, greens, and garlic spread.\n\nLOVED the Pita chips, which were delightfully soft inside and crispy on the outside. It came with freshly made hummus.\n\nFrench fries pro tip: Dip the french fries in garlic sauce AND the fry sauce.\n\nThe frozen Greek yogurt was a refreshing, cold treat. Made in house.\n\nOverall, definitely recommend and will be back again.",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-12-03",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "L05df9SA8W0CMkMvpSHpUQ",
  "review_id": "foDqxfPOcLBi8Sji58JFOw",
  "text": "Really good chips and salsa... Tacos was amazing and the rice and beans was the best I've had in years..",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 4,
  "date": "2016-07-28",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "GS8WLnKBUO6hlD_Iww22Gw",
  "review_id": "aOpiIzMq7jKPq8PJ8S2M9w",
  "text": "It's a bar in Caesars Palace - opens late so handy for drinks! not much else to say really!",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 3,
  "date": "2012-11-03",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "gfnjbhhQg7sFcZIALzy5Ow",
  "review_id": "c3CKVy7jQ3BnILGUKbAwlw",
  "text": "The restaurant was formally known as the Empress Court. Extremely overpriced and the food's taste was decent but definitely didn't match up with its price. We came for a family dinner and ordered a black cod steamed in soy sauce. The waiter did not inform us on the market price until we saw the bill which cost $268 for a 3lbs black cod alone. The market price in the supermarket was $5.99/lbs so i wonder which market did they got the fish? Our bill was actually over a thousand bucks for 5 roasted pigeons, 2 black cods, two Yang Chow fried rice, 8 prawns, and one kungpao chicken. All of this would cost us about $300 at New Port Seafood restaurant in Alhambra or 888 Seafood restaurant in San Gabriel and their foods taste better too.",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 2,
  "date": "2011-07-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "RVthNFBxj5XhbvB2s1WMcA",
  "review_id": "6zizx9J5gw_qCfYyXREY7A",
  "text": "This restaurant just opens for couple months. This is the only place that I can find My Quang as good as my grandma's My Quang. They also offer Cao Lau, not 100% as same as the one you have in Hoi An but it is very close and delicious. \nThe menu has a lot of options of Vietnamese authentic dishes also offer some of Chinese dishes like wonton noodle soup, chow fun, salt and pepper porkchop. The restaurant is big and clean, service is great and friendly. \nThe owner came to talk to me and recommended Banh Beo, Bun Rieu. In haven't try their Pho yet, will come back to try other dishes! A great new Vietnamese restaurant in China Town.",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 5,
  "date": "2017-07-25",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "Cm3jrFTO6vQghQMc52MDvQ",
  "review_id": "BKoYKF3BMEGo8B0-v5rGtg",
  "text": "Is this you:\n\nStaying in Fremont area or work downtown and need some good grub, but you don't want McDonald's?  Walk your butt up to Binion's, and head inside to the deli with the stools.  (Not the cafe)  Great handmade sandwiches for $7.  Boar's Head fixin's, comes with potato salad and a pickle.  Thumbs up.",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 5,
  "date": "2010-07-16",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "X8qh2cId08uZYdRTuv6QMA",
  "review_id": "bnPoL9Z4oR6ptmw8Ml5gCA",
  "text": "Always good stuff!  I love seeing something from Delaware when I travel!",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 5,
  "date": "2017-02-01",
  "useful": 0,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "L-bAAvjfCD360YwrSTv3Lw",
  "review_id": "Yc13JIAYMbGx8ZU4kaGd_A",
  "text": "Food at 5 Star is always spot on! My wife and I have never had bad food at either the Simmons location or Rancho and Craig which is our new spot. \nDon't let the setting fool you as it very nice inside. \nThe bartenders are friendly and service is great.",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 5,
  "date": "2015-11-08",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "YTmsfdv8Ek23xMgtrS0wzA",
  "review_id": "HbQRJ-wRLGemH-gIkFS2kg",
  "text": "Decided to try this place last after hearing great things about it. We ordered a sandwich and a salad. After waiting a while we noticed a few people that ordered food after us received there food. My boyfriend went up to the cashier to ask when our food was going to be ready. One of the guys making sandwiches snapped at him saying it takes 15-20 minutes. He came back to the table and We looked at the receipt for the time and it had been 17 minutes. I noticed the two guys pointing a us and giving us dirty looks. I figured we give them a little more time and give them benifit. after watching a few more people get there order I walked up there to find out what was going on since it had been almost a half hour. The cashier apologized again and again saying our order was lost to give them 5 more minutes. We told him we were tired of waiting it shouldn't take 30 minutes to make a sandwich we just wanted our money back. He understood and kept apologizing while refunding our money. He was super nice and felt horrible. The other two, not so much instead of trying to get our order ready they stood there giving us dirty looks. Very disappointed in this place and will never go back.",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 1,
  "date": "2015-12-06",
  "useful": 1,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "8iAvDinrt9kY4Zza3tyUJg",
  "review_id": "65nUJD077wACabPci5BOdw",
  "text": "Was eating a Ruben sandwich and then Kenny Loggins came on the overhead music. I remember one time when I was on the road driving my truck across the Iowa state line, and the same song played.  It took me back. It was also the song my ex wife proposed to me too, so it hits a special place in my heat. Mr.  Loggins is one hell of a songwriter and his tracks will always have a special place in mu heart. The Ruben was dry and overpriced.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 1,
  "date": "2017-11-06",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "4N9VoE3IYej-MZvjTMOEpA",
  "review_id": "ohatCOEn_B3FZ0nmCDgJFQ",
  "text": "My first try tonight at the farmer's market in Bruce Trent park. I wanted something different.  Spanish street food sounded interesting. It was recommended that I  try the chicken sandwhich, sorry I can't remember the proper name. The BEST thing I have eaten from a food truck! The chicken was moist, the bun was fried,  and the sauce!!!! The homemade fries had a nice crispy batter. I sure hope they are there every Wednesday. I want to tey more!!",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-04-13",
  "useful": 0,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "WKjJxl9Zt99hXUEq8zCLkg",
  "review_id": "poaIW4ZEJyDmB5sGID10Yg",
  "text": "Food is good, and the happy hour appetizers are unbeatable at $6 each! Our server was super nice and food was fast. Only negative is the parking...have to park inside Sam's Town casino parking in order to get to the restaurant.",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 4,
  "date": "2017-05-29",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "jcSh-1z1TikemOhn8I_YDg",
  "review_id": "d5dWo8xzBxiVHfvXxHoMbw",
  "text": "The food was amazing! I ate the combo plate (chicken and beef) with Brussels sprouts and garlic sauce! Every single staff member was so nice and even let us try the soup and the homemade Greek yogurt dessert. There was so much aloha! Mahalo from the Big Island of Hawai'i",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-12-10",
  "useful": 0,
  "cool": 0
}, {
  "funny": 3,
  "user_id": "BBUQCUL0S9XeD5xqUOVp4A",
  "review_id": "Ze3J5KFXlnbOrTWPx1snIA",
  "text": "I didn't like the food or atmosphere here.  It seemed kind of dirty which I unwisely ignored initially...but then I got my burrito which tasted kind of dirty if that makes sense.  Best word to describe this place is sloppy.  The food isn't fresh nor are the salsas...overall a big dissapointment b/c I saw this place all over Vegas for weeks and I was like hmmm i gotta try that before I leave it MUST be good..unfortunately NOT...oh yeah and it made my bf sick so we def won't be back...  :(",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 1,
  "date": "2011-08-03",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "8mydccL9O-C0oGjV-xyKqA",
  "review_id": "vAg71_10BXHW0C2j9PBAxg",
  "text": "Very chill vibe. Food is amazing Italian/bar food. Bartender mike is very attentive/friendly/funny. Pricing is reasonable. Would definitely come back.",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 5,
  "date": "2017-09-28",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "14RXKU_8DduVl_DiWes3xA",
  "review_id": "4XiW6qLVZN9cKuCkJDob5w",
  "text": "Skip for now. This place is not ready yet. We ordered 4 items, 2 were wrong and the wait time was outlandish and even the time it took to place the to go order was a little ridiculous. We ordered two toasted bagels, one with cream cheese, an egg, bacon & cheese sandwich (the bacon was paid for but left off) and an iced coffee...listed on the menu as \"sweet, creamy, and cold\" they took a pot of black coffee and poured it over ice and told me to add my own half & half and sugar if I wanted it \"sweet & creamy\". Ummm okay. I threw it away. All in all this place owes me $7 and 30 minutes of my life back.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 3,
  "date": "2017-12-10",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "n8kZ8EO-N5W_Ri2g2Ye1kQ",
  "review_id": "v-1qFcZ-3LAFSfkl2fHY5A",
  "text": "Love love love this place!! We stayed at the Santa Fe casino for 2 nights and 1 1/2 days and we ate there 3 times! I couldn't get enough. We tried the Bobbie, cheese steak, and meatball and all were equally as delicious but I would have to say the cheese steak was the favorite! The man making the sandwiches obviously loved his job and took so much pride in every one that be made. When I told him how great his sandwiches were I believe he was shocked for the compliment but I could eat those everyday how could I not thank him! And the manager Mary was so sweet and helpful I really enjoyed all 3 of my experiences there and look forward to finding one close to home to share with the rest of my friends and family.",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 5,
  "date": "2015-11-23",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "gTj5SuOML-3-EFybQuYFxw",
  "review_id": "4JqcIeO2hgaYNhdN-VdP7Q",
  "text": "We are staying at Sam's town and ordered a Jack Daniel's sliders to go. When we got to the room to eat, the sliders had burgers, cheese, onions, and mayo sauce. \"NO Jack Daniel's glaze!\n\nCalled the restaurant letting them know that our sliders lacked the jack daniel's glaze. They offered to deliver the glaze to our room, but the person that brought us the glaze told us that the JACK DANIEL'S Sliders did not come with the glaze.  If the Jack Daniel's sliders was not supposed to have the glaze, then which part of the sliders is Jack Daniel's? \n\nhttps://www.tgifridays.com/menu/appetizers/jack-sliders/1053/\n\nWarning! Never order the Jack Daniel's sliders , especially at this restaurant. You will not get what you order and they will tell you you're wrong.\n\nOur server was nice.",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 2,
  "date": "2017-08-16",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "gfUBFdkqjf-h_PETWmTMFQ",
  "review_id": "bj7ThPuUmcOQ29EV5OP1lA",
  "text": "We had Larry as our waiter!  One of the best ever!  He really helped with our choices and caitered to our being weary travelers!  Excellent food with fair prices!  Sams Town awesome as well!",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 5,
  "date": "2017-03-20",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "larfBrQeuW9JmEfpiUgOpg",
  "review_id": "hBFw5tz9tXLOo99qLl19Ow",
  "text": "This place is fantastic. The food is delicious. I love Pho and eat it all over Vegas and I can tell you this is the best Pho in town. In addition to the great food the staff and owner are amazing. I was about to dine alone when they offered me to sit with them and enjoy the football game together while all ate. I was touched by the generosity of spirit and homestyle atmosphere. Thank you!!!",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 5,
  "date": "2017-10-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "JpI6bWGxFMso3wQRHxss2w",
  "review_id": "DtpvF-XHAEZGmQ9jmmiF2A",
  "text": "Nothing but good things to say about this place. I went there today for lunch. The friendly staff along with the Bloody Mary and Italiano Sub were awesome! It's 20 mins from my office but definitely worth the drive!",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 5,
  "date": "2017-04-20",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ZNCU9UFTa_UWmkwMztkEbA",
  "review_id": "7E-6-xUGgr5Kvf4qnAWQbw",
  "text": "Finally got to try one of their amazing sandwiches. Lobster topped with Iberico Jamon. Well, there you have it. Two of my most favorite foods in one. Great buttered and perfectly toasted bun. Filled with pure delicious tender lobster and topped with the absolutely best ham in the world. No fancy restaurant or TV chef on or off the strip can make this any better. Definitely one of my top 3 food trucks in Las Vegas. You gotta chase this food truck down. When you find it it will be worth it!",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-08-10",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "LkOt2myFN5osm5HjgxsNeQ",
  "review_id": "gBTQt0VxRVkNYUT16KzcOg",
  "text": "Cheap but decent food.  Good place to eat after shopping(no I don't eat at every sample station multiple times).",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 4,
  "date": "2013-10-22",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ZglQyBlLzk7cdUNzNaaOBA",
  "review_id": "AYK-YmncFlmLfT3c-CB06Q",
  "text": "This place is wonderful. The food was great. The place was nice and clean. The owners does not disappoint. I visited their first restaurant back when it first opened up, so i knew what to expect form this one. Once i found out that they were going to open up near my place of residence i was beyond thrilled. Get their fish with chili sauce. It is to die for! From their wide variety of appetizers, to their creative entrees, Amazing Thai has been my go to for my Thai craving. We will definitely be back for sure!",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 5,
  "date": "2017-10-19",
  "useful": 3,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "hPA9f-ulUizN1Qk71cMAvw",
  "review_id": "P9hqQGwEI6E1Ydgi0g876Q",
  "text": "A.C. feels like heated air, sauce is salty, my order of beef stew was watered down, water tastes like plastic & soapy. Just overall no good, service was just WHATEVER.",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 2,
  "date": "2017-08-27",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "fzM6LdoYN5OhLxA4uIGn0g",
  "review_id": "BbOQ1oj9NLDhv5m2BXm8oQ",
  "text": "They came to our office today, and the food was delicious. I got the pollo, and patatas bravas. Service was quick and friendly. I didn't have wait forever for my food, which was nice because it was windy! I would absolutely eat here again. I only wish there was a little more shredded chicken to bread ratio. Otherwise it was great!",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 4,
  "date": "2017-09-22",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "vnOb3lnqaGM98ghZEqDfHQ",
  "review_id": "oFNrnFWOczz08ozgNhTYIg",
  "text": "great stuff I mean it;s the real deal !!!!\n\n1 try the micheladas even better than in Mexico \n\n2 try the camarones agua chile (like ceviche on steriods)\n\n3 this place has both traditional mexican food and great mariscos ( sea food)",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2012-06-13",
  "useful": 3,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "PCh486d3OzWRh6NoPMm0XA",
  "review_id": "sKP0yaY6oja74thncx9cig",
  "text": "Best pizza ever. Nuff said. Prices are cheap and food is good.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 5,
  "date": "2013-03-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "bUKiQrxN4VQWv0v9Yby0-A",
  "review_id": "N9Sx8Hlf1B6wnF_w-jUNdQ",
  "text": "This place is a must try seafood Mexican restaurant. I like their seafood enchiladas and their stuffed fish fillets are great as well.",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2016-09-12",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "u2jYb3GGDT2LuQt08xA6TQ",
  "review_id": "j7s2CWygiJ5YmYnAd_BDPw",
  "text": "Dont forget to read my previous review as well on the bottom. It has 10 pictures.\n\nThis time we tried the Chinese menu  as well.\n\nSalt and pepper pork pieces was ok and came with a bowl of rice.\n\nSalt and pepper chicken wings were was ok as well.\n\nPho ga was always on point.\n\nPho dac biet was great as well.\n\nThey now take credit cards on order over $20. Big win.",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 4,
  "date": "2017-07-04",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "RIY8elki7UR716jwcQdX8w",
  "review_id": "QiUHymRTi3DFQyzQLRX0LQ",
  "text": "Never again because the owner is a racist and was calling my friend a \"gwai lo\" and other things talking smack behind him before he even left the restaurant thinking he didn't know what they were saying. Just this rudeness is not appreciated and won't be back. If you want to talk about your customers, at least wait until they are out of your restaurant and can't hear you.",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 1,
  "date": "2017-07-27",
  "useful": 3,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "QFYT4jsU_MYEjBIhvHNQGw",
  "review_id": "kDcrF4PsJnOT0qaGgEt5cA",
  "text": "My son Tried the chicken tacos for the first time (in like 12-13 years that ive been eating here religiously) and i could not stop eating them even though I was STUFFED. Lol\nEverything is amazingly good- but again top things to try:\n\nButterflied red snapper fried \nTostada de ceviche Cameron\nCoctel de Cameron \nPollo a la Padilla ( takes a Lil extra time but worth it)\nCHEESECAKE FLAN is the BEST THING I EVER ATE.",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2013-08-24",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "CwXnODVCAw9CdDTdosz8cg",
  "review_id": "mFWHZWemeQz8a9Bre-bGoQ",
  "text": "It was 7:30pm on a Thursday and we were told there were no meatballs. Disappointing experience once again at this location.",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 1,
  "date": "2017-02-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "_xTtHk4eg3dSUMDJIzwUFw",
  "review_id": "gAewiwsSckYCBCWIcg9LMg",
  "text": "Katie and Richard A.kA. dick\nThank you for the lesseon\nHorrible service. Other then SHAKInG our Hand AnD iNTRo wiTH your names. To that wE  THank u.",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 1,
  "date": "2014-03-02",
  "useful": 5,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "mOeYi3nEDnGhnD-oPedhjQ",
  "review_id": "_PpbjQXP6DsY_U0KOkQ_Ng",
  "text": "Being that this place is inside the RIO, I'd say that they have a pretty captive audience - especially late at night. That being said, its still a decent little spot to eat at if you are staying here. I ended up staying at the Rio on some comped nights for the new years so I found myself here in need of some food to soak up the alcohol in the system late at night. Had tried a few different things from this place. The braised oxtail was good - but not nearly as good as the oxtail soup from the California casino in downtown - anyone who has eaten that late night, knows what I am talking about. One of the best anywhere. The Yang chow fried rice is really good and if you have some other dishes with rice already... getting the bbq pork without rice is a great option - its like twice as much to get it with rice! \n\nThe only consideration is that if you are mobile and have a car... you are right near a huge Chinese food area on spring mountain road where you can get more bang for your buck. Then again... when you are in a casino, you already know that you are going to pay a little more and hopefully you have gambled enough to get some free food comps. \n\nDon't look for anything too fancy here... It's really like a cafeteria where you order and pick up your food and go sit down at an empty table to eat afterward.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 3,
  "date": "2011-01-06",
  "useful": 2,
  "cool": 2
}, {
  "funny": 1,
  "user_id": "5PTZFJ0etDjWN3BvbqNDVg",
  "review_id": "Er0Cvn8KlHZZ7lKfCBMrDw",
  "text": "Super hot chicken and drive through it used to be Rally's ... Popper are crispy and hot love hot sauce and fried chicken. It\nMust be a southern thing. Fast Service and inexpensive artery clogging good.",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 5,
  "date": "2014-12-24",
  "useful": 1,
  "cool": 1
}, {
  "funny": 2,
  "user_id": "3ln6Br2Vcy845VGj35icIQ",
  "review_id": "wRpicPHDZmHTZnQ7_pH0NQ",
  "text": "This is my favorite Robertos to go to. I've been coming here for years it's not a bad location and the bullet proof glass shouldn't scare you. They are friendly and quick!",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 5,
  "date": "2016-06-22",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "DSjfuPygAvv17e1DHAAZqw",
  "review_id": "8g10urlqCilx5IsdbIvc5Q",
  "text": "The Bobbie sandwich is worth the hype. If you like Thanksgiving (which you should cause you're a patriot reading this) then you'll dig this sandwich. They made the sandwich in, no bs, 1 minute or less. I had just gotten my drink filed and it was ready. The manager was working the register and he was very courteous and professional. If you have a chance to get one of these wiches, GET IT!!",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 5,
  "date": "2014-05-01",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "qz9rv9r83UcNHKczPORTfA",
  "review_id": "aVjN4dDVG4RioNx-1YuYLQ",
  "text": "Amazingly bad service. I tell the guy my order, he asks what kind of drink I say coke, I get to the window and he's like \"so that was a strawberry fanta right?\" \"no, coke\" comes back like 15 min later hands me a strawberry fanta... at this point we've already been waiting a while so I'm like whatever. I asked for ranch, he charged us for it, we get home, no ranch, and missing the only order of french fries (also charged). Will never go back.",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 1,
  "date": "2016-01-03",
  "useful": 0,
  "cool": 0
}, {
  "funny": 2,
  "user_id": "_VMGbmIeK71rQGwOBWt_Kg",
  "review_id": "vT7y_Wpk9Em3t6XLuW6gQA",
  "text": "This just might be the best food truck to ever debut on the streets of Las Vegas.\n\nBoqueria Street is a new food truck that, per their web site, just launched in January of this year. I'd be one of the first to say that you're usually not going to find anything truly special on wheels, with a few notable exceptions of course, so I'm not that I'd never heard of them until i saw the lineup of a new weekly food truck event that I was planning to visit. After trying the food, I became very surprised indeed.\n\nThe highlight of their menu of \"Barcelona Inspired Street Food\" (you'll see the words on both sides of the truck) is actually a separate blackboard full of Iberico ham options (Jamon Iberico \"de Bellota\" to boot, which is reputedly the highest qualtiy). The gentleman outside the truck pointed out this menu while I stared pensively at the truck, and the chef went so far as to offer me a sample.\n\nI will admit that I have certainly never had Iberico before, so I have no point of comparison, but the morsel of meat that the chef offered me was the best thinly sliced ham that I have ever had the pleasure to taste - far richer than whatever prosciuttos that I've eaten (laugh at me all you want, but I'm not that well-traveled or experienced). Consequently, I had to order off their Iberico menu, whether or not the pig that this came from actually ingested acorns and only acorns all of its life.\n\nI chose the Flat Bread of Iberico ($12), which was simply the ham draped on a flatbread, with some tomato and olive oil in between. I already waxed poetic about the ham, but the bread was surprisingly good, certainly far better than whatever run-of-the-mill pitas that every Greek place uses. The tomato was a welcome acidic accent, but perhaps slightly overpowering in some bites. Still, I'd definitely suggest ponying up for either this or really any of their other options if they offer what they call Iberico.\n\nI was also hungry enough to order the Barcelona Sausage ($8.50), a non-encased pork sausage in a buttery roll with zucchini sprouts and chimichurri mojo verde. I really have to highlight the awesome roll, which is by far the best bread that I've had from a food truck and certainly one of the better ones if I include brick-and-mortar. They actually source it from local outfit Great Buns Bakery, but whether it's the third-party softness and airiness or the chef's grill treatment, you can't miss their bocatas (aka bocadillos, aka sandwiches) for this reason alone.\n\nThe sausage needed to shine too - heck, it's the namesake - and it indeed had a rich, meaty flavor. It kinda reminded me a bit of bratwurst, actually. The accompaniments are also nice, including some chips (taro?) that were somewhat prone to falling off but still delivered a touch of crunchiness. I'll likely also grab another bocata next time to see what else they have to offer.\n\nBy the way, both portion sizes are what I'd charmingly call \"modest.\" But with food trucks, you're often prone to paying prices not too much lower for food that's certainly inferior. Same for brick-and-mortar places, sometimes. Go for quality over quantity here and then pig out on whatever gut bombs you might find at other trucks at events.\n\nAs food trucks often do, Boqueria Street posts their menu on their various social media pages, as well as their web site (which also has a copy of the menu, sin* Iberico). That's how you'll find them, and you definitely should make the effort to try one of the best food trucks in town and one of the more interesting new food ventures, four-wheeled and four-walled alike.\n\n[*because not everyone learns at least sufficient Spanish to get by, sin = sans = without - capisce?]",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-03-24",
  "useful": 8,
  "cool": 6
}, {
  "funny": 0,
  "user_id": "V-BbqKqO8anwplGRx9Q5aQ",
  "review_id": "ueqx9hGYHk8OqTSfURDQ9w",
  "text": "Not sure how to rate since this is Las Vegas but if I visited this place near me it would be 2 stars.\n\nMy meal only cost around $9.00 and could feed two people. I didn't have the time to go elsewhere since I was at a convention at the Rio \n\nI got what I thought was three broccoli stems with two shiktakki mushroom caps and a few shreds of carrot with a (Maybe) fried slightly crispy block of tofu with slightly hard rice on the side but after eating more I discovered this might be Chinese broccoli because of the ONE leaf I discovered.\n\nThe sauce was mild and flavorless and the steamed white rice was hard and crunchy.\n\nThe Chinese broccoli steams were very hard to cut with the plastic forks they give you here and the sauce was too mild to enjoy. \n\nBut for a Casino this was extremely low priced and maybe better to some people. It was low priced but would go elsewhere If we had the time. It will do in a pinch.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 2,
  "date": "2011-08-18",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "INHFOcLzPBFAEO9QHbQ6Pw",
  "review_id": "3smLmmhu96xfQDrIqvJDVw",
  "text": "The first few times I visited this particular location, the food was great. It was hot, the portions were abundant and the staff was friendly as well.\n\nThe last three visits sucked. The carnitas were hacked up, dried up, hard, greasy, and had that clear look that meat gets after it's overcooked and then dries out on the counter. I guess it's needless to say, the meat was flavorless as well. The adobada was hard, greasy, and hacked into tiny, tasteless granules of meat. The rice was dry. The beans were so dry, you had to scrape the top off to get the bottom bland portion.\n\nThere used to be two men behind the counter (one very handsome : )) that did an exceptional job with the food. They were friendly and humorous as well.\n\nThe two women that I had seen on my last three visits were just and dry and bland as the pitiful food...They knew that they were passing off crap. I'd have to agree with Nick R. on this one.\n\n\nGO TO THE LOCATION ON S. NELLIS INSTEAD!!",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 1,
  "date": "2014-06-25",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "qw6w0dLPA6miMjcCAWc7BQ",
  "review_id": "NQMY6bHegLGDa1SNx9ILRQ",
  "text": "Fast food atmosphere - but great food! You order like you're at McDonalds, but when the food comes, it's delicious. You pick up your order when your number is called. Food is served in plastic bowls and plates with plastic utensils (wooden chopsticks though). Prices are high considering the fast food ambiance, but still well worth it.\n\nI started with really good spring rolls. Then when I saw the size of my main course, I thought twice about finishing my appetizer. The duck soup was  piled high with crispy, fatty duck pieces. Underneath was a delicious soup full of egg noodles. I washed it down with a Tsingtao beer. \n\nA confession: when I was done, I didn't bus my table like I would at McDonalds- after all, this is Las Vegas.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 4,
  "date": "2010-05-26",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "eiiXoxbl2nzTy3VTsOd-Qw",
  "review_id": "umPpfhaCrMavhIbFEdMQtw",
  "text": "This place is right inside the casino basically on the floor.  It doesn't look like much but all of the diner classics that are served are great and cheap too.  \n\nGreat burgers and sandwiches, especially at 3am.  Friendly staff knows how to deal with all comers.\n\nGood food, cheap and quick.  If you want a quick bite in Old Vegas run into Binions Casino and order a burger.  It is going to be good.  \n\nThanks",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 3,
  "date": "2013-02-08",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "f1avI83CPQcJMbD6XVHiHw",
  "review_id": "_jIUbJASdLjTd21f399S4A",
  "text": "This place is awsome\nIll come back and recommend to my family.\nThey are very nice and friendly\nNot bad",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 4,
  "date": "2017-09-03",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "r7i0SLZkgNSr7L-Q8pJffA",
  "review_id": "1g4E5DMOvuT6J9dBsmsEXA",
  "text": "I took some NYC food snobs here and they were convinced that nothing in Vegas could compare to what they had back home.  They were convinced otherwise.\nGreat food, great concept (happy vs healthy), great atmosphere (much bigger than the Dean Martin location), and great production value.  The ordering process takes longer than it should but that is because people in line can't make up their mind on what to get.",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 5,
  "date": "2017-12-09",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "A2N4y0VeZ-3TtmBVCSVVnQ",
  "review_id": "D-apucRy3X9LcPAbav2uhA",
  "text": "Great location. About time to have one on the north east side of Vegas. Not a big seating are inside but it works. The employees are wonderful. This one has a special for almost every day of the week.. On Wednesdays are Chicken tacos for 99 cents. I had it. And it was a little dry, had to add alot of green sauce. But it was good. The carne asada burrito in my book was tastier than other robertos. The Steak tasted fresher. So did the pico de gallo.",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 4,
  "date": "2011-04-13",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "UrQw8IyTOAAlokN-SMK3_Q",
  "review_id": "3pncJSEXe6odUKRnQovxWg",
  "text": "Such personable service and such wholesome ingredients in their dishes. Clean indoor sitting area.\n\nThe cilantro soup was light and fragrant with lots of ingredients. The spicy beef soup was rich with bits of beef and veggies in it. Soothing during a chilly night.\n\nThe beef and chicken plate is served with rice, pita and 2 sides. Got a mammoth order of brussell sprouts and paid a little more for a whole ear of corn sprinkled with ooey gooey goodness. The tri tip meat was soft and went really well with their spicy hot jalapeno sauce. The chicken was juicy and soft. No knife needed. The creamy cilantro sauce went well with the chicken. So glad that the meats and soups were not salty.\n\nEasy parking. Friendly workers.",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-12-06",
  "useful": 4,
  "cool": 3
}, {
  "funny": 1,
  "user_id": "WetvR1QGw87S3Wtp2X9INA",
  "review_id": "Bq9wYmrYfZ90aDgdHDhG6Q",
  "text": "I went in directly after work. Used my tips from my job to have  good dinner. \n\nI had the best sandwich that I've ever received in my entire life. \n\nShout out to all the crew \n\nMy bread was soft. My sandwich had the best amount of cheese. \n\n10/10 would recommend to a friend.",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 5,
  "date": "2015-04-18",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "7Hpz7K2lgygPi2w7IaPYJA",
  "review_id": "xW9tXoWzDhlZT5w6hBykSw",
  "text": "I don't usually like to hang out in a bar but if I do I will go here.   When you enter its a nice candle aroma with a friendly smile from the awesome bartenders.  The food is always fabulous and the drinks are super cold. The locals that hang out there are also very friendly and it reminds me of the show cheers where everybody knows your name (or at least remembers your face and says hi and will hold a great conversation!) I have been going to this bar for a few years now and miss a couple of faces that got kicked out due to talking loudly when the owner came in one night! (I don't agree with that part!) I do like to bring my people here and show off my nice clean bar w/ the best bartenders ever! Thanks ladies, Martin and Rich for always making that rough day a little better!",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 5,
  "date": "2015-11-13",
  "useful": 1,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "s5NZkHhdoTW7_xEIf46BbA",
  "review_id": "ahk7PwBiZMP8MJMWQRYwIA",
  "text": "I love how everything is cheap. The dollar churros are bomb! The pizza is bomb! The polish sausage is bomb and for $1.50 plus tax. Haha but wait there's more. It comes with a drink! The wait isn't too long quick service. Sometimes it might be hard to find a table to sit at. Or a clean one. Some people are just messy eaters. But other than that good food for cheap!",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 5,
  "date": "2014-03-09",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "Cbris3JgCtvaw4WYuTA5KA",
  "review_id": "Gltt_VuHvhN0A3e2-xsgDQ",
  "text": "The food is awesome and it's very clean and modern inside. Great lunch specials. They have a huge menu and offer dishes that other they have quite a few authentic Vietnamese dishes that no where in Vegas serves and the taste is amazing. You won't be dissapointed.",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 5,
  "date": "2017-07-25",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "4jNHKCON2_jhqQjxNhb-EQ",
  "review_id": "WQaE2Jn79NsftqSOSB3LeQ",
  "text": "Wow! Just picked up a couple of tri-tip sandwiches for lunch. First, the young lady behind the counter was super friendly and fantastic. The gentleman (I believe he is a partner in the business) was also super nice.\nTo the food,I had mine with the onion marmalade on the side, my wife had hers just the way they make it. We both LOVED this sandwich. The tri-tip was cooked perfectly. The baguette was perfect for this sandwich. The garlic sauce was superb as well. They knocked this sandwich out of the park. Fries and fry sauce we're excellent as well. \n\nI already texted some friends that work at UNLV to let them know they have a new restaurant that needs to be added to their rotation. I will be letting my bar customers know as well. I always pull for a unique, family run place and I know I found a winner.",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-12-04",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "qRWAXmNnt84FGFGthuJLuQ",
  "review_id": "rgX_rwbN3XroyLIrzf9WRw",
  "text": "I love the food.  Some of the best bar food I've had. Drinks are good as well. Service is always prompt and friendly.",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 5,
  "date": "2016-08-03",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "kxKL3lwgCHFzqMUnt37pkA",
  "review_id": "KrCltZbCAg6c4HUupmtbJw",
  "text": "This is my favorite deli in the Las Vegas Valley. The small deli inside the Binions casino offers authentic pastrami sandwiches. Their menu includes traditional American soups, hamburgers, hot dogs, Chili and root beer floats. My husband and I love Anthony the server inside the deli. He has always greeted us with a smile and makes a delicious pastrami sandwich every time. Whenever I'm in the mood for American comfort food I always find myself at Anthony's Deli.",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 5,
  "date": "2017-08-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 4,
  "user_id": "_VMGbmIeK71rQGwOBWt_Kg",
  "review_id": "oeJY82Q0eMfc-zO0tb6fOQ",
  "text": "The Goodwich might finally have a challenger for the local sandwich crown.\n\nKarved is a new fast-casual restaurant focused on rotisserie meats and, thus far, a simple menu with sandwiches, plates, sides, and some other items. They're sandwiched (appropriately) between TIABI and Sakana in a fairly small strip mall on Maryland Parkway. \n\nMy eyes lit up when I first saw porchetta on the menu photo. It's not a common if at all available pork preparation in this town (or at least as far as Yelp reviews have cataloged it). After I checked with a friend and received confirmation that it's awesome, I beelined there for lunch, finding the place fortunately (for me) not very busy.\n\nAfter seeing the rotisserie at work right behind the counter, with Brussels sprouts and roasted potatoes both filling drip trays below the porchetta, I decided that I should go pick one of those as a side. Fearing a potential food coma, I kept it light by picking the Brussels sprouts ($4), which appropriately came out at the same time as the sandwich. I wouldn't outright call them mushy, but they're on the soft side and had no crunch. Also, the portion on this was a bit modest for the price. At least the Brussels sprouts are subtly tasty, likely owing to the porchetta drippings.\n\nThe owner was offering sample cups of Cilantro Chicken Soup ($5) while people waited for their orders. After tasting it, I almost had to order one to-go. It's balanced in seasoning and thickness, and the chicken was so tender that you don't even have to hear the owner say that the soup is made fresh daily. Plus, the bowl is quite generously sized.\n\nI did bury the lede a bit, and that's the brilliant Porchetta Sandwich ($12). I was worried that the \"French baguette\" bread would be tough if not outright sharp, but it was simply a delicious and chewy container for the goodness within. That treasure starts with awesome porchetta, including juicy pork loin and the crispy skin of the belly, the latter an unparalleled textural experience. The lemon sauce (with herbs) complements everything perfectly, and the fresh arugula completes the Italian-inspired experience. It doesn't get too messy compared to some sandwiches.\n\nThe porchetta alone earns Karved a top rating in my book, and the chicken soup was memorable enough for me to overlook the Brussels sprouts. Hopefully, I'll be free to come back soon to try some of their other options, including that yet-to-be-explored tri-tip.",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-11-07",
  "useful": 13,
  "cool": 8
}, {
  "funny": 0,
  "user_id": "3H44QawcElUlPytzwtz3Bg",
  "review_id": "DkgVtrJF_39x8YA83uc0Lw",
  "text": "Just went there this weekend and no pastrami but food was still good for the family and they let me go get the pastrami at the new place and bring it back.",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 4,
  "date": "2015-07-08",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "ss-xkQPThqjp10XKGw_M8A",
  "review_id": "_6jxP4NbTHwnB-0pvxgRxw",
  "text": "ABSOLUTELY the best daytime bar in Vegas.  The daylight cocktail goddess Anita, will re-fill the beverage of your choice before you even know you are ready.  We have been in Vegas for 32 years, and you just can't find service like this anymore.  That is why you will only find us there on Wednesday, Thursday, Saturday and Sunday.  Stephanie and Jim run a bar that is both classy and blue collar at the same time. The decor is dark wood and timeless elegance, but the vibe is everyday fun.  The Rancho/Craig location is our favorite neighborhood bar, but the Five Star at the location of the previous Cooler Lounge (for you native Vegans) is another favorite of ours. There you will find Omar...the finest cook of Cuban cuisine this side of...well...CUBA ! !\n\nFor a good time, visit Anita at Rancho and Craig.  All you bikers out there will find it next to your favorite leathers store, facing Craig.\n\nFive Star is the best Vegas has to offer, and it is our daytime bet for good food and good gaming odds.\n\nBarbara and Ed Andrews",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 5,
  "date": "2012-04-19",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "DKdttAvXagfAfNFIKeApuw",
  "review_id": "yZY9_Q084CUVdND8h5AVRA",
  "text": "We ended up eating here after deciding not to wait an hour in line at the World Buffet line. \n\nThis is Food Court style, not a sit-down full service place. It is quite expensive for this format, even more expensive than many sit down restaurants.  Example: $10 for noodle, duck soup (skimpy portions).\n\nThe food is good, portions are small. With other choices in the area, I would skip on eating here again. Go across the street to Ping Pang Pong at the Gold Coast.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 3,
  "date": "2009-10-08",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "2tieJj1xx7qOcqNIhZFEEQ",
  "review_id": "9htNP0-yhjVfs34xp2iDKg",
  "text": "Had lunch today at the new Amazing Thai 2, which is in the space previously occupied by Benjarong, overall I had a great experience, I ordered from the lunch menu 6.95 for a rice and curry dish, included an egg roll and salad, very good price for lunch. I will return to try the dinner service.",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 4,
  "date": "2017-10-17",
  "useful": 2,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "Ot2VyAzU_aBil7L5jI7Rxw",
  "review_id": "JHyB6iwprRukHaDj__gqsg",
  "text": "Over 30 years ago as a manager Church's Chicken this store needs a lot of help . This is not the first time I visited the place. I decided to give him another chance first time I went there I ordered an all white meal they said only came in mixed which was kind of funny cuz I said they used to sell all white. But the chicken at least freshly cooked with a little wait this time I went in order the three piece all white meal and the chicken must have been up there for hours except for maybe the wing the first breast was way over its 45-minute holding time the wing must have been right around the 45-minute holding time probably a little over and the last breast I ate was drier than hell and had to be on that rack for over 2 hours both breasts should not have been sold and the wing was borderline. And I went to the drive-thru at 5:30 p.m. on Saturday evening.",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 1,
  "date": "2017-08-27",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "_zRjl3ojmvon3RQtYPD05w",
  "review_id": "0n8Sb4N_PONBKcDqTvkxsA",
  "text": "Had there sweet sticky rice twice now and Hooed the second wouldn't be as bad but sadly don't waste your money.  Worst I've ever had.",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 1,
  "date": "2017-12-09",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "GB3yqJxiusaISq34lgZulg",
  "review_id": "if5B2T4TpDNO9Macl6blVA",
  "text": "We tried Boqueria at the Food Fest and it was AWESOME!! We ended up getting seconds and thirds.  Can't wait for the May schedule so I can follow them around.",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-05-01",
  "useful": 0,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "exWhIvuaOTHfoP8_ZEINjg",
  "review_id": "pb1fnvnBdJ-klP70JXy1cw",
  "text": "If you are looking for an exquisite sandwich or authentic Spanish Food, this is your food truck!\nGreat quality, beautifully presented & fresh ingredients. The Chef is someone to meet!\nHighly recommended!",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-03-25",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "x_8_jPhDwWP1o_u_bvT54w",
  "review_id": "CqsPiGBnLLiOlcTUIlkAKw",
  "text": "Tasty chips and salsa! Tried the Carne Asada and Chile Verde burrito, both really good!  Great hole in the wall restaurant!",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2016-05-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "oyz-6INadg4q8cdSgaWYoA",
  "review_id": "e9D1jQYB8vUhw0U32qat-A",
  "text": "Went to the movies and decided to take them up on their offer to make it right before I saw the flick. No one was around. No cook, no counter person. The counter person in  the food stand next door called us over to have a burger. What was I to do? It is fast food after all and nothing is slower then no one to take my order. They failed.",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 1,
  "date": "2014-08-01",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "lsDvnW2DZRTPVViCH-Z6Ww",
  "review_id": "zE7xfL10b6VmXOpmtC0UOA",
  "text": "Excellent food and Service  I ordered the 1/4 lb Beef Hotdog with a side of brussel sprouts.  I was definitely not disappointed.  Hubby got a side of black beans that were too delicious.  Definitely will eat here again when ever in town. They deserve 7 stars",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-12-03",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "M4uGs-0Fskn48t9icYk_Tw",
  "review_id": "K5MyKu-Uy3eaxHLkswnMLg",
  "text": "Skinnyfats has a knack for making healthy food taste so good and less healthy food, even better!\n\nThis location just opened on Black Friday and as always, they're a hot commodity in any neighborhood they're in. For a Tuesday evening, the dinner rush wasn't bad.. by the time we finished eating, the dining room was 1/2 full. \n\nRemember they have food the menu \"secret\" items-- namely the HappyMess-- their take on carne asada fries. My go to is their NakedChix  or their AhiTuna anything.\n\nSmoothies are also so good! They have a patio which, I think, is dog friendly.. since the mall is dog friendly???  The patio at their Warm Springs location isn't dog friendly. I really hope this one is. Come to this location instead!\n\nFood came out quick and fresh! Plenty of seating compared to other locations. I imagine on the weekends it's more packed so expect a brief wait at the very least.\n\nHooray for more casual/quick/healthy food options in DT Summerlin!",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 5,
  "date": "2017-11-29",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "sLgekUp1uedWpnDsztvkVw",
  "review_id": "w-s_vRQUCHf6KyuuvfMEfg",
  "text": "The TGI Friday is a nice chain restaurant which was located in the Sam's Town complex.\nWe had drinks  here and plan our game plan for the 3rd and 4 Th  quarter of 2017.\nWe have lots of fun.\nI'm a fan of the fast and friendly service at this location. I will return.\n\nGloria~",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 4,
  "date": "2017-06-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ZTJXOXppwbcUQnowOsgAvw",
  "review_id": "L6N8jvk5KPHGUc8lte_Wdw",
  "text": "This 5 Star Tavern is the best bar in town.  Delicious food, great service, unbeatable food and drink specials.  Extremely clean bar and bathroom areas.",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 5,
  "date": "2014-01-30",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "lQBZo8_mm80dbwI5bo5c_w",
  "review_id": "78lW3pbNM4dwCG4tmadRsg",
  "text": "It looks like this place is recently new. The restaurant is very clean and nice inside. I like their red chopsticks they have and the condiment station at every table is organized and convenient there for the customers. I ordered the spring rolls and bun bo hue here because it looked good. The spring rolls was skinny and was good. They give you plenty of sauce for the spring roll. The bunbohue was also good. Came with enough veggies on the side. It was neatly presented and served. The server was friendly and prompt and he refilled my water frequently. I think if they advertise more they would get more customers because I was the only one that came in for lunch. I would come back to try the other dishes.",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 3,
  "date": "2017-09-01",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "s7XUDb3zT-7u1_5lySqvKg",
  "review_id": "cMmhJo2qC6GzTEUcKw8PZg",
  "text": "IMHO (in my humble opinion), Mah Jong is a must-have if you're staying at or stopping in the Rio.\n\nThe fried flounder, fried rice, and any of the meats or poultry from their Chinese BBQ selection (particularly the pork and the duck) is outstanding. You can't go wrong with any of the aforementioned entrees. Yes, the price is a bit expensive compared to, say, Panda Express, but its high quality and is located in a casino so its expected. Their condiments area is well-stocked and clean. Free soda refills = :)\n\nIts located next to the sports bar too if you like Chinese food as a comfort food.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 5,
  "date": "2011-02-06",
  "useful": 1,
  "cool": 1
}, {
  "funny": 1,
  "user_id": "oP_W33ZQojlrfbg1sKfeGQ",
  "review_id": "XieVAXyEdr0BWQJGHI1fog",
  "text": "Greesy drunk food, nothing more, why are you reading this? if you are drunk, eat here at 3am, you wont regret it...well maybe you will",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 3,
  "date": "2012-08-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "Vk7LryUTuVLm0HW15JILWg",
  "review_id": "BxGDeGV4W6enqEKOpHKAkA",
  "text": "The best Spanish / Barcelona food in Vegas. All menu is delicious.\nSin duda alguna el mejor cocinero de comida Española en Las Vegas. Buena calidad, muy buen hacer y un toque pequiliar hacen de este food truck uno, si no el mejor, en el panorama culinario de la ciudad.\nEl chef Oscar se convierte asi en una apuesta imnovadora y segura cuando lo que buscas es comidad autentica.",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-03-22",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "lp5ueTBsdH9SfpUsQVZaWg",
  "review_id": "CaSnl8uacVv17YqYPgsplw",
  "text": "Vic is awesome and this place cannot be confused with the restaurant, although BOTH are great!!  Vic is our go to guy because he's classy, yet he clearly takes an \"I don't take any sh$t demeanor\".  That's NOT to discount his class and top notch treatment but simply to say the man can handle the clowns that may decide to venture in. He speaks with sophistication yet not in a way that demeans anyone. A man's man with class and a fantastic knowledge of drinks and the phenomenal food they have in the restaurant!!!",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 5,
  "date": "2015-11-21",
  "useful": 0,
  "cool": 0
}, {
  "funny": 6,
  "user_id": "z4RytucxI_XfcMFaEI2DRg",
  "review_id": "TL_ALuvdNdzseymLxoSv1w",
  "text": "I like coming to this location when I'm craving carne asada fries because it is near my house.  Don't be alarmed by the bullet-proof glass behind the counter, the neighborhood may not be the best, but the staff are always friendly and the food hits the spot.\n\nWhat I like about the carne asada fries here is that the fries and cooked perfectly!  I took an order to go and usually fries get soggy by the time I get home.  The fries were so crispy and delicious despite the mound of sour cream, guacamole, salsa, carne asada, and cheese that was piled on top.  I devoured the whole thing and every last bite was just still as good as the first, with that nice crunch.  \n\nAnother thing that I like about this location is that they have the salsa pre-filled in little cups so you just have to tell them the amount you want before they give you your order.",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 4,
  "date": "2015-12-08",
  "useful": 5,
  "cool": 4
}, {
  "funny": 2,
  "user_id": "qNeMBnzJc3Kwk8Z39TDZEg",
  "review_id": "i8Xm_i4uP1MFl2QDHYj4pQ",
  "text": "Amazing new place,  you have to check it out.  There's an amazing little eatery with rotisserie meats and fabulous sides.  I stopped in for a little to go lunch and ordered the 1/4 chicken and a side of hummus and pita.  I opted out of getting the whole plate which includes two sides and rice, because I just wasn't that hungry. Had I been a little hungrier I would have gotten the whole thing. \n\nThe chicken was moist and delicious full of flavor, and roasted perfectly. My favorite were the pita chips homemade crunchy on the outside soft on the inside, paired with the hummus was unbelievable! I would stop in here just to get the pita and hummus haha.\n\nThe ambiance is cool and hip,  very relaxing,  and the service is excellent.  Great little spot.",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-10-25",
  "useful": 7,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "Ga48lhdwJoXzI1Lmd7ZiAA",
  "review_id": "n2eqCwTX4HPZySn4tUD18Q",
  "text": "Good food, served quick and hot. Four of us eat here for lunch and it was good. Lot of TVs to watch sports while eating. Not to crowded with lots of tables. Slot machines at the bar if that's your thing. The manger came over to ask how everything was. First time here, but we will be back.",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 4,
  "date": "2015-08-07",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "XopP_70iyfC3iCPAY-sz4Q",
  "review_id": "grIo84p-1pWObQG2Fo-suw",
  "text": "This was for a togo order. I was in a rush after doing some grocery shopping and I just saw this place near that Von's center. Apparently they had just opened. I almost went to the Hawaiian place but I like to try new places. \n\nWhen I stepped in, I felt like I was under dressed and they may not have lunch specials cuz it looked small and the décor was a bit fancy more than a casual looking setting.\n\nThis is their second location and they already had one opened on north side.\n\nI decided to see if they had lunch specials at fair prices. I got a panang curry with chicken with spicy 5. I almost ordered an 8 but I remember that panang usually is spicier at a lot of places so I just asked for the spicy stuff on the side. So the 5, really was a 5. I think I should've ordered that 8 but I didn't want to be dying in class so good choice for me I suppose. \n\nIt was really delicious and plenty of chicken in it. usually the chicken lacks at places. The lunch portion was a perfect portion for me. we get a salad and an egg roll. usually the portion is too much but I ate everything and didn't feel that food coma!\n\nI also had a Thai tea. I believe 3 bucks for a Thai tea is a bit steep but I enjoyed it still. I'll give it another try and actually dine in next time.\n\nDon't forget your stamp cards! every time you spend at least $20 they'll give you a stamp.",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 5,
  "date": "2017-10-20",
  "useful": 3,
  "cool": 2
}, {
  "funny": 2,
  "user_id": "NNgQ8fV5ARQgHw-Ob7l50A",
  "review_id": "4DoOizjXh99B1C0oJwy-1Q",
  "text": "If you just flew in and got your rental car, this is exactly where you should go. The corn is good. The porchetta is great. The chicken is great. The staff is great. Paul is very cool and I hope his business succeeds. \n\nLet's see how else  I can help them with additional search terms. \n\"food near LAS\" \n\"Sandwich masters\"\n\"Hell yeah\"",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-11-11",
  "useful": 5,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "Y85yRsIwEi0ykFQxm1XF8g",
  "review_id": "qoMANknVgHTyI6sQF3YCTg",
  "text": "What can I say, El Cordobes is a hidden gem here in east Las Vegas.  Authentic typical mexican comfort food prepared by Mama and Papa.  This place offers breakfast dishes like huevos a la mexicana, huevos rancheros, chilaquiles and more.  For lunch there is tacos, burritos, tostadas, taquitos, flautas, tamales, beef soup, pozole, menudo, seafood soup, ceviche, carne asada, goat stew(birria) and it goes on.  Mexican soda pop, beer, coffee, and other drinks.  This place takes cash only, and it is very inexpensive.  So splurge!",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2017-03-27",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "G7Ca2lgiFKKpv1v8glT4KQ",
  "review_id": "JpMaC6NnsBgR_K20C7iSGA",
  "text": "Decided to give this place a try since I was craving pad thai. Went right at 11AM and ordered the lunch special shrimp pad thai and a side of sticky rice to go. They asked the level of spice from 1-10 and I said 3.\nOnly waited about 12 minutes and it was ready.  Presentation was nice and looked really good. Sticky rice was exactly that, sticky rice. I've had better but it wasn't horrible. The salad was small but tasty. The egg roll was crispy and I really enjoyed the glass noodles inside. It was a pleasant surprise. The pad Thai had 5 large shrimp which isn't bad for a lunch size portion. The flavor profile didn't quite have enough of the peanut flavor in my opinion but was satisfying. However, I would think that a level 3 out of 10, my lips and mouth should not be burning afterward and they are. Overall a fairly neutral experience. I have had better and it was a little higher priced than I would have liked, but it was definitely better than the peanut butter jelly sandwich I was contemplating eating.",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 3,
  "date": "2017-11-20",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "bGBp3ptS25gzxmFhVfB7WA",
  "review_id": "pdUZ5ABoMdwO6S3c6O99DA",
  "text": "Yum!!! It's fast and super cheap. Everyone hustles and makes sure the line moves. Kitchen is clean. Only complaint is they need to clean their tables more often... I'm sure it's hard because so many people are moving in and out. And it becomes near impossible to park your cart and the seating area...... but it's all good. Can't beat the price. Churros are yummy, pizza is bomb, chicken bakes are good, and the Polish dog combo can't be beat. The ice is like the small chunky ice but bigger so it's log like ice? I like it. Pepsi products for beverages too. All IN all, It's great to eat for your before Costco fuel up OR the after burner.... that is if you don't get too full from the samples around the store",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 4,
  "date": "2016-07-11",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "cHHrNTGyJQHqktOc8sL8iA",
  "review_id": "gWs1bfMFC9QTF-vTRKagVA",
  "text": "Newly opened pho house. I tried the combo beef pho and it was very good.The guys running it are trying to accommodate the local pho eaters and what they want. Check it out and make suggestions if needed. I made a few and they were very receptive, just minor things may new place experiences.",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 5,
  "date": "2017-07-01",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "zXj4PlDxzh7cVl9wM7x2sA",
  "review_id": "Jf_KLP533K5TYmeVO1HsCw",
  "text": "Sadly, this place is now closed :(\n\n\nThis place is easy to miss. Its just a counter with some stools near the poker room. They use quality Boar's Head meats and they have some spectacular sandwich choices. I forget the name, but they have one with horseradish in it... it stung my nose and made my eyes water but I could not get enough. \nThe people behind the counter have always been very upbeat and accommodating.\nConsidering all the other things I have eaten downtown (buffets included) it would be a shame if you didn't eat at least one meal here.",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 5,
  "date": "2010-04-12",
  "useful": 1,
  "cool": 0
}, {
  "funny": 12,
  "user_id": "bLbSNkLggFnqwNNzzq-Ijw",
  "review_id": "mT-H1W9dN13y2YwF_agujg",
  "text": "Chef Oscar's Vaca Saltada bocata was love at first bite: succulent braised beef topped with gooey manchego, brightened up with red onion and spicy yellow chili-mayo. The tender, juicy meat is comforting and delicious, well-balanced with the other ingredients, packed into a sturdy fresh-baked roll. Praise calling this \"the best food truck ever\" are not overstated. Boqueria Street is the real deal, bringing Spanish street food to the food truck followers of Las Vegas. They are well worth hunting down, driving out of your way, and rearranging your schedule. The food lives up to the hype and then some!\n\nOther standout menu items include the classic Jamon Serrano bocata with ham, mozzarella, and truffle mushrooms. The patatas bravas always make a great side with a zesty sauce and green onions, and are a generous portion for the $5 price tag. The croquetas are not always available, so get them if you see them- they're as tasty as the version served in a shoe on the Strip, at a fraction of the price.\n\nTruly a menu with something for everyone. If you don't do pork products, there's the Pollo (chicken) bocata. There's a veggie roll that can be vegan-ized. Even pescatarians have the Gambas shrimp appetizer. And those are just the regular menu items! Each time I've found the BS truck, they have several featured special items, too. \n\nThough they may \"just\" be a food truck, the attention to detail and quality of product they put out is easily comparable to what is available at brick and mortar options. The exterior is pristine, with ambiance added by bistro tables topped with small plants for a dining area. Chef Oscar and his assistant are always armed with a smile and, if you ask nicely, a sample of jamon iberico!",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-06-06",
  "useful": 26,
  "cool": 23
}, {
  "funny": 0,
  "user_id": "W5ceBZvFHo7yVVvFCcKzpg",
  "review_id": "nZX3JlERv2YWlBCVHNc5ng",
  "text": "Absolutely the BEST Mexican Restaurant in Las Vegas!!  A diamond in the rough!!  Authentic, real Mexican food. Reminds me of my childhood. No, it's better than that!! Hope my moms not reading this. Best Mexican food I've ever had in my life!!! Don't pass this up. \n\nFamily owned and operated quaint little spot to catch some real homegrown Mexican food. Every time I'm in Vegas its a must stop for me and my whole family. We love it. Definitely one of the high points of any of our trips to Vegas! We love this place!!!\n\nDon't believe me, you have to experience it to believe it. Order anything on he menu, from Mariscos(Seafood) to Burritos to Chile Rellenos to menudo and Pozole, and be prepared to be WOW'ED!!!! Give it a try. You won't regret it.",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2015-09-10",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "eia3TgoWykyZ_KVlnkYAjw",
  "review_id": "QkqYIL2FHfhuQn5smXcu8Q",
  "text": "The girl tonight was horrible rude.... flipped me off called me a bitch in front of everyone.",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 1,
  "date": "2017-08-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "8GOrinzSGFIefx9LWeOfYQ",
  "review_id": "hlaMCJ6uvoWDkkUdbRcuCw",
  "text": "This is inside the Rio.\n\nThe food is good, but the prices are high compared to China Town.  This is expected being inside a casino.\nYou can use points for the food which is a plus for gamblers.  If I want free Chinese food from comps, I always go there.\n\nFood to order:\nsalt & pepper shrimp\nsea bass\nsalt & pepper string beans",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 4,
  "date": "2010-12-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "WlhETinld_UJHcFp6F8C0Q",
  "review_id": "ara5zAVIorlDMJUGYx8WfQ",
  "text": "Bonafide 5 stars--innovative dishes, quality across all the selections we ordered, great service, fresh decor and that hard-to-describe wow factor.  Everyone was so personable and customer-experience oriented.\n\nOn to the food.  Their twist on porchetta, rotisserie style, makes for a fabulous and savory filling in a large ciabatta roll. The amber cracklings added some snap to the generous sandwich, topped with peppery arugula tossed in seasoned olive oil. Listen up pork afficionados, Hawaiians and Filipino compatriots--if you love porchetta, lechon and roast pig, you will love this sandwich!  If your dream sandwich includes beef instead, prepare to be happy with their tender tri-tip. My hubby was made very happy with his choice. Let it be noted that he had to take home the remaining half of his sandwich because #1, we were given samples of their delicious spicy beef broth soup and chicken cilantro rice soup; and #2, we gorged ourselves on their hummazing hummus and hot fried pita triangles, in addition to herb seasoned french fries plus fry sauce (yay, a noteworthy resemblance to yummy Utah Greek diner fry sauces).\n\nThe owner, I believe (Minnesota man who also loves hockey) let us try their frozen, fresh yogurt made today by his wife.  Creamy, tangy and lemony flavored goodness, topped with crushed honey-soaked baklava.  WOW, I would stop in here just for that!  Who am I kidding? I would stop in here for nearly anything on their menu.  The only thing I would change is to move them closer to where we live!",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-12-11",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "5KaJQ555lHCaOQ5ajeLZAw",
  "review_id": "fDHMGjxp1uTU2ymVl-D86A",
  "text": "Probably the most authentic Mexican taqueria on the east side of Las Vegas. At first glance this restaurant seems like your ordinary hole-in-the-wall taqueria, that is until you try their food. I ordered the tacos de lengua. Initial thoughts upon opening my to-go container were that these tacos look like any other ordinary tacos, then I bit into one of these delicious meat vessels. The meat was tender, lightly seared to perfection. The salsa was incredible.",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 4,
  "date": "2014-08-22",
  "useful": 1,
  "cool": 0
}, {
  "funny": 3,
  "user_id": "5DFshFQlbQiQTvtzH7qwlA",
  "review_id": "O-HHncvhY2w6uEyXEv7cSA",
  "text": "Having just opened, there is definitely room for improvement. \n\nMy co-workers and I have been looking forward to adding Canter's to our list of nearby lunch choices for days when we can't stomach free EDR food. After about a year of waiting, we practically gave up on this. Needless to say, we were thrilled when it opened seemingly out of nowhere. \n\nWe made plans to have a group lunch the Wednesday after opening. After a crazy morning, those plans changed to placing a group to-go order, which one of our team members graciously took on. \n\nUnfortunately, despite having a very clear list of everyone's choices, our team member came back to the office over an hour after leaving to find that several of the orders were wrong. \n\n- a diet soda was missing \n- crispy chicken sandwiches were replaced by grilled chicken sandwiches\n- reuben sandwiches were replaced by just pastrami or corned beef \n- a salad that was ordered was not placed in the bag \n- a few other things I can't remember since I didn't run the order\n\nIn addition, the dessert menu was not yet fully up and running. Our team member ordered what she could based on what was available. However, we were disappointed to find that a number of dessert choices were outsourced from Freed's.\n\nOther than the service/flow issues, the food was great. Latkes were crisp and delicious. Pastrami and corned beef were juicy and tender. Bread was fresh. Matzoh ball soup was savory and deep. I'm hopeful that the kinks will be worked out and we'll have a reliable pastrami/deli option for lunch soon.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 2,
  "date": "2017-10-31",
  "useful": 3,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "UhYDEtbi_iaN2Ml-LfJwOQ",
  "review_id": "Q6tm2hU7NQCCizMK1lLcuw",
  "text": "This is my go to spot almost every Sunday morning with the family best authentic Mexican food in town !",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2017-02-15",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "gxlxakxEgvE1PYMRvPYgHQ",
  "review_id": "wvopKQbODvfiHVXhlaGpCA",
  "text": "The chicken breading was a little bland which disappointed.\n\nThe biscuit was different than what I am accustomed to but it was good.\n\nI enjoyed the baked macaroni & cheese.",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 2,
  "date": "2015-04-19",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "-_1Dat_DKqaZlEcs58UPUA",
  "review_id": "BB8BHMbRybGlqlNgGxOp1w",
  "text": "Delicious food giving away Prices are unbelievable stuff absolutely amazing setting love the patio the food was delicious highly recommended really on beatable",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 5,
  "date": "2017-11-27",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "7J0IbADAaexx92EWbYdAUA",
  "review_id": "oB50wff6uOUpJRxvl8PHNA",
  "text": "Second time I've gone in and had the worst meatball sub.  I used to get a delicious sub but now I get a microwaved, dried out sandwich. Dry meatballs. Top of the bun over nuked and rock hard, bottom of the bun completely soggy mess.  Good thing the bartenders are AMAZING! Friendly staff will bring me back, the food definitely will not!",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 2,
  "date": "2016-04-17",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "Ddcnp2s4b8GQjb34eUSYag",
  "review_id": "H-3JNuYxAeOBfkuLrQ5vAA",
  "text": "Grumpy servers and bland food. If that is your thing, then I can strongly recommend this place. \n\nI don't, so I am not going back.",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 1,
  "date": "2015-06-13",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "M4KH_eINRCAnxS6PwOjfDw",
  "review_id": "vUAEKHUhMM1jKunZL3vBxw",
  "text": "True authentic style Mexican food. I have tried almost everything on the menu. My favorite is the $1.00 chicken tacos. All the food is good; however, the service is always a little slow.",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 4,
  "date": "2015-06-11",
  "useful": 0,
  "cool": 1
}, {
  "funny": 2,
  "user_id": "hiakjDddWXWh5BCDv9I4ZA",
  "review_id": "sXCR-IRdEucCSLbn68XL4g",
  "text": "This deli is inside Binion's Horseshoe Gambling Hall in downtown Vegas.  Its on the poker room side, right outside the poker area near the steak house entry.\n\nWhat a GEM in the rough!!!  Its a quick snack shop with about 10 stools at the counter and a couple of tables.  Blink and you'll miss it.  But if you pass up the opportunity to eat here, you'll regret it!!!\n\nBefore I moved to Vegas, I used to actually go out of my way on trips here to stop in and eat here.  OMG.  Best deli pastrami this side of Billy's in Glendale, CA.  Hands DOWN.  Side of potato salad and a pickle sliver...nothing BETTER.  My other half loves the corned beef, and the prices are really reasonable.  \n\nWhat do I consider a perfect meal in Vegas?  A pastrami sammie at the Shoe, and a double scoop of Lappert's banana caramel across the street at the Cal.  Yum.  Perfection.",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 5,
  "date": "2008-11-19",
  "useful": 5,
  "cool": 3
}, {
  "funny": 0,
  "user_id": "tcWxkajdSavurL1IAUJMlA",
  "review_id": "DHAbHniPsFKi5nZWQ3Enwg",
  "text": "We decide to have pho for breakfast.  This is a new joint.  We all order pho Tai bo vien.  The broth soup is a little lighter than most of other pho places.  If you like healthy pho, this is it.",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 4,
  "date": "2017-08-07",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ss5nenhJgoWBunT1QfL8Vg",
  "review_id": "UB0OdPi-laXUAo3X1XYdFQ",
  "text": "Amazing!!!! The burgers and sandwiches are so tasty!! I have to say though the patatas bravas is to die for!! If you see them check them out!!",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-11-20",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "jxyn_AhI_DY36Nd8KId36w",
  "review_id": "oEYn8Nxn__XtgVCS7vt0VA",
  "text": "99% of the time we stop by eating here after shopping. I always order the Hot Turkey and Provolone sandwich for $3.99 (turkey, provolone, red onions, tomatoes, & pesto on a hot ciabatta roll). Nom nom. \n\nHow can anyone not like Costco food court? Decent food for outrageously cheap prices.  For under $10 I can feed my family of four for lunch. Total WIN! in my book.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 4,
  "date": "2013-01-08",
  "useful": 3,
  "cool": 3
}, {
  "funny": 0,
  "user_id": "Ptv3b4b_nbpF0SlTWlUdWg",
  "review_id": "oqiI5v8P6ozSoBlVsK5F9Q",
  "text": "Costco food court is fast, efficient and decent quality food for the price.  You get an large pizza (I think 18 inches) no toppings for $11!  You should ask for the pizza to be well done with extra cheese and extra sauce! They will do that for free.  Also don't ask for them to cut the pizza in squares....that is one thing they don't know how to do which is so disappointing and baffling that they can't do this!  \n\nSo I ask for it to be uncut.  The other food does not look appetizing at all so I won't ever buy it.  The pizza is decent given that Las Vegas has no good pizza places around in the Northwest.  \n\nDon't forget you can call in an order which is super nice and they will have it ready for you when you arrive! \n\nOf note... when I did call in a pizza, they person commented on how my ethnic name was \"weird sounding...\"  I did not appreciate that.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 4,
  "date": "2016-07-10",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "fgoTS5v3LKDsLwwgJQaeYg",
  "review_id": "knRmaq-r0mmduY5UTmubZA",
  "text": "Full disclosure:  first time at a SkinnyFATS, and certainly won't be my last.  Uber stoked they opened a location in Downtown Summerlin. Happy happy joy joy!  Perfect for my super-strict cutting diet (hangry face).  I decided to try the Gobballs and Cauliflower rice. Hubs had the Patti melt w garlic truffle fries (he eats whatever he wants because the man literally burns calories when he farts).\n\nFirst the service:  wow.  I felt like Norm from Cheers.  They all shout hello when you walk in.  The girls at the register were patient as we perused the menu.  Pretty simple to ascertain what's healthy and what's not good for your ass.  Or thighs. We placed our order and received our noms in about 20mins.\n\nMy grub:  how does one rate Turkey meatballs in pesto and arrabiato sauce?? I found them delicious, but yeah...i can recreate this at home perhaps. Ditto for the cauliflower rice. Not dazzling. It's a damn veggie. BUT...again...i ordered as calorie conscious and macro efficient as possible. All in all, tasty enough and would def order again when hangry for a light meal.\n\nHub's grub:  I mean....he inhaled it.  By the sounds escaping his lips and gastrointestinal tract, you could clearly tell he loved it. He kept affirming this by repeating..\"...wow...sooooo good.  Damn.  These patties are juicy!  Bread is toasted just right!  Perfect amount of cheese! Omg!!! Best. Truffle. Fries. EVERRRRR\".  So yeah. Guess he enjoyed his noms.\n\nWe (especially me) will definitely be back. Lots of appetizing eats to try.",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 4,
  "date": "2017-12-02",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "hpnys6ZjW7d7SMYct6t10A",
  "review_id": "U82Y12RE6iSzKACow4nXxA",
  "text": "Great place!  My husband I went in there for the first time on a whim, just a few beers.  It is super clean, modern and the staff is very friendly.  They have a super happy hour with 2-$5 big draft beers and $5.00 appetizers.  We had chicken fingers which was more than I could eat that came with 4 big fingers and fries...  Hubby had hot wings, 12 nice sized wings in the basket with veggies.  It was great good for $10 and the staff is really nice!",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 5,
  "date": "2013-06-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "G3n8f8farW1SDBitauKFYQ",
  "review_id": "CXQIOCJ5s4W-k90NAu2HdA",
  "text": "It makes me so sad that I don't live in Las Vegas, otherwise I'd make sure to catch Boqueria Street whenever I could. I first tried their Vaca Saltada at the Life is Beautiful festival and I fell in love, I began scheduling the rest of our weekend to make sure I could get a chance to grab another one before we headed home. Their sandwiches are so flavorful and the bread is phenomenal. I can honestly say I have never had a better sandwich in my entire life. And a major plus is the people who work there are so nice! I think I met the owner and he was super helpful! The next time in Vegas I'll be hunting this food truck down and inhaling all the Vaca Saltadas I can. I don't have a photo of this sandwich because I was way too busy devouring it to think of taking one but I noticed a few fellow yelpers posted some photos. You guys are awesome!!",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-10-03",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "39_8yhWlg9KiHXCpetJUBQ",
  "review_id": "-VBPcyjZr-uft4cOxylOsA",
  "text": "Not to be a downer, they just opened, but this is fast food with a Summerlin slant. My kiddo suggested this spot for dinner because she knows I prefer low carb, good fat. So those who are Paleo and keto, they have options but they don't promote them. Goes against the name! \n\nMy daughter got the spicy chicken salad & frankly I can't remember what her boyfriend got. Something with fries. Err, the salt and pepper shakers were cute. \n\nGreat atmosphere and location for those shopping in the area. I think this is one of those places that has focused on interior more than food. Only time will tell if they up their game. Perhaps they can't showcase quality ingredients with higher rent...",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 3,
  "date": "2017-12-11",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "YO7ixeSToiTQ9Teu7wc48A",
  "review_id": "yA6y0yqouufSNRPdi8V1NA",
  "text": "Ok I will admit I have been going to multiple places for a fresh not dry French Dip with real Au Jus not available in Las Vegas until now. Canter's offer a thinly sliced homemade Prime Rib sandwich with a great homemade Au Jus it tastes just as if it was out of my kitchen if I had the time to cook Prime Rib fresh and make the Au Jus. Customer Service is good especially for a brand new place.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 5,
  "date": "2017-11-29",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "J4X9oyZeCIUUD-5XZps8Gg",
  "review_id": "LRfmlLffZnbYqYr_pBz25A",
  "text": "The dopest! Always something chronic to eat at SkinnyFats! Their juice definitely has the squeeze!",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 5,
  "date": "2017-11-30",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "Yxpo9A_0jDIdwnXQSMcZJQ",
  "review_id": "R11u9UkAaxoJcIQOtIBs6A",
  "text": "I came at 10:50 pm hoping to get a sandwich for the movie theater and they told me that it was closed. Sad!",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 1,
  "date": "2017-01-27",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "hy5zyabymE_bBx1p2jDWyQ",
  "review_id": "duL58lXEKwET-4jLakE1nQ",
  "text": "Service was good by Michelle but was told we could not order ribs in the cafe, what's so said they cooked it 4ft from our table for Benny's Smokin ?? Plus they have in the same menu as in cafe makes no since",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 1,
  "date": "2014-10-25",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "aCBQdKDOmadx9oOE6RlhTw",
  "review_id": "LTMBl7CzBVflx0lbnMpChA",
  "text": "This isn't great food, it's simply a place you hit up when you are trashed and need to fill your belly with grub so you can sober up.",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 3,
  "date": "2011-06-21",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "A3SSi5bY1taLkJoKo00uDw",
  "review_id": "bTymTMTgg3bjhkXAabHiHw",
  "text": "First time eating here. My wife loves Mexican food. We had lunch and I had a Carne Asada Burrito and she had  Machaca. We were both please.  I took half ok my burrito home.",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2017-09-20",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "DqfB47fIOTuvVY3ARmDtxg",
  "review_id": "Wi_Z8O3ZuzneRGIuFJjeqA",
  "text": "Tried out this new rotisserie sandwich restaurant (opened for only 4 weeks!) for a light dinner and it was awesome! Chicken soup sampler was delicious, Tri-tip Plate with their garlic sauce with black beans, roasted potato, basmati rice & pita bread was very done right, and the Porchetta Sandwich was on point  - crispy & flavorful at the same time! We will definitely be back!",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-12-04",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "S-dfqUtbu7JybeU6mOTWmQ",
  "review_id": "3Z7IMe5HHkZEoz9_7CmoqQ",
  "text": "Not really into sandwich places but I was in Santa Fe Station and hungry so I followed a friend's advice and tried it. Out of all the food choices in there it did seem the most interesting one.\n\nGot the Capastrami and I must say it was nothing short of amazing. Juicy without being sloppy (in fact there was not sloppiness at all) and just the right amount of dressings and meat. The pastrami itself was flavorful and juicy with a hint of fresh spices and the serving was very generous. Next time I'll try the Bobbie which is their most famous sandwich and was told it tastes like \"Thanksgiving dinner in sandwich form\".\n\nThe prices are a bit on the high side (paid about $9.5 for it) and there might not always be a table to sit in but that should not prevent anyone from trying it, especially if you happen to be in the Santa Fe Station.",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 4,
  "date": "2012-02-06",
  "useful": 2,
  "cool": 1
}, {
  "funny": 14,
  "user_id": "bLbSNkLggFnqwNNzzq-Ijw",
  "review_id": "oOr8O1t5P4k-6_0agwZxDw",
  "text": "Yes, five stars. I went in on Wednesday for lunch, came back on Thursday for dinner, and I'm still trying to figure out how I can go back again ASAP. The location is cute and clean, the service is engaging and informative, and the food is tasty and fresh!\n\nThey're marketed as a rotisserie, and their chicken plates are a highlight, but I have so far stuck to their sandwiches.  The porchetta is amazing, hearty and juicy with a nice crispy skin for contrast, piled on a hearty artisan roll with arugula, parsley gremolata, and a lemon sauce. It was a fantastic lunch, and I didn't eat for the rest of the day because I was so full.\n\nThe tri-tip sandwich was also tasty, with a heap of caramelized onions and a really great garlic sauce for kick. This paired well with their fries, and again, it was a humongous portion. They have seasonal soups; I preferred the beef over the chicken. Their warm and chewy pita chips are my favorite version I've come across; the $4 portion with creamy hummus is huge enough to be a meal in itself.\n\nBoth visits have treated me to lots of staff interaction, from answering my annoying questions about the food to trying samples of other dishes and getting detailed info about their menu and concept. Everyone here is very friendly and everything is made fresh in house, from the sauces to the breads and everything in between. Looking forward to coming back for their chicken pita next time!\n\nEDIT: Returned for the chicken pita! It was bomb, and so healthy too. The green goddess dressing is delicious, they really do have amazing sauces here. Sided my order with the the Brussels sprouts, which are nearly the size of golf balls, and lightly roasted and seasoned. Perfection again!",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-11-07",
  "useful": 28,
  "cool": 17
}, {
  "funny": 0,
  "user_id": "RQACRddbY3n_XbIzr3vOSg",
  "review_id": "W79zGXeX110NJUYUfzBqNg",
  "text": "Love the cran slam club. Great location inside Santa Fe station and also open till 2am which is a plus. Friendly service",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 4,
  "date": "2014-08-02",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "zsgpWGkW5drWyHf27gOT6g",
  "review_id": "QPw42vl53R7C1TeYCFN5RQ",
  "text": "Fucking delicious... I thought item was small at first a little larger then hot dog but was filling... ingredients on point ... freeeeeesh bun warm and fluffy but crispy",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-10-13",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "_t2D0Cf9gI8bIY3JeuwxJA",
  "review_id": "4xGDFq6YWYlxbd-xHvMCOA",
  "text": "This Mexican marisco restaurant is a true gem . The food is amazing and service is great . Prices are justified by the amazingly delicious food .",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2014-06-01",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "EMDntp5JeAfwF7JkIoenow",
  "review_id": "KNkiMcgH2Vq-7huXeKlRIQ",
  "text": "Better than I hoped.   I was psyched to hear SF was coming to the hood.  I'm a weekly regular at other locations closer to the office.  This one is bigger and better.  This place keeps getting better!",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 5,
  "date": "2017-12-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "prBGBePwXU0fxFgRBHsSNw",
  "review_id": "uuj5OrrU9X1f48ni7QTThg",
  "text": "The had their chicken sandwich and thought it was on par to their porchetta sandwich which my girlfriend had. We also got to try their soups which were both really good! I will be back to check out their other sandwiches with their innovative homemade garlic sauces! UNLV students will be lining up in this place.",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-12-11",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "84GX_-KBDIdNcQSN1A7X0w",
  "review_id": "JPuTpyyX-paFuPjqog_w6g",
  "text": "Been coming here for many years. It has never let me down. Food is really good portions are big had to share my plate. Give yourself time to come and enjoy this place.",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2017-08-05",
  "useful": 0,
  "cool": 0
}, {
  "funny": 40,
  "user_id": "Fv0e9RIV9jw5TX3ctA1WbA",
  "review_id": "0HbKxDG2Fqtx_Del8JrdoQ",
  "text": "I've eaten several menu items from this truck. It's found all over town, but they usually are where the Food Truck Party is scheduled each week and worthy of trying. The guys working are nice and seem to genuinely care about putting out quality food that tastes great. When you place your order don't expect to get handed food right away. They make everything to order and it can take time, but it's well worth it. \n\nJamon Iberico ($13) - This is some tasty ham! The split-top rolls that they grill in butter really hold the fillings in nicely and tastes great. While I like this sandwich, I actually recommend the quesadilla which is stuffed with iberico ham, mushrooms and mozzarella. \n\nPatatas Bravas ($7) - This is a full portion, but you can add a smaller version for $3 to any meal. The menu describes this as fried potato wedges with Barcelona style spicy sauce. I like the patatas bravas a lot, but the flavor hasn't been consistent each time. Sometimes the sauce it much spicier than other times and even has a different color. \n\nVaca Saltada ($11) - Braised beef, manchego cheese, red onion, spicy yellow chili mayo on a split-top roll grilled in butter and topped with pretty edible flowers. The beef has great flavor and all the fillings compliment each other well. This sandwich was well liked by all in my group that tried it. \n\nCroquetas ($7) - There's chicken inside these fried tasty gems. You get 4 of them in the order and side of Parmesan cheese bechamel for dipping. I feel like you should get at least 5 of them for the price given how small they are, but they do taste good. \n\nThey also have chicken, sausage and veggie options. Check their social media pages to see where the truck will be next.",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 4,
  "date": "2017-09-15",
  "useful": 64,
  "cool": 66
}, {
  "funny": 40,
  "user_id": "Fv0e9RIV9jw5TX3ctA1WbA",
  "review_id": "yL9-78_Ixc51Z0rn0ghXKw",
  "text": "I often stop here for a bite to eat after I am done shopping, but I often call ahead to order a whole pizza for pick up. The people working have always been friendly and great about the large orders I've placed for parties. Whole pizzas are 18 inches, priced at $9.95 and you can choose from cheese, combo or pepperoni. I have asked for just sausage on a whole pizza before and since the whole ones are made to order they didn't mind customizing the pie with the toppings of my choice, so just let them know when ordering a whole pizza what you'd like on it. My hubby likes the hot dogs and I do as well from time to time like one with mustard and sauerkraut, both of which are options over by the condiments section where you can dress your dog. The hot dogs are only $1.50 and come with a 20 ounce (free refills) drink. Churros for a buck, sandwiches and the very berry sundae are also offered. It's nice that after all of these years with the price of everything going up that Costco still offers cheap and tasty eats in their food court.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 4,
  "date": "2017-02-13",
  "useful": 52,
  "cool": 54
}, {
  "funny": 0,
  "user_id": "TprC8sujz8MkwuomrqUSiw",
  "review_id": "X7DXKSF63xF1EGK4GdLLVg",
  "text": "Got the Barcelona Sausage and \"Xino Xano\" Fried Rice for lunch. Super duper tasty. In terms of truckfood they are definitely well above average. If they had a brick and mortar store I would probably frequent them fairly often.\n\nYou would probably not regret giving them a try.",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 4,
  "date": "2017-03-11",
  "useful": 3,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "HfI1OZEKW7Sh5hgMjVQeEQ",
  "review_id": "3R9U1H5kozLWn5u2E_1I1g",
  "text": "This place is the bomb!!! They have your typical Mexican dishes that are all good flavorful and really cheap too! My husband had a carne asada burrito smothered in green chili and topped with cheese. I had sopes (chicken and deseprada AKA shredded beef) they were amazing! The beans are to die for and the service was great! I will be going back to this place for sure!",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2011-04-04",
  "useful": 3,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "eNiGzIG27r9e6x_6eAwe4A",
  "review_id": "8ISYHFAVn9OljLmRNSG-tw",
  "text": "This is probably the go to place for a hangout eat or just a late night grab... came in with a good size group of friends at 8pm. Most of our group had the endless apps , a go to choice by many. I had the steak and lobster with two sides... Their food was prompt and accurate; however, my order took 41 minutes. Not only was everyone else on their 4th appetizer by the time I received my food, it was not cooked as ordered. My fries were soggy with blood,  and the lobster tail was grilled from the outer layer and raw underneath. After bringing it up to the waiter's attention he just said he would take it back without any acknowledgment to the mistake or wait time.  Decided to bring it up the manager,PAUL,for constructive criticism and before I finished explaining everything he interrupted with \"the appetizers take a while\" . .. I don't know where he usually dines at or how long he's been in customer service but that's unacceptable. There is no way you can tell me that you'll serve the whole table until they can't eat anymore before putting in my order. I'm a paying customer, I shouldn't have to wait for the fourth round of endless apps to get my order. Another tip, before you give a customer a ridiculous excuse.... it wouldn't kill you to address the issue and apologize for the inconvenience. Just $25 down the drain, if you're considering TGIF just make sure you're not hungry if you're ordering anything that doesn't fall under endless apps.",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 1,
  "date": "2017-08-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 40,
  "user_id": "Fv0e9RIV9jw5TX3ctA1WbA",
  "review_id": "RU9uSn4btVTSfpmfyBzoQQ",
  "text": "This Capriotti's is located inside the food court (where Lone Mountain Buffet used to be) inside Sante Fe Station. You can place a phone order or walk right up to the counter and order. There is plenty of tables with seating in the food court and the area is usually pretty clean. I have had both the Capastrami and Bobbie from this location several times and it's been constantly tasty. The employees are friendly and I like that they accept the rewards from their app as well coupons that come to my e-mail. Having the app gets you freebies like cookies, drinks and sandwich upgrades as well a free sandwich after purchasing so many. Make sure to check the bottom of your receipt they sometimes have discounts towards your next purchase. This is a decent place to grab a sandwich hot or cold.\n\nCapastrami ($8.49 for a small) - Hot pastrami, Swiss cheese, Russian Dressing, and coleslaw. This is definitely my favorite sandwich at Cap's. The coleslaw is made fresh daily and it just tastes good. I order it to-go often and it's still hot and delicious by the time i get home to eat it. \n\nThe Bobbie ($7.59 for a small) - Homemade Turkey, cranberry sauce, stuffing, and mayo. It's like they took all the leftovers from Thanksgiving and put it between bread for the ultimate leftover Thanksgiving sandwich. The turkey is made fresh at each location and hand-pulled. I really liked how this last Thanksgiving they had the option to add a side of gravy, score! Where has this gravy been? Please bring the gravy back as a regular menu item because it pairs so nicely with The Bobbie! This is the perfect sandwich to pack for a picnic lunch, hike or to take with you to work for lunch because it holds up well. \n\nThe bread for the Cap's locations here in Vegas and Henderson come locally from Great Buns Bakery and is delivered fresh to each location. \n\nSizes are as follows and it's worth noting because to this day I see people ordering a large and then they get so surprised at how big it is:\n\nLarge - 20 inches\nMedium - 12 inches\nSmall - 9 inches",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 4,
  "date": "2016-12-17",
  "useful": 50,
  "cool": 53
}, {
  "funny": 0,
  "user_id": "Z6GXlB0c2vQ36Zws79nsjQ",
  "review_id": "BOUqtNJ2qloXscE6Yd0bRg",
  "text": "I've first went to this resturant in Canada, and so when my family and I stayed at Caesar Palace and saw this resturant, we immediately thought we should give it a try. The food was good, and the staff were very nice. What i didn't like was the atmosphere. Don't get me wrong it's gorgeous in there, but i feel like I should be eating french cuisine or something and not family styled chinese food.",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 3,
  "date": "2009-12-08",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "G8zjsO53QjfTBbpABtdBUw",
  "review_id": "aieMqfODCnjLI4l3B-2j_g",
  "text": "Just tried it, great sandwiches! Tried both the lobster and iberico sandwich and the vaca saltada. Totally different sandwiches, but both amazing. Chef Oscar's the best!",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-06-26",
  "useful": 0,
  "cool": 0
}, {
  "funny": 8,
  "user_id": "0tvCcnfJnSs55iB6mqPk3w",
  "review_id": "PKL3tKGoLnvCnEuLMeiULw",
  "text": "Just Opened and if the poor service and high prices keeps up it might soon end up Just Closed.\n\nI miss the New York delis. I had looked forward to Canter's coming to Summerlin. As it turned out, the place is infested with astronomical prices and infinestimal service. My brother was so disgusted by his $20 pastrami sandwich plus $3 for a side dish that he wrote his second Yelp review.\n\nI knew that Canter's was opening a second Las Vegas location on the Strip. In the front of my mind I knew that if a pastrami sandwich is close to $20 in Summerlin, it would be off the charts expensive on the Las Vegas Strip. When all is said and done, I wasn't chomping at the bit for this Canter's to open.\n\nThroughout this week we'd pass through the Linq between the Orleans shuttle stop and the Strip. Near the High Roller on an empty storefront door there was a small sign saying that Canter's is Coming Soon. I was surprised when I was walking in the Linq when my olfactory senses alerted me to Canter's. Only a few hours ago, it was an empty storefront. Canter's had just opened a couple of hours ago. Expecting price shock I asked if there was a take out menu. The friendly lady said they had been open about an hour and that I can take pictures of the menu. I did just that, then outside the Linq evaluated the choices. Astonishingly a pastrami sandwich on the Strip is a few dollars less than the exact one in Summerlin. And astonishingly, this deli does not offer the very popular deli staple: kosher. However, they do offer an egg salad sandwich, which is not too common in Las Vegas. So, I followed my olfactory senses back to the aroma of deli food. Disparite from the majority of the menu, the price for the egg salad sandwich is fair. The egg salad sandwich with the choice of bread (including a bagel) and two sides is $9.25 and a bottomless plastic cup of a Coke product is $3.\n\nThe same friendly employee that greeted me a few minutes previous nicely told me to seat myself. In this large room filled with Canter pictures and a new restaurant scent, I sat myself then waited and waited and waited. I'd even change my seat to the center of this uncrowded newly opened deli. Finally a server asked me what I wanted to drink. A Coke ($3).He'd place the drink on the table then the service disappeared. It seemed that I likewise disappeared. Servers just passed me by. Service was nonexistent. I'd see the staff standing at the entrance of the kitchen. I'd even see a manager seated at a table across from me that failed to acknowledge me. Then there was an employee sweeping that failed to acknowledge me. Nobody offered me a menu, although I assume that I was supposed to take one when I served myself. After approximately twenty minutes of being the invisible man, I preferred to be a visible man and exchange my hard earned money with a waitstaff that acknowledges me.\n\nOn its first day of opening, Canter's does not have a bug to fix. Just common sense! If somebody is seated for twenty minutes without a menu, there is a good chance that he might want somebody to acknowledge him and place a menu on the table so that he could order something. Possibly even a $17 pastrami sandwich. Canter's needs to offer more deli food that reflects on their original location. This includes Kashe. Finally Canter's needs to rethink their pricing strategy.\n\n....................\nReviewer's note: I gave 2 stars instead of 1 optimistic that the Management team will read this review and fix the issues discussed in this review. Las Vegas has a shortage of delis. If Canter's Management addresses these drawbacks it has the potential to provide a much needed good deli in the Las Vegas market.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 2,
  "date": "2017-10-20",
  "useful": 9,
  "cool": 7
}, {
  "funny": 0,
  "user_id": "WJjUk1-gib1AD4u-q2VNYA",
  "review_id": "x-3l8sLj_2hya6lJOKQycA",
  "text": "Karved is a welcomed addition to the food corner at this Target strip mall by UNLV.  Stopped by the other night and got to try the meat platter with brussel sprouts/roasted potatoes and the hotdog. Meats (couple different to choose from) are from a rotisserie tasted really good, lot of flavor and cooked just right.  Karved does it's own take on the hotdog which was good as well. Chicken soup was also amazing, can't wait to get more of that for the winter. Costumer service was top notch, made us feel very welcomed.",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-11-19",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "MCc8F6ZGVGlLMJnGXpvDsg",
  "review_id": "YtTJgWdYfGEgSbfGWC4HNQ",
  "text": "Never disappointing, always get my chicken strips made to order, & I don't even have to ask. Friendly service and always recommend this place to my buddy's.",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 5,
  "date": "2013-04-27",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "rDtSxL2skoMnXjFwwvoqPA",
  "review_id": "-y_1vvrPwaqC05lEPdKEeQ",
  "text": "Whether you are ending your day on a drunken bender or waking up from a severe hang over, this is the place to be... \n\nThe Chili Relleno burritos are super yummy and are the perfect thing after a night filled with punk rock and debauchery.\n\nThe staff is super friendly and they always have your food out in a flash",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 5,
  "date": "2015-04-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "XU-JR0vGW1_O5GmNwZ0bfQ",
  "review_id": "FVyN_jIuyByBr6QxBBFKGw",
  "text": "Another Thai joint in the SW? Why not!? :) We were here for a late dinner with the kids and wanted to try the new Thai restaurant nearby. I remembered this place used to be another Thai restaurant a while back. I was super excited when I saw the sign \"Amazing Thai 2\". \n\nLocation: This Thai joint is located next to 808 sushi and AT&T store, in the same plaza with the Vons at Rhodes Ranch. It is a multi- stores plaza with huge parking lot, so finding a parking should not be a problem. \n\nDecor: Apparently, Amazing Thai did a great make over of this small cute place and made their own style. I loved what they did to this place, it was modern, looked brighter and chic. \n\nService was a two thumbs up. The server greeted us with smile when we walked in. Filled my hot tea and the kid's drinks. Service was fast, efficient, and attentive. \n\nWe were able to tried couple of their favorites: \n\nAppetizer : \nCrab rangoon: it was standard, nothing too special about it but we liked it. Two thumbs up on food presentation of this appetizer. And my kids loved the sauce. \n\nEntrees: \n- Pad Woon Sen with Chicken: this pan fried glass noodle with egg, veggies and mushroom was my kid's all time favorite. Their portion was generous and had extra noodles. The glass noodles was perfectly cooked and it was tasty. \n- Crab fried rice: another my kid's favorite dish. It was delicious with generous size of crab meat. \n- Khao Soi with beef: This was a Northern Thai specialized dish and not many Thai restaurant offered it. In Thai, they would used hand cut noodles (all hand made), and you could add your own choices of protein.  It was so fresh and delicious! Back to Amazing Thai 2, I was not fond of the beef texture, it was not tender and a little too dried. I also wished they used a different kind of noodle, a more flat egg noodle to maintain its texture after soaked together with the soup . I did LOVE the coconut curry soup based! It was on the sweeter side, but since I requested spicy level number 5, it was a perfect sweet spicy combination at the end. Overall, I thought Amazing Thai 2 did well on this dish.\n\nDesert: We had mango sticky rice and it was an average. Not a fan of the mango choices (used a different kind, not the sweet Thai mango). The sticky rice was not cooked thoroughly, some was way undercooked. I did like the coconut sauce and had to give extra credits on presentation. It was cute and neat. \n\nI will definitely come back and try their other favorite dishes and unique deserts (hint: their pot ice cream).",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 4,
  "date": "2017-10-26",
  "useful": 4,
  "cool": 5
}, {
  "funny": 0,
  "user_id": "l--K3xQWVqs93iFhAoEYag",
  "review_id": "E7WdBO-ZWlFvoMo0WSpeyw",
  "text": "I love this location because it's right down the street from me. It's clean and they have cheap food. It always hits the spot and I haven't gotten sick, which is a plus considering the cheap prices. The location is kind of small and has very limited seating.",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 4,
  "date": "2014-06-01",
  "useful": 0,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "Rv4QK75lIIgo660lv0e_IA",
  "review_id": "J1pRbeR1C2sP81ShtdewtA",
  "text": "Have eaten here many times with my food adventurous friend. It has never disappointed us. Our favorite is the Parrillada with Red Snapper. When they set the hot pan down on the table we always tell ourselves we will never be able to finish it all. WRONG!! If you look very carefully you might see us licking the pan for the rest of the octopus. Staff is very nice! Even if there is sometimes a bit of a language barrier we all figure it out and always get what we ask for. Would and have recommended Mar Y Tierra to friends.",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2016-06-24",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "C_Kv6zg_kWTXxJzRQx3hdg",
  "review_id": "ucPdMiFBlUqdv6WbJUwY_Q",
  "text": "Not impressed.  Couldn't get anyone to wait on me.. so I left and went to the Lodge @Tenaya.  Bye",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 1,
  "date": "2017-08-19",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "g8_8roieVRwGJVTpNOgbYw",
  "review_id": "OY7JC58crFnqvdEp_9fcQg",
  "text": "I love Cap's; when I ate meat my favorite sub was the Slaw and Roast Beef, and the Bobbie is great of course :) But not only do they offer great meat subs, they have Vegetarian ones too! \nThey use a soy based sub for their veggie subs, and it tastes really good. I got the veggie version of the roast beef and slaw sub, and my dad got the Bobby.\nI was disappointed to see that they skimped on the soy turkey, so it was essentially all slaw. The Bobby was perfect though, so it just seems like they skimp out on the veggie subs at this location. \nThey also have a soda fountain that is accessable by patrons, so that's nice- you don't have to ask them for a refill, just get your own.",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 3,
  "date": "2013-05-15",
  "useful": 3,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "1llEOrbw_1K3q5Kxqe2w2w",
  "review_id": "lTMzhzojTO1JN5XAPPpzjQ",
  "text": "We were looking for somewhere close to have breakfast and ran across this new restaurant.   I had the Corned Beef Hash and my husband had the French toast.  Both meals were delicious.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 5,
  "date": "2017-11-21",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "evDmfYHbxqDAy8_27bAUNg",
  "review_id": "Ad3HCG6qmVoahSRX2EyDEg",
  "text": "Overpriced Asian fast food...\n\nIt's not only Chinese - they have Thai and Vietnamese items... which I refused to try. I'm not a fan of Chinese food outside of Chinatown and SGV. We only came here because fast and easy.\n\nI got a BBQ pork plate - $6.88 and it comes with NO rice. The cucumbers taste horrible in it too. It's a small plate too. Very expensive for what you get.\n\nNotes:\n* It's actually made by Asians tho (saw them cooking in the back)\n* fast\n*expensive\n\nOverall... no thanks.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 2,
  "date": "2011-08-16",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "1PBd4DnHYeE9EjIyBX-T6Q",
  "review_id": "LGU-Xg1DK6j4n8oXniQovg",
  "text": "I shop COSTCO about once a month, I just found out last month that I could call in my order for pizza and pay on my grocery check out if I wanted, what a deal and for and only 9.99 I had a combination pizza about 16'. No waiting it line to order how great is that. Just bought one yesterday and it is very good as always. They have great prices on everything at the food court.. I am single,and I buy quite a bit of frozen food so much is wrapped individually I just take one out at  a time or just shake out what I need, so much cheaper than grocery stores especially the product, prices you cant beat.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 5,
  "date": "2015-03-08",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "aU9CLJZ3ny7SWSLW5OPZag",
  "review_id": "R4u3Ufjm_0gf5gUZGawndg",
  "text": "Placed a drive through order and asked for extra sauce since they charged and they said o.k. got it, but they didn't give me any, then just gave me 1 when I said they didn't give me any and then when I asked for more he said he charged for them. Dude that's why I asked for some when I ordered",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 1,
  "date": "2017-03-05",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "8pm4zifU9pizLy2e0U9XfA",
  "review_id": "gMxTkRi60ISaWFw4k6m5vw",
  "text": "Good food, cheap.",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 4,
  "date": "2012-05-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "YuwCrRziSKR7KSUCH0EM_w",
  "review_id": "eaCcdxZL0pFs6PrGp1Bfdw",
  "text": "I really enjoyed the food and the atmosphere. The service was great and reasonable in price for what you get. I only wish I would have came here sooner. I found a new favorite hole in the wall.",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 5,
  "date": "2017-09-01",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ik2LiDCMgHZ4SxeT9RJl7w",
  "review_id": "f7iQRa8g-PIY3C5iPLLgcw",
  "text": "Best sandwiches and hamburgers ever!",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-12-08",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "Z9rSlTj3pJr2eI7eqWIlZQ",
  "review_id": "CITPXlcXHVS35EWRySvTqQ",
  "text": "As opposed to southern CA locations, this place takes American Express. Like the branch in Tustin, CA, they use a line, but it is invisibly designated with yellow tape on the floor. Fortunately, during my visit, there was no confusion. At least it's better than the Irvine, CA branch.\n\nThe staff was nice and gave us our food while paying with no issue even though we paid with American Express. They were nice enough to explain that they dont sell those ice cream bars anymore. Functionally, it is no different than  other branches with the exception of the ability to pay with American Express.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 4,
  "date": "2014-12-28",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "ZZy5l8czsXm1T7TmLfBBjA",
  "review_id": "M9iAp-cDBg7iomm3qBh8Jg",
  "text": "I love this place. Always hits the spot. I recommend the chile relleno burrito and the nachos!! They never disappoint",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 5,
  "date": "2014-06-18",
  "useful": 0,
  "cool": 0
}, {
  "funny": 4,
  "user_id": "MZe_LcXsXv-U7y8Oa6RPVg",
  "review_id": "NW9t3FM31MHf0SV3iJ2Qjg",
  "text": "RECOMMENDED\n\nI had made Capriotti's a habit on my prior trips to Vegas over the course of the last 15 years whenever I felt the urge for a quick casual quality lunch or dinner. I was, therefore, pleased, when Elite Las Vegas Yelper, Christie graciously invited me to meet her and her husband, Marc for a bite at Capriotti's, during my recent Vegas vacation.\n\nI ordered the Cole Turkey(turkey, coleslaw, provolone and Russian dressing on a hero). I bit in and loved the fresh taste of the turkey, the crispness of the cole slaw, the nicely melted cheese, the tasty soft bread and the great flavor imparted by the Russian dressing. I virtually inhaled the sandwich.It was as good, or better, than the Cheese Steak sandwiches I had eaten in the past..........And, more importantly, my experience at Capriotti's on 7/21 was made immensely more memorable because I shared it with new friends.\n\nCapriotti's is another franchise that needs to come to lower New York.",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 4,
  "date": "2016-07-26",
  "useful": 10,
  "cool": 12
}, {
  "funny": 1,
  "user_id": "yfiCKqdrk_i9Pa7ochyWtg",
  "review_id": "iFdWZ0LsQTYA4ZriPRHZwg",
  "text": "We went the Friday before Valentine's Day so we expected them to be busy but the noise level was insane. We could barely hear each other at a 2 person table. However, the food was good and the service was relatively fast for their crowd.",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 3,
  "date": "2016-02-15",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "M8-P2oCFAVz9sD5T_Ydz3g",
  "review_id": "C9AOP-qfutkARTtlfFUbDw",
  "text": "Great lunch place can't beat $1.50 for a polish dog and a drink, pizza is fantastic, never been disappointed with any of the food.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 5,
  "date": "2017-07-15",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "EGyc5AaGghYDirJDBmolug",
  "review_id": "cRnWFTccLqXpM-sQ5UHxgg",
  "text": "Haha. Wow! What a find! \n\nThis little gem is tucked away in the far left back corner of the casino floor. At first, it doesn't look like anything to write home about, and the staff is old school deli, which I can understand to some as a turn off. But don't judge a book by its cover.\n\nFor $8.95, you get a sandwich, made to order on your choice of bread with 1/2 pound boars head deli meat, lettuce, tomato and mayonnaise. Served with homemade potato salad, which was literally the best I've  ever had. Ham, turkey, roast beef are the cold selections. Served on a disposable plate :) plenty of deli and counter seating right there. There are hot choices as well, along with burgers.\n\nWe played some slots right around the deli that seemed really loose. Too bad we were on a schedule!",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 4,
  "date": "2015-07-05",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "y9UlCZbRv-qG0W2pYSD0kg",
  "review_id": "N9okFHMxvl3DAZvc8P54gA",
  "text": "The food smelled soo delicious when I got there. I ordered wonton noodle soup with the egg noodles. I had high hopes.\n\nI was promptly let down. The egg noodles weren't chewy at all. They were overcooked and soggy. The wontons were obviously store bought from 99 ranch or the likes and probably the cheapest kind you can find. There were meager servings for Chinese cabbage in it, and it was overcooked and not crunchy on the inside. And don't get me started on the broth, er i mean the water that they passed as soup. There was no flavor at all. I would have expected a place that has a great\"international buffet\" to have a somewhat decent  \"Cantonese\" food.\n\nPerhaps I'm being too harsh. Perhaps I expect too much. I want my 9 dollars back. Not only it was 9 dollars, but it was served in a crappy ass plastic bowl and the nastiest kind of chopsitcks you can find (which I had to ASK FOR- they gave me a fork!) Did i also mention NO WHITE PEPPER? You aren't a true Cantonese place without it! \n\nThank you Mah Jong for ruining my favorite dish.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 1,
  "date": "2011-08-24",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "cMTyN2F2zm3jAflW12Wiig",
  "review_id": "AWrJz_pLBu4Mb5rm3GdZtg",
  "text": "Well like I wrote before we went to this Friday's the first of the month, (November) and spent over $40 for food we brought home and threw away. It was terrible, I contacted them, it has took over  MONTH to get this resolved, we have been going here for 4-5 years but we will NEVER go back!! For our food we couldn't eat they gave us a $10 food voucher, really? We usually tip that much , this was insulting and we will never go there again. We usually take our out of town friends there when they come into town, because they have always been a nice place to go till now. If we ever go back to Friday's it will not be the one at Samstown I assure you that!! They was very rude about this and very insulting . They just lost 2 loyal customers !!",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 1,
  "date": "2017-12-03",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "s3kRi7b8t2sdtYcsMbqlJA",
  "review_id": "YrSz-C6Ct_gjzGirSS4xgw",
  "text": "We decided to eat dinner here since we enjoy/know the chef/crew from the LA Sea Harbour. I was actually disappointed. The food was okay, not as good as the restaurant in LA.  \n\nThey don't serve dim sum here. Minus 1 star. \n\nWe called ahead to book two pigeon/squab's since this is what they are famous for.  \n\nThe bill was expensive for 3 people but given it was in Vegas and inside Cesar's Palace, the rent is probably just as expensive.\n\nThe decorations are minimal but it does overlook a nice outdoor view of the palace.\n\nThe restaurant is on the second floor. \n\n\nEddie Y. is the Manager and ask for discounts if you will be paying in cash. \n\nPatrons were mostly Caucasians ordering the set menu which is broccoli, fried rice, and do I need to type more?",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 3,
  "date": "2009-12-09",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "yxeg7kzq5VlK8S_yOR2aYA",
  "review_id": "jHY5rYe_gS7brEq2O-KCjQ",
  "text": "Terrible service. \nOrdered online, arrived there ten minutes after scheduled pick up time, waited in line to find out they had not even started my order. I was told to wait five minutes, proceeded to watch every one from the line get their food before me. The estimated 5 minute wait time became thirty minutes no exaggeration. Wasn't even offered as much as a water cup for the wait. \n\nTook an hour to make two subs (which still were made incorrectly).\n\nThe simplicity of making a sandwich in a timely manner should come easy to a franchise corporation. \nI literally downloaded yelp to make this my first review out of dissatisfaction. Thanks for making me and my pregnant wife miss our movie date.",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 1,
  "date": "2016-03-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "Y23eCc3ZxK_VxfH61ptxaA",
  "review_id": "LkWRQgaT-Jn1BZ3k2FZDwA",
  "text": "Went there because it has 4&1/2 stars. Ordered Menudo and Pozole. I was very disappointed with both; broth too watery not enough chile sauce therefore no flavor.",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 2,
  "date": "2015-09-12",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "1JNqTTHm6m-4TcM6rL9vrw",
  "review_id": "q47RdfWrNVjrIKrCc6aBtA",
  "text": "For someone who grew up with Roberto's, this location's food is decent. Meat ratios in the food are especially good. They can be a little stingy with the guacamole but what Roberto's isn't? My only complaint is the service and wait times. I wouldnt recommend you go out of your way for this one but it's nice to have in the neighborhood for those tired nights.",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 3,
  "date": "2016-01-03",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "qRbfiO1KkL7G9_QUYbOMwg",
  "review_id": "SRyyGkN3HN86Eg9JfUEjrA",
  "text": "Friday's has always been one of my favorite restaurants to go with family, but today I had one of the worst experiences ever. As a server I always try to give other servers second chances to correct mistakes they make while out eating. Our servers name was Holly not only did she take 20 minutes to bring us water and 2 beers which she messed up in the size, she was also very rude! When we asked her if she had put our order in for our beer she had the nerve to roll her eyes at us for her mistake! We went for happy hour and we were planning on ordering some more appetizers for our group but she was no where to be found, it's as if she hid for long periods of time waiting for happy hour to end. I try not to judge a server for being slow or even a little forgetful because we all make mistakes including my self, but being rude for your own mistakes is uncalled for. We do appreciate the manager who was working at the time, because he was understanding and he did try fixing the crappy experience she gave us. He was very professional and kind, but unfortunately it wasn't enough to fix the rude attitude she brought to our table. We won't ever be back to this location!",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 1,
  "date": "2017-08-10",
  "useful": 1,
  "cool": 0
}, {
  "funny": 5,
  "user_id": "bLExVDNKxXMjjZcx3YG36Q",
  "review_id": "MY3pM4zF2E6lJSHootHVuA",
  "text": "Boqueria Street brings heat to Las Vegas with their Spanish cuisine.\n\nBoqueria Street are known for Bocata rolls which is a sandwich made with Spanish bread, not sliced, cut lengthwise. In Spain, it's considered humble food and its inexpensive has allowed it become a staple. \nThese guys bring serious eats when it comes to Bocata rolls everything is fresh, authentic and flavorful. \n\nThe Vaca Saltada is out of this world, the braised beef is so tender and juicy and its marinade is full of herbs and spices. Loaded with Manchego Cheese, Red Onion, Spicy Mustard and Chili Mayo. It's the perfect sandwich for this type of season, I should have bought a bunch to take it for a picnic.\n\nIf your looking for small bites the croquetas is a must have, They are deep fried into balls and stuffed with chicken, parmesan cheese and bechamel. After one bite I will never eat mozzarella sticks again, this tastes 1000x better so creamy and cheesy.    \nI hadn't tried everything on the menu, but by looks of it each item has had a lot of thought put into it. \n\nThis food truck is outstanding if you happen to find them, don't hesitate to check them out.",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-05-17",
  "useful": 6,
  "cool": 6
}, {
  "funny": 20,
  "user_id": "oeAhRa8yFa9jtrhaHnOyxQ",
  "review_id": "v4dNHDd9TpmR-13z-i4j_Q",
  "text": "\"A sandwich?  It's 100 degrees outside and 120 in the car.  Go by yourself.  Oh and bring me one\" says my SoCal poker bud.\n\n15 miles later, at the Las Vegas Farmers Market (Rampart and Vegas Drive) sitting on a park bench, now munching on my SoCal poker buds sandwiches. huge Cheshire Cat grin, feeling no guilt; \"You had your chance\".\n\nOne of the BEST food trucks in Vegas.\n\nIt's specializes in a small sampling of Barcelona Street food adapted to American taste.  Not 100% authentic, All good, just enjoy your food outdoors while you people watch.  You'll feel transported.\n\nCredit where credit is due: thanks Stefany V for the recommendation.\n\nBocadillos, traditional Barcelona sandwiches, feature OUTSTANDING fresh bread with flavor, slightly chewy, toasted crisp that manages to hold everything in perfectly.  Amped up mayo and spreads and fresh veg and micro greens that actually make sense (the flavor of the micro greens adds to the enjoyment of the sandwich).  Proteins, very well chosen and blend well with everything.  The Jamon Serrano, sweet porky goodness and cured funk that pairs well with the mushrooms.  The Botifarra; naturally cased, coarse ground seasoned pork; delicious and fatty, intensified by a great chimichurri mojo verde.  Finally the vaca saltada; braised beef with manchego cheese and an earthy chili mayo, just plain good eats.\n\nDo try an order of patas bravas (deep fried thick potato wedges with a spicy aioli).  Fluffy on the inside, gently crisp on the outside, it makes a perfect, rich side to any sandwich.\n\nNote: If you have not tried Iberico ham from black footed, acorn fed pigs, AND it's on offer here, go for it.  It might not be as good as that sold by places on the Strip but at 1/3 the price, unless you're a true gourmand, your tongue won't know the difference.\n\nPrices are in line with the quality.  No foot long subs for $5 here.\n\nIf they only sold wine by the glass and that other famous Barcelona street food, churros.  Ahhhhh.\n\nBe sure to check out their FB, IG, Twitter, and website to see where they are going to pop-up next.\n\nAn amazing food truck, well worth seeking out.",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-06-12",
  "useful": 31,
  "cool": 24
}, {
  "funny": 0,
  "user_id": "1TmIDS1GOIel7DVsRKgr7w",
  "review_id": "5Rak3mphly8Rnhi1t3uD-A",
  "text": "I can't believe I haven't written a review yet!\nThis is our last minute, tired, don't know what else to get, save the day kinda spot. \nWe can always count on a delicious Super Nacho to hit the spot. The staff knows us and know how we like our Super Nachos and NEVER give us any problems with our unusual requests! Kind of bummed they charge for the Horchata refills now but it's all good. It's understandable since people like my family can down like 3-4 cups each in one sitting. I apologize that I don't know them by name but the two ladies (one elder and one pretty young) and the younger man that usually takes our orders are always so nice! Thanks!",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 5,
  "date": "2015-10-16",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "Wbhpbp0O6z7lQFlXVCRwDQ",
  "review_id": "IBdLj_5IuHZiQjUYwoHY_w",
  "text": "Great food. Owner was very nice and spent some time chatting with me about how his Phô was made. The broth was very very good! The meatballs he uses also were excellent compared to most! This restaurant absolutely deserves your business. They are new and definitely have the Phô to compete. Much simpler experience than Phô Kim Long and possibly better. Give them a try!",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 5,
  "date": "2017-11-16",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "6I4fXdYdnw0SmV7wtYdf7g",
  "review_id": "kG2wNEfHJe5Iv-fmQf-4dA",
  "text": "Nice little Thai restaurant with good service.  I ordered the pad sew wee flat noodle dish, it's good, but too sweet though.  The Penang Curry with chicken  is ok, not as what I expected, the sauce was just a little too watery. More room to make it better!! Will be back to see the changes",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 4,
  "date": "2017-10-23",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "o-3GhgBFu-cqD1W3z-78yQ",
  "review_id": "RUn-YFE1HeVV0NEIgydjdA",
  "text": "I gave it two stars for the ambiance and service which were impeccable. The food - Lame. Uninteresting and overpriced. Singapore noodles were dry and the sea bass was full of bones with a bland sauce. We must have been the only people in the restaurant, which seemed like a complete waste since the location was pretty incredible. We didn't have a bad time, but I wouldn't come here again.",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 2,
  "date": "2010-06-21",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "57GJIlI1KVwwVLmjoxAZ5g",
  "review_id": "7zfvhm3OWx--uLj61xXECg",
  "text": "Horrible service. They couldn't even comp something for having me wait 40 minutes for my one meal.",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 2,
  "date": "2017-11-27",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "d8yKZSq4zneeHT2DXpJotQ",
  "review_id": "m-NIMv3aLheoCkJ1EM0EQA",
  "text": "I have been there already 3 times in the row, just because I liked the environment and the bartenders are awesome with the best atention given to their customers.\nTalking about prices I would say they have the best prices for draft beers and taquilla shots were fair priced.\nAnd then the peperoni pizza was great hot and delicious.\nVery recommended you guys should go and try out the place.",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 5,
  "date": "2015-08-22",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "XE4wk6F4Kma9No2lM7y2Ew",
  "review_id": "tqWIx_xYRORizGpz8S6CmA",
  "text": "We were eager to try their rib special, because they had been advertising that their ribs were now the meatiest ever. My ribs were the driest, skimpiest ribs I had ever eaten. There was almost no meat whatsoever on them - how did the cook or server (Matthew) not notice this? My iced tea was empty for twenty minutes and was never refilled. My coleslaw was warm. This was a very terrible birthday dinner.",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 1,
  "date": "2017-11-02",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "B0ENvYKQdNNr1Izd2r-BAA",
  "review_id": "PmdjRRjCuArOrq9B6RzPZA",
  "text": "I told you I would be back and my word is as good as gold. First day in Vegas, we stop by my favorite Chinese restaurant for lunch. I ordered the duck plate and descended to my happy place. The duck was cooked to perfection, it sat atop a bed of white rice & baby bok choy, with some pickled carrots & cucumbers. I had a hard time deciding between the duck or BBQ pork w/egg noodle soup, both are equally delicious. I decided to try something new and it was fantastic. I cannot say enough good things about this place, it is truly a hidden gem at the Rio.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 5,
  "date": "2009-05-12",
  "useful": 0,
  "cool": 0
}, {
  "funny": 17,
  "user_id": "oeAhRa8yFa9jtrhaHnOyxQ",
  "review_id": "amP4sYuYiGutdTUlHSYVvA",
  "text": "Posit, all great sandwiches (that we want to eat) are unhealthy.  Pastrami, corned beef, brisket, pulled pork,  a burger, italian salumi and porchetta.  Veg?  Sigh, if you must but make sure it's grilled and hammered to death or wilting from the meat fat.\n\nKarved makes one heck of a great sandwich.  Porchetta.  Take a lean pork tenderloin.  Roll it inside a pork belly, it's skin on the outside.  Season heavily.  Rotisserie roast until golden brown, cracklin on the outside,  juicy, and fatty in all the right ways on the inside.  Slice that bad boy up.  Shove it in a fresh baked, chewy, crispy baguette, wilt up some greens, add a generous slathering of herbaceous, lemony, garlicky gremolata.  Heaven.  The crispy pork cracklin adds great texture while the sweetness of the pork is brought out by the bright gremolata.  An outstanding sandwich.  A solid value at $12.\n\nAlso available, a rotisserie chicken and tri-tip.  Ordered as a plate, the chicken is as good as any.  The tri-tip, well seasoned, cooked medium, tender, juicy, it's flavor brought to life by the spice heat of an aji verde (Peruvian green chili sauce).  OK roasted Brussels sprouts that could use more char for complexity.  All good, this place is all about the porchetta.\n\nFriendly local service.\n\nWhile I wouldn't say it's so epic and iconic, ie drive from Centennial great, if you're in the area, a very worthy treat.",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 4,
  "date": "2017-12-06",
  "useful": 30,
  "cool": 24
}, {
  "funny": 0,
  "user_id": "db-bHzFMtEuDtXypLBsbOw",
  "review_id": "NC00vYMWctZr4ORG_gwUrw",
  "text": "The server's are OK but mgmt didn't respond to our complaint about the lobster chunks having a very bad taste !!!\nLater that night I threw up twice and have the runs !!!   I would not go there again !",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 3,
  "date": "2016-08-21",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "c22DWKlOM-fzHggyG_NxFQ",
  "review_id": "ijDipxfU9XvH-rdr0J_k6w",
  "text": "It's open 24 hours and serves ok mexican food. Not anything to write home about, but hits the spot when you are cruising late night for a meal. I find that there food is on the greasier side,  and usually my stomach can't handle that. They do have some specials during the week, that make cheap meals for the family. Prefer RIvas Mexican Grill which is around the corner.",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 3,
  "date": "2012-06-10",
  "useful": 2,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "Qi2Sp3o4_xU9TEiGff7Eqw",
  "review_id": "Z2S3u1XYHXDB2R3r28jiQw",
  "text": "Finally an awesome porchetta spot in Vegas! \nMy family and I went in for some lunch today. I ordered the porchetta and my fiancé ordered the southwest chicken. Both were so amazing and the portions were huge! The meat was very tender and not dry at all.  The owner brought out some of there in-house made sauces (which i recommend you try!) and those made the sandwiches even tastier!  We had a side order of fries and it came with fry sauce!!(I'm from Salt Lake City, Utah and haven't had fry sauce since i moved to Vegas). At the end of our meal we were offered a sample of their yogurt dessert which was also . I wish I took some\nPhotos of all the food but I was too excited to try it that I forgot. \nCheck them out! Make sure you get the porchetta and their garlic sauce. Bomb!!",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-12-11",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "YzIOj3ctc0JpFaG0noHebg",
  "review_id": "rpRonUYWk0ypueMIZPCtuQ",
  "text": "Tried to call on three different days to order delivery. Called twice each time and got hung up on. \n\nVery sad since we used to love the other Thai place that was there. Not at all pleased with this change in ownership. Very disappointed",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 1,
  "date": "2017-10-27",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "9CHYh9vv3YFohsU70fT6iA",
  "review_id": "DYBKehX754iqhIhMss7VsA",
  "text": "Had the shrimp spring roll and bun bo hue.\nThe spring roll just tastes like anywhere else but the rice wrap was partially dry and not able to be chewed.\nBun bo hue was very lack of flavor, you just can't dissolve smg into water and pretend it's bone stock broth. Beef and pork blood were not fresh enough.\nIt's like you can taste the hatred in the food from the chef towards the owner.\n2 stars only for the service, my water was refilled twice before empty. maybe because I was the only one there at dinner time?",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 2,
  "date": "2017-08-01",
  "useful": 2,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "vbG9-F7u-WUbY9lfvadIJw",
  "review_id": "685CS2mTv4aCAOVVC_VpVQ",
  "text": "My Mom and I attempted to eat at the Italian restaurant that's in the same building today, but it was reserved for a wedding. No biggie, we figured we'd try the bar. We stood and waited for several minutes before the bartender acknowledged our presence. My Mom asked if they were open for lunch and she said \"Yeah but there are no minors allowed here\" in reference to me. Highly unprofessional, in my opinion. I may not look my age but I can certainly pass for 21. I was offended and we left. If you're unsure of somebody's age, ask to see their ID. Don't indicate that you think they're a child.",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 1,
  "date": "2017-02-19",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "lH88RlfNZP4V9S-I0FCbhQ",
  "review_id": "Vu_sUJ2DRtl_0jtT5YB4cQ",
  "text": "For those Las Vegans who may remember the great food from North Beach Cafe, well Ozzie is back, running the restaurant of the same name inside Bogey's Bar. We've been twice now, and all our favorites on on the menu: we have tried caprese, house salad, chicken Marsala, fish of the day (Basa), salmon, and a fettuccini pizza, all were really good. Wine was very reasonably priced, and the cool bar seating is still there. \n\nThe gaming bar is on the other side, so the dining area was nice and quiet and relaxed, good for conversation with family. Great neighborhood gem.",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 4,
  "date": "2014-06-09",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "gF33lwN0Vvgi-5c9E-wyfg",
  "review_id": "fJ5EH1JUq6vToLx6v0QjtQ",
  "text": "If you are craving Chinese food, Mah Jong will not disappoint, especially if you are staying at the Rio.  All the BBQ rice plates are good and even the Sweet and Sour Pork w/Rice.  Prices are a couple dollars more than Chinatown but the chef's are very good.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 4,
  "date": "2012-06-23",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "IcJxvIDNFqwi6_4qHxVy6w",
  "review_id": "ApOEVOAKUB7ZVZJFCZej-A",
  "text": "For me the location is not the best but the food is euthenic and good. It is also inexpensive. I love their ceviche.",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 4,
  "date": "2014-07-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "E0pfxJoX1qNgr29uXwm5BQ",
  "review_id": "opOvHN3KrG4zYpwUq3Cfig",
  "text": "A great little hole in the wall with excellent food! I had one of the combination plates - a taco and an enchilada. It was excellent! T came with refried beans and rice, both of which were on the same level as any I've had down in Mexico itself. I ordered the taco to be chicken, which was very tender and tasty. The enchilada was cheese, my favorite, and was just as good as any I've had south of the border. The chips were thin and crispy, just like I like them and the salsa had an excellent bite to it. Overall, the best Mexican food I've had since coming back from Baja last October. If you like good, real Mexican, you won't be disappointed. Don't let the \"dive-y\" look deter you from pushing the door open and going in. You won't be disappointed either! \n\nOh yeah, they have real Mexican Coca-Cola in a bottle, too. If you've never had one, you'll be surprised at how different they taste from our Coke in the U.S. Try it!",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2015-07-14",
  "useful": 0,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "d3AnAzDitFmZ-N-NlyEM5A",
  "review_id": "WAtlobjagAiKsZzhjWyAxg",
  "text": "The worst food ever.  Poor quality chicken, terrible sauce.  Could not eat anything except block of rice.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 1,
  "date": "2017-11-30",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "mHNoESRzckpS09Kx18oB9Q",
  "review_id": "Ii2sjlngWhTfJ0gzRhET7A",
  "text": "They don't have that much selections. Most thai restaurants has beef/chicken satay meals, and chicken bbq meal esp on lunch menu. Their soup is plain as well. Just meat and few mushrooms. There's better thai restaurants close by. And im not impressed with customer service either",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 1,
  "date": "2017-11-21",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "4dTE6xw3ZAbX2xNT4IKeQQ",
  "review_id": "B-BxQvzKSss9CPux4z5Zrw",
  "text": "Only reason i came here was because I was staying at Cesars and the meal was comped. It was nearly empty when we went for dinner....goes to show you it is not a very popular spot. The service was good but the prices if i had to pay were VERY overpriced and SMALL portions!! Honestly, i could have gotten more food and better prices at Pf Changs. Sorry would never come back here again.",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 2,
  "date": "2011-05-20",
  "useful": 0,
  "cool": 0
}, {
  "funny": 8,
  "user_id": "PSI7wvuqEhhV9Jh_fP2eZQ",
  "review_id": "TwK2YlbfBxu1efa29P64wA",
  "text": "Chef Oscar Amador brings a taste of Barcelona to the streets of Las Vegas. I love Spanish cuisine and this new off-Strip option is awesome. The Boqueria Street food truck can be followed on social media and found at local venues including bars, farmers markets, or downtown outside the Children's Museum and RJC. You can even hire them to cater private parties.\n\nThe short menu comprises bocatas, patatas bravas, and croquetas. A bocata (or bocadillo) is a Spanish sandwich and Chef Oscar presents his version beautifully on a soft roll crisped up with butter on the griddle. I asked about a vegetarian option and he served up a bocata with mushrooms, zucchini, red onion, bell peppers, bok choy, and delicious romesco sauce. I was dining al fresco at Bruce Trent Park, but it could have easily been Jaleo. Chef has a Jose Andres accent.\n\nI will be tracking down Boqueria Street very soon for an order of patatas bravas!",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-02-19",
  "useful": 17,
  "cool": 12
}, {
  "funny": 1,
  "user_id": "JhVMhYNceJUt369RODruDg",
  "review_id": "6BI7biof7_SutXdMcufffw",
  "text": "I guess Church's Chicken is a brand name so you've either made up your mind about that brand, or have yet to try that brand, but for the most part you're going there for the brand name and not a unique experience. On the other hand though, this is an odd one. This used to be Philly Cheese Steak restaurant and it was one of those walk up or drive thru only type of deals that had no dining room. That store went down probably because of it's service. I remember that restaurant had a best Philly Cheese Steak of Las Vegas rating from the Las Vegas Review Journal for like 2 years in a row back in like 2001, 2002 or something like that. Then I remember ordering a a sandwich and waiting 45 freakin' minutes for a freakin turkey cheese steak sandwich and some fries. 45 freakin' minutes in somewhat cold weather because it was just turning into fall and I left the house without a jacket not thinking that it would be so cold, or that I would have to wait 45 freakin' minutes for one sandwich when I was the ONLY ONE standing in front of that place. I actually remember that when I was waiting for my order, a car that was ordering something through the drive thru cursed out one of the employees because he was waiting and it was his lunch break and he was pissed. Needless to say, that place got shut down a few months after. The had a decent sandwich but not worth 45 minutes of waiting... OUTSIDE!    IN LAS VEGAS!!!!! The conditions are never good outside here. It's either too hot, too cold, or windy as hell....It stayed shut down for about 3 years. \n \n   I believe it was somewhere around this time last year when Church's Chicken took over. I don't remember ever going to a Church's Chicken so I figured I'd give it a try. Initially I wanted to dine in but I soon realized that they didn't have a dining room. Either way, I wanted to try it and I walked up to the window. This was around 6-7pm, right in the middle of the night time rush and the window is facing one of the busiest streets in Vegas, Nellis Blvd....PLUS it was windy outside so I basically had to yell my order at the guy three times before he was able to hear what I said and he had to repeat it to me just a many times till he got the #whatever with the beans and extra corn, or whatever I ordered right. \n\n   As bad as that was, there was already two people that ordered before me. I guess the first person ordered a large order and had to wait a bit for her order. I think she ordered a bucket of something or an office trash can or whatever they put 20 pieces of chicken in. Anyway, both the person after her and eventually my orders came before hers and every time the window would open, that lady would walk up to the window and say \"that's not my order\". Well she was right but they never called her order for pick up in the first place. She did that again with my order and asked where the chicken was ( I ordered some chicken finger meal that all fit in one bag) and once again the guy had to say that it wasn't her order. Again. \n\n   I already was not liking this place, but I got my order and took it home. I ordered a meal that had the chicken strips, fries, a biscuit and a piece of corn..... The corn was good.... The chicken strips were really dry and all I remember was that NEEDED to eat it with the BBQ sauce and as soon as I ran out I stopped eating the chicken. The fries were garbage. They were this mix of being soggy and hard at the same time. It's as if they fried them and let them sit in the fryer but turned the heat off and just let them sit there. I barely even ate those fries. The biscuit was good though. They have those biscuits with the honey-butter baked into them. I wish I had some extra honey to spread on it instead of butter. The corn was...well it was corn. If they screwed that up then I would have left my house with that corn in my hand, go back to the store and break that window with it but luckily for them it was good. After all, all they had to do was throw it in some boiling water for a while. \n\n   Overall, I just did not like the place. I know that I didn't get the signature chicken wings that you're supposed to go there for but I still got something they were offering on their menu so either do it good or don't do it at all. There's a KFC, Wing Stop, and a Popeye's all within a block away from this place and any one of those are a better option for your fried chicken needs.",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 1,
  "date": "2010-04-09",
  "useful": 4,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "AcIX4txJPbLpa4ElQIbBMA",
  "review_id": "mivcqWGT9x4yAo93ZHsOig",
  "text": "This place is awesome. The complementary food is very delicious. I really like their parmesian wings. The staff is also very friendly.",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 5,
  "date": "2012-07-25",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "IgFS6DZRcePxecF17YA3Qg",
  "review_id": "cf0bQS9R_Vdyj8vFJtAfqA",
  "text": "Capriotti's is excellent in general.  This location (in the Santa Fe Station Casino) is even better than most.  That's surprising considering that the casino smoke wafts right into their eating area.  But, the food is excellent, there's more seating in a less cramped environment, and we can buy refillable glasses of soda pop (our stand-alone Capriotti's only has bottles).",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 5,
  "date": "2013-12-01",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "WBmDeZG_dGUwhG1DtotLcw",
  "review_id": "0bFk6ZUwDcSnSslWRVSokQ",
  "text": "At Skinny Fats you must answer a difficult question of willpower and choose whether to be Good or Bad. They have a healthy side of the menu with dishes less than 600 calories right across from a happy side with 600+ calorie indulgences. \n\nWalking up this skinny fats has a corner suite next to an open air shopping walkway in Downtown Summerlin. This location is different than the other two in that there is very little parking right outside but in my opinion this is the nicest. Like the southwest restaurant this one had a retractable glass wall that allows for open air dining. \n\nThey have many vegan, vegetarian, GF options that are clearly marked on the menu, making it super easy for people like me. Also you can sub grilled or fried tofu for almost all of the meats on the menu for additional vegetarian and vegan choices. \n\nI ordered the \"Stuff on Curry\" which was pad Thai noodles with a curry sauce and fried chickpeas. My husband got the \"Hot Chix\" which is a salad with blue cheese deep fried jalapeños and ranch dressing and avocado with buffalo chicken. They were delicious, packed with flavor, and we will be back for more. \n\nJust FYI no dogs, only service animals on the patio.",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 5,
  "date": "2017-11-27",
  "useful": 3,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "WjvFSpJuhPKrpmxRzxV1QQ",
  "review_id": "ZvySYb5f1Xm0UXV_SpBUNg",
  "text": "Love this place great food, prices and Best customer service. We go often and is our favorite in 89108. Yayy keep up the great work.",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 5,
  "date": "2013-09-20",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "Fs86jVUsCc1JHIlHs1mUmA",
  "review_id": "x463Ci-K2a7YdVWWpf9ImA",
  "text": "I've been visiting this Deli on occasion for over 20 years. I can remember the good old days when the Horseshoe passed out free cigarettes and the pit boss was always good for a comp at the deli. It's the only remnant of the original Horseshoe left. It's nothing fancy, but they still make a good pastrami sandwich (albeit lighter), sliced to order. Unfortunately, they no longer sell Dr. Brown's soda.\n\nPony up to the counter and enjoy a taste of old school Vegas!",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 4,
  "date": "2011-07-19",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "niaemMbZsESYcefRunLwsg",
  "review_id": "jlYYroFXI3dg-N-cA7kvhA",
  "text": "For a place at a decent casino ran by Chinese people, you would think it would be pretty delicious.  It was actually pretty plain.\n\nHad a chance to taste shrimp pad thai (I know, pad thai at a Chinese place?), chow fun, and sweet and sour pork.  I've had things taste better at a Panda Inn.  \n\nTheir versions of Pad Thai and Chow Fun were not good examples of how to cook noodles.  Both were on the chewy side.\n\nI usually like any kind of sweet and sour pork, but they were on the salty gooey side.  I don't know why I went back to try other items at this place, I should have known by the way they cook noodles.  I won't be back.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 3,
  "date": "2011-04-20",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "NN-2TIRnkFp-UqynhQTOsw",
  "review_id": "x1S3grS1I9opLUu4U8H9yg",
  "text": "2 stars for the slow service. I understand when a server is really busy it can get hard; but at least check on your table after the food has arrived & not come back when everything is practically done. I only gave 2 stars, because the manager was super nice & comped our delayed appetizer.",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 2,
  "date": "2017-09-23",
  "useful": 0,
  "cool": 0
}, {
  "funny": 2,
  "user_id": "3nDUQBjKyVor5wV0reJChg",
  "review_id": "YVI1nJst4_fmMdTSX2kAZA",
  "text": "Tucked away in the Santa Fe Station food court, Capriotti's seemed like the best choice of all the food options there. I usually go back and forth between the Bobbie and the Capistrami, and this time, I wanted a hot sandwich so I got a Capistrami before going to the movies. The combination and contrast of the hot pastrami combined with the cold slaw and russian dressing makes this an addicting sandwich that you take one bite after another until there is no more!\n\nI ended up sneaking the other half of my sandwich in because we weren't keeping track of time and didn't wanna end up with junk seats, That was a great sandwich, and I prefer that any day over a bucket of outrageously priced popcorn with that fake butter...ALOHA!!!\n\nYELP 365 CHALLENGE-(150/365) \"The Smuggled Sandwich\"",
  "business_id": "5TY-YMiAXgBjmP_y4AiXhg",
  "stars": 4,
  "date": "2012-01-13",
  "useful": 4,
  "cool": 4
}, {
  "funny": 0,
  "user_id": "xW1IAF3V1GTxL4mFzDar9A",
  "review_id": "04ZqUCwlkv0h7X0tscruvw",
  "text": "I have been here countless times the food is good but hate eating there because it's so hot. Sometimes the food can be dry. The customer service can be good  bad. The lady in the mornings and afternoons is so sweet and nice. The young girl at night can be rude and sometimes  rolls her eyes when taking order it gets annoying.",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 2,
  "date": "2015-08-10",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "DRZ893TckrqcXfd6-vNAlA",
  "review_id": "kl6OQHUJ7nNfYSBATWxQyA",
  "text": "Ice cream on a stick, dipped in chocolate and then sprinkled with lots of almonds, love it!!! Big enough to share.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 5,
  "date": "2013-08-11",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "FW8-evi0IHiDnY70sB1KcA",
  "review_id": "G4f7eEZLpmkNWsKgy9W-Gw",
  "text": "My son begged me for chicken from here, the rudest workers ever! She asked what I wanted told her no lie 7 times and she said Hold Up, what do you want?? I swear on everything. No customer service.",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 1,
  "date": "2016-02-03",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "eLZGpvBJBTCN0lMyvBGDxw",
  "review_id": "JOTJikJdgFS34eAIgjq5WA",
  "text": "2 girls work together and watch your video poker machine and your every move. All conversations seem to be monitored. Cameras are everywhere and there is absolutely no privacy. Food was terrible. Video poker machines are some of the worst I have ever played. DO NOT GO AND WASTE YOUR $$$$$!! THERE ARE MUCH BETTER PLACES IN LAS VEGAS.  THIS PLACE IS ONLY INTERESTED IN TAKING YOUR MONEY!! WILL NEVER VISIT ANY 5 STAR TAVERNS AGAIN!!",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 1,
  "date": "2015-07-20",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ITe1NLLh5pfS9tsNwfMdlw",
  "review_id": "e9EJl6dCuQVYL4kQ8c_xww",
  "text": "This place has excellent sandwiches. Not sure what the negative reviews are about.  Could barely finish my combo (brisket/corned beef) will get a 1/2 next time. Love the salty pickles and green tomatoes that come with it. I haven't been to the original location in LA but have been to Katz Deli in NY a couple times and Canters is definitely right up there. Good job, and the restraunt looks great. This is for the Linq location, haven't been to the Summerlin one yet.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 5,
  "date": "2017-11-05",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "JvjF7VFqyhXuWG3umtXFbQ",
  "review_id": "lU51d1t_QXVFlZ8Pl8PTlw",
  "text": "Had a tasty chili relleno burrito and da Hunny had chix tacos. For some reason he received a coke on Tap, no in a bottle like everyone else (what's up with that??). This is a cash only establishment, so if you are hungry, stop off at the ATM first",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 4,
  "date": "2017-02-11",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "KEerqlFNhzl1I-yVK6mHVA",
  "review_id": "0-Cn16UdoQnuQtKYETOrLA",
  "text": "So I'm here again and they still don't have any spicy chicken. Why ask me what I want if you don't ever have it? The most ridiculous thing ever and people are getting off work such horrible drive. I will never waste my time here again!  This was a last minute thing for me and wanted some spicy chicken.",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 1,
  "date": "2017-01-05",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "jH_lJxeeU5vVYX7ffzR5Vw",
  "review_id": "hSAJ04vosirOuCb1ZY__Ww",
  "text": "Went in here for some shrimp cocktails and maybe something else. Read some reviews about this place here and they made this place sound amazing. We order the shrimp cocktails with octopus and some micheladas but they were both just ok. The michelada itself didn't have much flavor and neither did the cocktail. I've had way better sea food. Great thing about this place is the customer service.",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 2,
  "date": "2016-02-28",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "FijYdo0onHnwrArwoqKpSQ",
  "review_id": "pcHaY3k6PciMHnbF5vOQSw",
  "text": "The food is awesome and it's very clean and modern inside. Great lunch specials. They have a huge menu and offer dishes that other",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 5,
  "date": "2017-05-19",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "2mof3UPy9zNJK0cN5t4_NA",
  "review_id": "-41WVm2xn_OPrY2-btc2MA",
  "text": "Tried them for the first time at the last foodie fest and loved it! The service was great. The jamon iberico was so good and the potatoes had this yummy sauce on them. If I came across this food truck again I would definitely eat here",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-05-11",
  "useful": 0,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "Mho2GibREwsPesKEyQbt8w",
  "review_id": "G_d2Sg42TNDivEQO_qtufA",
  "text": "Karved, now open for about a month, is a very welcomed addition to the strip mall that Vegas-favorite sushi spot Sakana also calls home to.   In an already tight parking lot, there will soon be less parking once the majority of Vegas learns about this delicious joint.\n\nQuite possibly the star of the menu is their Porchetta sandwich.  One of the staff (possibly the owner?) walked me through the steps it took to create this flavorful masterpiece.  Totaling a three to four hour process, pork tenderloin is first rolled inside pork belly, then cooked rotisserie-style, and sliced up into juicy, tender pieces.  These are tossed into a fresh, chewy baguette slathered with a lemon caper gremolata spread and some greens.   If that isn't enough, pork cracklins are tossed over the sandwich to add a nice crunch to the mix.  It's just a burst full of flavor and truly makes this one of the best sandwiches I've ever had in my life.\n\nMy wife and I also enjoyed the combo Peruvian Chicken and Beef tri-tip combo platter with potatoes, rice, and brussel sprouts on the side.  Three sauces were all sampled and three sauces were well-liked.   Hot, aji verde, and garlic all accentuated the flavors of the meat.   The portions were generous enough to eat for lunch and have saved some left over for dinner.\n\nThe staff members were attentive, friendly, and thankful.  Likewise, I am thankful for this small establishment for bringing another fantastic food option here in Las Vegas.",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-12-09",
  "useful": 3,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "XRSdeFZosqxyykWA1Ii3HA",
  "review_id": "1W4VMbJ_mEQCx6I8zLKV4g",
  "text": "I'm always at Fridays... It's cheap and simple. No matter what state I'm in I am a regular. This one is inside SAM'S TOWN CASINO. Other than the cigarette smoke lingering around it was ok. Service was great. We sat at a booth far away from the casino floor, which was great. Ordered a strawberry lemonade as I always do along with a dish I've never tried before: Fettuccine Alfredo pasta with shrimp. A large Caesar salad and new england clam chowder. The chowder was sort of thin and could have been better, but it is what it is for $4 bucks. The salad was good along with the main course. The shrimp was nice and tender. The pasta was soft and the alfred sauce tasted great, especially with some pepper. Will always return to TGI Fridays just never know what location! :-)",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 4,
  "date": "2017-02-12",
  "useful": 0,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "VT6LczemjmMUDwTd5cgxnQ",
  "review_id": "ov04NhKhXa2CS_9KEmfF9Q",
  "text": "WAY overpriced.\n\nit's definitely a great place to enjoy exotic and unique taste. I've been to few high class restaurants, but It's customer service was among the best imo.\n\nThe restaurant itself is separated from other stores by an elevator, so it felt kinda special and more luxury. The surround environment was not too chinese, but slightly oriental and elegant.\n\nBUT, the food was awful. I was like 'um this is exotic' but that was it. totally not worth the money.",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 2,
  "date": "2010-03-15",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "KtsA89oWfXWKyNtmH4sh7g",
  "review_id": "Ozoetpq_KV0RvtvmTbjE3Q",
  "text": "I had dinner with about 14 friends at Bogey's Bar and Grill in North Las Vegas, NV on Saturday, 3-25-17.  The place has a very welcoming atmosphere.  The service is very good.  The food was really good.  (I was unable to order a full meal as I was still quite full from lunch; however, I had a really yummy half-salad and a grilled Italian sausage, and they were delicious.)  Fresh, ciabatta type bread with olive oil, balsamic vinegar and/or lots of butter was served throughout the meal.  I had a taste of the meals of the people on either side of me--eggplant parm (which was the best I've ever had) and a seafood angel hair pasta dish (excellent).  Although the grilled Italian sausage is not on the menu (it's ordinarily served in sauce) they grilled it for me and served it to me that way--exactly as I requested--which is good service in my book.  It was a side order and served w/sauce on the side--very nice.  The tiramisu dessert was much better than average and beautifully presented.",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 4,
  "date": "2017-03-28",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "tDuxuhwIn4o21xOiuzc76g",
  "review_id": "14P67XKcdvyly5RfEahKqQ",
  "text": "Admittedly, I am a hot dog fiend. So every couple of weeks I need to stop into Costco just to have a \"Polish and soda\" fix. This Costco is convenient to my home, and the people behind the food counter are friendly, courteous, and helpful. Been doing the hot dog thing for years; the Food Court team at the Decatur Costco does a great job of waiting on customers, preparing the food (always hot, fresh, and ready), and even on busy days you are always greeted with a smile. Thank you!",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 5,
  "date": "2015-05-21",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "yEmeRQb4WH6NN0IAaTX_lw",
  "review_id": "sEKb_JoihNBLnoukQ4NOFw",
  "text": "Found this place on yelp it popped up as hot and new so decided to give it a try ..... \n\nIt's in the target parking lot in Maryland and flamingo beside tiabi which I have been there as well \n\nKind of a small place not many choices places to sit but it was empty and I was taking it to go as well \n\nThe workers were super friendly and nice  I got the Karved chicken pita with a side of Brussels sprouts .... \n\nMmmm yummy the chicken pita was so good has a nice flavor and the chicken was juicy not dry every bite was amaZing and full of flavor... the Brussels sprouts were just as yummy not hard not to soft just perfect with effect  seasoning \n\nMy good came fast and I paid about 12$ for my\nMeal \n\nI will come back to check out the rest of the menu \nCheck this place out I'm sure it won't disappoint",
  "business_id": "cePE3rCuUOVSCCAHSjWxoQ",
  "stars": 5,
  "date": "2017-11-07",
  "useful": 4,
  "cool": 2
}, {
  "funny": 1,
  "user_id": "raFyVr7n3DtJ0oRG3H244A",
  "review_id": "7gMXEJr8-dyct66fXK_2Rg",
  "text": "I don't ever give one star reviews but this one was a bit bothersome.\n\nWe ordered a pastrami sandwich, a hot dog & a soda, but were told that we have to wait for the hot dog buns (which were on its way). Not being in a rush, we said we'd wait & got our pastrami sandwich & drink. After waiting about 15 minutes I decide to check with the person we ordered from if the hot dogs were ready. I was then told that they don't have hot dogs. Confused, I reiterated what I was told earlier about waiting for the buns but was ignored & told that they don't have either. Another worker had showed up & entered our conversation asking, \"do you REALLY want a hot dog?\", which to me says, \"we're closing soon & we don't really want to correct what we did wrong, but I'll offer it up with a bit of sarcasm anyway\".  That also pissed me off just a bit. So, I ended up eating the other half of the pastrami sandwich (which was ok, not the best pastrami ever, by any means). Had I been originally told that they were out I would have just ordered something else & not have anything to grumble about. Buuuuuut, this was not the case which caused me some major irritation.\n\nSo, food is ok, service is terrible. I'd much rather go to the cafe in the Cal. At least when they're out of something they let you know instead of making you wait for nothing.",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 1,
  "date": "2013-11-15",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "2fB08127B2vJHjtgarNnSQ",
  "review_id": "fxVLlydAAppWdlB0j2aUiQ",
  "text": "Been waiting ages for them to open this location in my neighborhood. As expected, the food was glorious. The staff went above and beyond rolling out the red carpet and there were none of the kinks you'd usually expect with a new restaurant. If you've never been to skinnyFATS before, the easiest way to explain its virtues is that the menu is amazing. Many many really great dishes and great flavor combinations. You can thank me later.",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 5,
  "date": "2017-11-26",
  "useful": 2,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "2B5r4nspOc_cLbg_l2n5tg",
  "review_id": "RX9nHpC41-qMtRNqSPmZDw",
  "text": "This place is really good and cheap. The burritos are amazing. I believe they accept cash only but the food is well worth it.",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 4,
  "date": "2014-11-04",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "AYwrVSJ6QD_GOXoMp5n8xw",
  "review_id": "yxZG4kRjFdO3uUYcZS1kJw",
  "text": "This Vietnamese restaurant  just opened few months ago.  It's now one of my favorite place to go whenever I crave for Vietnamese soup.  Place is clean and service is fast! Come check it out!l",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 5,
  "date": "2017-11-10",
  "useful": 0,
  "cool": 0
}, {
  "funny": 3,
  "user_id": "UQm8Cib9mvQpxHE07sAhFA",
  "review_id": "WOrNKRx2oGHEKmLw42GZkQ",
  "text": "We went to Onyx, the \"fine dining\" part of the building for a beer pairing dinner.\n\nDecent looking room, all though it was lit wrong.\n\nThe service was friendly but the food was simply awful.  I understand that it can be hard to put out a dinner for 50 people, but this crossed the line.   We waited an hour between the third and fourth courses and then didn't want to eat our lamb.\n\nOur other courses consisted of a \"short rib\" that was basically beef jerky, a steak salad that was swimming in dressing while managing to have most of the lettuce dry, and a store bought brownie in watery vanilla sauce.\n\nThe highlight of our night was when a waiter came over and took our picture and told me that I looked like I wanted to punch someone.   My response: \"He's probably wearing a chef's jacket\"",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 2,
  "date": "2010-01-29",
  "useful": 5,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "VMCYQFBhNCaJX44LK1jHUg",
  "review_id": "9LXcG9-9rZziNC09M6eTJA",
  "text": "Mar Y Tierra is a mom and pop Mexican restaurant that is worth the stop. My husband gets their carne asada and it is the best. I have ordered every type of shrimp and enjoyed every plate. The prices are reasonable and the service is good. Their salsa and chips are really good and the service is consistently good.",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2017-05-08",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "LiZKjTk65L5c1cB403mb3g",
  "review_id": "SYP4YAN2PjcP9LID_RFSTQ",
  "text": "Best deal in town $1.50 foot long hot dog and a large soda and it's good!  Very fast service",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 5,
  "date": "2017-05-12",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "pFROGfAQppS4DjESN5q16A",
  "review_id": "3nhnvntK5q3cQwveQzDwdQ",
  "text": "I live right around the corner from this place, walking distance and I will not go here. I have given this place three chances and have been let down every single time. \n\nThe bar tender is an asshole. Was all worried about how much we where playing and wouldn't comp our shots because we did play enough. Between the two of us we played $40 and we where only there for an hour. \n\nIf your over 60 this might be a decent place for you. If you are under 60 STAY AWAY!\n\nThe restaurant rock tho...",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 1,
  "date": "2016-03-11",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "El4ASqeULxEUgPYfzJbbBQ",
  "review_id": "5essejBuM92o9gXI4oPc6Q",
  "text": "DO NOT eat here but more importantly DO NOT drink here! Omgosh the service is awful. My boyfriend and I attended a wine and canvas event here and that was fun but the bartendar in the room was terrible. I think her name was christy or crissy. She would loudly throw around glass containers and they made a loud crashing clinking sound that startled everyone. She didn't care. We asked her for some whiskey and she said, \"well that bottle has been up there for years and I'm not going up there to get it\". It was displayed on a shelf, God forbid she have to do her job! When we approached her about ordering food she looked at us like we were bothering her. Not friendly or customer-service oriented at all! When she handed the food the people she just put the plates in their face and didn't even look at them, there was no eye contact, it was like \"here take your food\". I would never go there again. We also heard her complaining about some nachos. I guess someone ordered nachos but they were in the restroom and she kept yelling \"nachos, whoever ordered nachos, your food is ready!\" She just left them on the counter and said, \"well she paid for them already so ...\" I feel that customer service is really important, there are plenty of other places people can go where they'll get better service. I do not recommend this place.",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 1,
  "date": "2013-10-10",
  "useful": 3,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "nX-CGuODX2kB48SFeqPE2g",
  "review_id": "sq46GRHiZby5irvO1zAyOw",
  "text": "Three visits over the weekend; two breakfast and one late dinner.  $3.99 breakfast hard to beat, as is their marinara.",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 4,
  "date": "2017-05-25",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "7EJmJrUrPWfSgUKhl8tCDA",
  "review_id": "dRnr7aNcnRtO3j3ysD6Ygg",
  "text": "I don't get the bad reviews...great bar food!! Bartenders are friendly and was warmly greeted when I walked in!! They all make me feel welcomed!!",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 4,
  "date": "2015-10-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "zB1GFKkXqn-vgoIgkjhPYg",
  "review_id": "NAeKroXoZn3pRU8lDzUxAQ",
  "text": "I usually stop here from time to time, hoping that the food has gotten better.. but it still hasn't.  Roberto's used to be my go to late night eats b/c it's right down the street from my house and the price wasn't too bad for a huevos rancheros plate.  But, the quality has dipped a bit a couple of months ago but, somehow, I keep coming back hoping that maybe they would magically improve like in the beginning.  But, it's the same everytime.  The only thing I like about this Roberto's is that they usually get my order right and the workers are nice, but it still pushing me over to Rivas for some better eat and the refillable fountain drink machine.",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 2,
  "date": "2011-11-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "X5juacNGTfKsKUKaf5BOWQ",
  "review_id": "k57ohBn_HnMElKU_A9PNWA",
  "text": "I ordered Spicy and when I got home it was plain. How hard can it be to get an order right?",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 3,
  "date": "2016-08-18",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "dwHaW-eG9QEaXghclhGV4Q",
  "review_id": "5LC7NmaniBp6S94uv9biEA",
  "text": "This is the worse Friday's there is out there. Every time we come here the cooks mess something up. Went here last night at that was my final straw. There's was only 7-8 tables occupied as it was still early. We went for the steak and lobster. The server was nice but it's always the cooks that don't give a crap. Ordered a steak with no seasoning and on the flat grill. 45 minutes go by and still no food. How long does it take to cook 3 meals when the place is dead?! They finally bring out out and guess what, there's seasoning on it. Due to having a sensitive stomach seasoning is out of the question. Sent it back are the rest of the meal and another 20 minutes go by and they finally being another steak. Guess what they did, rinsed it off and threw it back on the grill. It was obvious as underneath there was still some seasoning underneath. The steak was now burned not the medium well that was ordered it was well done and burned. When the manager was questioned why there was still seasoning he lied and said there wasn't even thought it was in the juice on the plate and in the napkin that I dabbed it with. \n\nAlso another order was the jack Daniels ribs and shrimp. On the menu it said a full rack of ribs. They brought out a 1/2 rack. I questioned the server and he said they only do 1/2. We were too annoyed at the steak situation but I should have asked for a menu because they charged me for something that I didn't get. See menu photo from their website. What a joke and in the end a waste of more than an hour and a half. Also never bothered to enter my stripes number so I got no credit. Will never return to this place and I live close by. I'll drive to outback or Millers where they know how to cook right and provide better service!",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 1,
  "date": "2016-11-01",
  "useful": 0,
  "cool": 0
}, {
  "funny": 5,
  "user_id": "0FMte0z-repSVWSJ_BaQTg",
  "review_id": "hOfa5yKVSvKe_cl9hGzXiA",
  "text": "COSTCO FOOD COURT IS THE BOMB!\n\nEvery time I shop here at Costco, more often then not, I end up eating at the food court. So of course I always end up looking to check in and nada, zip, zilch, nothing! So now for all of you that are reading this, HOORAY! You can check in now! Maybe it will get you some type of badge.\n\nAs everybody knows, the Costco Food Court has some of the best tasting food at prices that everybody loves! Let's see, you got your choice of either a Polish or All American Hot Dog that comes with a drink for $1.50! Can I get an AMEN! A Chicken Bake for $2.99, a Toasted Ciabatta Turkey Sandwich for $3.99, and some other items that catch your eye as well like a huge slice of either Cheese, Pepperoni, or Combination pizza for umm......damn I cant remember cuz I only order it for my kids.\n\nAnyways, you guys get what im saying. They have something for everybody and its not too hard on your wallet. I say the price you pay for the membership alone is worth it just for the food court!\n\nThe only downfall that irks me is that they only take cash. You would think that since you can pay with either debit or American Express at the front registers that these guys would have the same set up. NOT! Although you can pay for whatever you wanna get at the food court at the front registers is a little better, that still is kind of a hassle.\n\nIn the end, I have yet to have a bad experience with the service and food every time I eat here. Imagine a Costco thats 24 hours. Now THATS something to behold! It IS Vegas so you never know. In the meantime, I can always go for a hot dog or turkey sandwich.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 4,
  "date": "2012-11-19",
  "useful": 6,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "Dle5jsuSUO8jgqv0JEEekg",
  "review_id": "y_h1pGh-MHEJyjy9yORs1Q",
  "text": "I've been coming here since I was a kid. It is still the best Mexican food I have ever had !!!!!!!!!!!!! Reminds me of the food my family serves in Mexico. Authentic is an understatement. The small, simple setting, reminds me of relaxing in the home of a family member. This family owned small business makes every dish with the classic TLC. I will be going there for more years to come.",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2017-06-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "DKUzQMvBN2eT1303Mlwrcg",
  "review_id": "uU7kqOfAxTXlsMsUxa-DUQ",
  "text": "I am so disappointed with this restaurant in Sun City Summerlin.  Ist of all I am not fond of the help on Thurs. - plus they have no clue how to run a restaurant.  Bartenders are waiters and they are not friendly at all.  The food is good if you don't mind waiting 1.2 hour to figure out who is suppose to wait on you.  This was suppose to be an asset to sun city....NOT!  It is also, THurs. night and NO FOOTBALL - right!!",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 2,
  "date": "2014-09-12",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "YP5pec8F839nFrx91n2vMg",
  "review_id": "g1sNWr_cWN24h0z1CSQqlQ",
  "text": "I've been going to Cordobes since I we a kid in El Monte! So happy that I get to visit and enjoy the best bean and cheese burrito on earth when I'm in Las Vegas.",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2016-07-12",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "p7lu51ngaP08RWV9Vb3Pdw",
  "review_id": "r23WDKlwv39fNmE7gB-wBw",
  "text": "Update...Sea Harbour actually limped along a bit longer than I thought it would.  Note however that it has recenly (within the past couple of weeks)been re-branded back to Empress Court.  I'll be there in a couple of weeks to try it out",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 2,
  "date": "2011-02-24",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "FEThfjRi6jzzGE5NYeJzpw",
  "review_id": "MyHyOM8V5gVVM_SficAu3g",
  "text": "New name, same staff and same mediocre over priced food. So disappointed... I was excited thinking we had a new Thai restaurant moving into the old Restaurant location. I should have walked out when I saw this same staff.",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 2,
  "date": "2017-11-19",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "_AVzNXzi6j_WJlH1rDwZSw",
  "review_id": "UhGD7Z28z-Y8mNoEcoi5wg",
  "text": "$1.50 hot dog or Polish sausage with a drink is hard to beat. Pizza, sandwiches, churros, frozen yogurt are all very good. Excellent value for your money.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 5,
  "date": "2015-09-03",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "-rrldPWUbAU8iPAbpKGEGg",
  "review_id": "8aQIZTI1AKUG8YJNDgt05g",
  "text": "Burrito was very good. Had a chicken burrito. Simple with meat beans and cheese, how I like it. Chicken was very good and moist, not dried out. Glad I came here for lunch. Pricing was good for lunch too. Customer service could be better.",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 4,
  "date": "2015-05-04",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "HB9EC8-ypOLYcxpgUtS-oA",
  "review_id": "nnjS2dAlP6oLNHCcDaMTrw",
  "text": "WTF IS THIS PLACE....we went to 2 different fridays and decided to sit at this one why who knows we were hungry.... I am positive we will never return and it sucks because the waiter was pretty cool...the food was poorly made terrible...",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 1,
  "date": "2017-11-05",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "xfv_CQ_6VPedPkKhLBMumA",
  "review_id": "AfHGrU0JaVGOEYHfjCjdjw",
  "text": "This is my favorite location in Las Vegas! I drive about 20 minutes just to get my food here. Love it and will recommend it to anyone.",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 5,
  "date": "2017-03-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "KgI_PFXJy_PwUVjVPLZvUQ",
  "review_id": "PijpOGO2kGkHiUEEgHEnhQ",
  "text": "I was hoping that the team would realize the mis-steps at their Summerlin location and have them fixed but unfortunately more of the same poor planning and management.\n\nThe outside of the restaurant looks dead as there is no furniture. Very un-inviting.  Really looks like they were not ready to open to be quite honest.  Why do restaurant do this to themselves.\n\nI looked around and it seems like there is supposed to be a hostess but just empty dining room.\n\nI work in the LINQ so after I ordered my 2 pastrami sandwiches and drinks for over $40 dollars I did want to get my discount.  The cashier had to leave the front counter to find a manager to give me my discount so this took a while.  With hardly no one in line it seems like it was so difficult for what should be a simple transaction.  \n\nWith so many other good options that are more reasonably priced the is not the place to go.  They also do not have any TV's anywhere so if I wasn't at work I would like to be able to see some of the playoff games but they don't have that either.  Oh yeah they also don't have any restrooms!!!  Seriously guys.  Wow.  Lots and lots of work to do if you have any chance of remaining competitive. \n\nSurprised that the Canter's in LA is really part of this dismal representation of what I love so dearly on Fairfax.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 1,
  "date": "2017-10-22",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "T78T8NC0fcsp5__DhTmRBQ",
  "review_id": "-la3suFSVgumW3qw8MXKpQ",
  "text": "Don't  trust to any bad review. I.m Russian and i went to Las Vegas many times. My last visit we are stayed in Caesars Palase for 20 days.\nWe are tested many restaurants, but only Sea Harbour has very nice atmosfere with very good quality of food. We spend 500$ every night but it's included 3 or 4 bottles of very good shampaine (100$ per bottle). The dungeness crab with different kind of souse was prepared  for us every time with diferent method of coocking,specialy for us by cheaf. Yammmy!!!!!  Im going back in january!!!!\n\nI hope they are remember Mister P. :)",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 5,
  "date": "2009-09-29",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "OTBgEFedeH3Cixmpry0fSw",
  "review_id": "YNpO1qOdD8KE3uFNxPYxDA",
  "text": "So... it's a neighborhood place - nothing more, nothing less.  The service all depends on how busy they are - if they are slow, you can expect good service. If they are busy, not so much.  BUT - I love their chicken wings and fries! Any time I have a craving for chicken wings, I end up here!",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 3,
  "date": "2014-07-22",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "Uy16OzO5kf6D9wCRJoA3DA",
  "review_id": "jErCbDJOvMZs076Qq2TqDA",
  "text": "If you want Mexican food, then mar y Tierra is where you should be ! Food is always served hot and fresh. I received my food pretty quick, they seem to never sacrifice quality for speed. And I love it!!! It's 5 stars from me!!!",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2017-07-23",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "bjDXwlRpZ4e4M9g0lDgPKw",
  "review_id": "P6d535hG-WT07vId8PGb2g",
  "text": "5 stars for their garlic shrimp! Best garlic shrimp I've had in my whole life. The corn tortillas are homemade and the white rice is delicious.",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2017-08-26",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "OAxV3OAIDSKBz9HjuMMYNg",
  "review_id": "R9S9G4GT2zcp6bkcdec3HQ",
  "text": "Food was good, really liked the pad Thai and especially the crab fried rice!! Bill came @ $80 and change, and we gave our credit card. When they came back with our credit card. They brought back the check and scanned credit card for $84 plus change without ever mentioning they charged us differently. I would have been ok with them saying \"we forgot to add item, here's your new bill\". but nope, they said nothing. Not one word! Wasn't like it was busy, as we were the only ones there and they had 2+waitress and us sitting next to cash register. Hmmmm. But really enjoyed crab fried rice!!",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 3,
  "date": "2017-10-21",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "WTz8ZWpyE0RGAfYQLTO_5Q",
  "review_id": "1ySG11VoBHxiYm7M2AcSHA",
  "text": "Great ambiance here. Dining room has comfortable seating and smooth jazz playing in the background. The short wait for my order was relaxing. \n\nThe food was great. I will come again. Only bad was that they did not honor the yelp 20 percent off promotion",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 4,
  "date": "2015-11-08",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "kNAYSygyUtDrk7PwAnYvPw",
  "review_id": "e1wu9lSromM30tlVg1NxoA",
  "text": "Apparently a lot has changed in about a month or two that we haven't been here. Prices were raised and the quality of food went down. At least Rivas is right next door....",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 1,
  "date": "2017-11-04",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "CwznhT_142kqmJUc-xFf4w",
  "review_id": "AP2AbcnJweUB8B0ABEFJ3Q",
  "text": "We were there for lunch and got a panang curry and padthai noodle. The food was great and got good service from Cherry. She is very friendly. I will come back and bring some of my friends too. Love it!",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 5,
  "date": "2017-10-29",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "eebP2tXi6V61FotOIUFH9g",
  "review_id": "zZ_Ey3dbwGxHP9aoLvwPog",
  "text": "Good matzah ball soup!  Loved the complimentary pickles.  Hope this place sticks around. Can't go wrong with a Jewish deli!",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 5,
  "date": "2017-11-20",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "-K3I3SCFvPS_Aw8B4gBtVQ",
  "review_id": "rMuzTWS8ORo4SLCjmiZ5fQ",
  "text": "I have eaten at this restaurant several times. I typically get the barbecued ribs which are absolutely excellent. And there are enough ribs for me to take home and have dinner the next day. The cool thing about this restaurant is that it's located in Sam's town and if you see a movie there you can use your ticket stub to get a buy one get one free meal at TGI Fridays. You cannot beat this offer.",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 5,
  "date": "2017-01-31",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "EsOu51dW3UTDJTApBxwz2g",
  "review_id": "tqOxXB6v02Z-XGXkz4puVg",
  "text": "Mah Jong is a Chinese eatery just like a food court-type place.  You go up to the counter and order your food and then wait for your no. to be called out.  The food is not too bad but a little on the pricey side.  We ordered the Beef Brisket Noodle Soup which was pretty good.  We also ordered the Dan Dan Noodle - it was only OK.  \n\nYou can ask for cups and get your own water from the pop machines.  Sure saves some $ that way.  Better still, order a cheap drink from the casino and then bring the drink to your table.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 3,
  "date": "2010-12-29",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "pR48nm8Ljs5tMD-dDPiJLw",
  "review_id": "KU_lqoyVabcsoMwjb_6Pbw",
  "text": "This is one of the worst drive thru places I have been to here in 15  years.  I pulled in to place an order about 5 after 9.  There were no other customers. It took them ten minutes to get my order. They had no chicken breasts, macaroni n cheese. So I adjusted my order n asked for some tea. They basically didn't listen and told me to pull up.  They told me the total I went v to grab change n the cashier couldn't wait 5 seconds to grab a few more pennies and he closed the window  once he decided to reopen the window to take my money I again asked about tea he never answered and didn't give me change right away I stayed another 6 minutes n nobody opened window he opened the window to give me change n shut it so fast I couldn't ask any question. More time passed my food was ready. No beverage so AGAIN I asked could I please have a sweet tea.  Surprise  Surprise no sweet tea. So I asked can I get something else. Hated to bother them and their conversation .  I was not even phased until once home I unpacked dinner for everyone and not only did I only have 7 NOT 8 pieces of chicken they did not included my 4 biscuits and the cheese jalapeno poppers were so overdone their was no cheese left in them.   What a waist of my time and money.  Thank you churches for the lack of service and not even giving me any lube!!! You get 0 STARS from me!!!!!!",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 1,
  "date": "2016-04-12",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "_M3R2P62C3c5EfvtL2uuQg",
  "review_id": "8FR-YQVjG3nO1Grz1DaMKQ",
  "text": "My favorite Chinese restaurant inside a LV casino.  Wake up with a hangover and order the fish congee and beef pho soup. Even more of an incentive to come here, they also take Harrah's Total Rewards comps. FREE food = happy poor gambler.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 5,
  "date": "2008-08-27",
  "useful": 0,
  "cool": 0
}, {
  "funny": 5,
  "user_id": "cVrM2BvOvPV0Vi_rC8kepQ",
  "review_id": "Rl-S5QS4Zje6Q8BEbqiBtA",
  "text": "I had just arrived downtown and was strolling around on Fremont Street.  I wanted something quick and inexpensive to eat before I headed out for a meeting.\n\nBinions' Deli sure took care of my needs. I found it in a back corner of Binion's Casino. Their fairly limited menu has deli sandwiches (as you might expect), plus hot dogs, hamburgers, soups and stews, salads, some breakfast fare, and frozen custards.\n\nPrices are not expensive. My patty melt was a nicely cooked good-sized burger with fresh lettuce, tomato, and grilled onions on sliced marble rye.  Served with potato salad and a big pickle, ran just $7.99. It was pretty excellent! \n\nSoft drinks are only available in one size, and that will run you $2.99.  That price did seem kind of piggish to me.\n\nAnyway, the food was good and service was fast and friendly.",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 4,
  "date": "2017-12-06",
  "useful": 7,
  "cool": 4
}, {
  "funny": 0,
  "user_id": "lqIDgoNdmrlDwfmIRcHRjw",
  "review_id": "zxNvtrADnRjOFDIuNNGbNA",
  "text": "Went today with my girlfriend to eat here, she recommended it to me so I thought I'd try it. We both got the garlic shrimp came with fries,rice,shrimp,salad. Also tortillas. Everything was amazing the flavor was so good. I've tasted a lot of shrimp in my day but this is be far the best I've ever tasted. I highly recommend this place.",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2016-12-07",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "9HD-2l1T789twotdpvlVkQ",
  "review_id": "kWGGHWYGZirSoJXJReYkrA",
  "text": "The service is excellent!  They are vary friendly and cater to all your needs. I should of took a picture of my salad because the presentation was spot on.",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 5,
  "date": "2016-12-03",
  "useful": 0,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "ksKSs5Apj5zriDnPtuAuaA",
  "review_id": "YfTw2_qImv74H_mr3LdAWQ",
  "text": "Customer since the late 1990s. Still return on a monthly basis. Owners are super friendly! Food is delicious",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2015-01-05",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "52EUpIzziGyOHjK1Ni3-Yw",
  "review_id": "U1Tx75FuUXbcMXP_mz-n6A",
  "text": "You can never go wrong here. Food is great and cheap. We're at the DMV today with a 140 numbers in front of us so we decided to go down the street and have a slice of pizza while waiting. Pizza is so yum and big slices!",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 5,
  "date": "2014-08-19",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "2gDunT3znDnp5Smn_ZHioA",
  "review_id": "MiId44SbSBz5l1fytqLg2Q",
  "text": "Amazing food!!!! The Cuban Roll sandwich it lived up to the hype. Don't leave Vegas without having one, won't disappoint.",
  "business_id": "xAhB_i6-799TakpGqVplWw",
  "stars": 5,
  "date": "2017-11-13",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "w727ylVwBZq6Ytpjvn2DpQ",
  "review_id": "DX7QRWeKpGCbEBlUfuGzoA",
  "text": "Came in here with my parents before heading to the airport, and was not disappointed.  The burritos were incredible.  They were full of so much flavor,  or to mention the guacamole that came with it.  The owner, José, came out and welcomed us.  We talked with him the whole time we were there.  He and his wife were so pleasant.  They were so polite, and very appreciative of us for coming in to their restaurant.  I will definitely be returning, and will be making recommendations to friends who will be coming into Las Vegas for El Cordobes restaurant.  Thanks, José!",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2017-07-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "cFoI3xairKNAGtu6EGRv-w",
  "review_id": "vfCpQSJt_arud1xBsYcXRQ",
  "text": "I grew up on good Jewish Deli. I am the daughter of a Philly Deli man. I was very excited to hear that a Jewish Deli was opening in the Linq Promenade. That excitement quickly turned to great disappoint when I got there. The corned beef is nothing but thick pieces of warmed brisket. Same for the pastrami. That is NOT how Jewish Deli is made! It must be cooked fresh in the store and sliced thinly on a meat slicer. Once it is put in a refrigerator, the good taste turns bad. Canter's does not cook their deli meats in the store. They buy it so you know it has already been refrigerated. Then, they heat it up and chop it with a knife into large chunks. Their rye bread is NOT authentic Jewish bakery rye. Who are they kidding? People who have never had good Jewish Deli on bakery rye -- that's who!!! The only good thing I had was picked green tomatoes (we call them sour tomatoes) because they were purchased from a good supplier. If you advertise that you're a Jewish Deli, then you damn well better be a Jewish Deli. Otherwise, it is false advertising!!!",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 1,
  "date": "2017-11-08",
  "useful": 1,
  "cool": 1
}, {
  "funny": 3,
  "user_id": "uAk2xxwgFIMgaS4Yl1D6Zw",
  "review_id": "7uEppOimRhPG4bRaLE_3Jg",
  "text": "Terrible, terrible customer service. Very bad experience with ordering a pizza. Paid for two whole pizza with Costco card. Was told by cashier it would be 10-15 minutes. Set timer on phone for 15 minutes, had teenaged son to check on order 12 minutes in. He came back to wait area said lady cashier said it would be 25 minutes but she did not sound too sure.\n\nAfter 3 more minutes when 15minute timer went off. I spoke to another cashier in food court and showed her my paid receipt and asked how much longer. She went back to where the pizza orders were and spoke to some guy and came back and said order was never processed and that I was suppose to let them know I wanted them to start making my pizza. Go figure, I thought me paying for and ordering the pizza was indication I wanted them to make pizzas. \n\nI was then told it would be another 15 or 20 minutes for them to make the pizza. I set my timer again, and went to the original cashier who said that it would be 10-15 minutes. He had this stunned look on his face, until his assistant told him very quietly you have to let them know to make the pizza. He apologized and then tried say it was up to me to let the food court know I wanted them to make pizza I had paid for. \n\nThen when the 15 timer went off again, we went to check on pizza; our pizzas were sitting their waiting, you would think they would have hand delivered after the numerous mixups when they were ready.\n\nI have ordered pizzas before at other Costco locations without all of this confusion. I won't be using this location's food court - #737 again!",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 1,
  "date": "2017-04-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "KP34-t6PuiELcRozicba4g",
  "review_id": "N07zwRgbZxdRHWoX_ik_OQ",
  "text": "The food is very well-executed. Great spot for authentic viet food. Portion is great also. Definitely going to come back and bring more friends with me.\nInside is clean and very spacious. Great spot for hanging out with your friends.\nThe owner and waiter are attentive and provided good service",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 5,
  "date": "2017-07-16",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "bcNNMNfxXhUN2NZDNEl76w",
  "review_id": "_5jmFZnyb1UbiCRpPLIWWg",
  "text": "This by far is the worse churches, the chicken is amazing, if you can get any, the employees are always rude, as well as management, they close every day at 830 even though the sign reads 9, and if you are there after 800 they claim to be out of chicken, this has happened numerous times on different days",
  "business_id": "Wo_ZL7I3hS-eW6pJWg1V8A",
  "stars": 1,
  "date": "2017-04-27",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "uU2B1vrqkpWJI30xoooabw",
  "review_id": "Ql-UZQ16rWGn69oqiY9CsA",
  "text": "Cheap, no frills food for when you're hungry shopping at Costco. The line can be long during the lunch rush, but it goes very fast. There is almost always seats available even though it's so busy, the real problem is trying to get across the floor with all the carts people have parked randomly while they are grabbing a bite to eat.",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 4,
  "date": "2016-11-27",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "GtAPF7QTFQSo7ewPIS6nTg",
  "review_id": "r52G9LBHqZt9Zu5WUvFrPA",
  "text": "We dined in at TGIFridays last night with family and I must say , our experience was wonderful from beginning to end . Our server Logan is pretty much a part of the family now ! He welcomed us , gave us his honest opinion on the menu based on our interests and he was on point the entire night . This was our first visit to this particular location but it will not be our last ! I cannot stress enough how awesome Logan was . He went above and beyond to ensure that our experience at the restaurant was like no other . Our food was awesome , we received everything quickly , as ordered and he made sure everyone was satisfied with their food . We will absolutely be sure to have Logan as our server each visit , he's the best .",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 5,
  "date": "2017-05-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "CtKVUMeZq4AgQ1EDUSaO9w",
  "review_id": "zY6FqXNKYp45yqFJ0xWxaQ",
  "text": "i like the 99cent Wednesday chicken taco special. it's a very authentic experience to me. if you are a pretentious kind of person you won't like it here - better stick with high end restaurants and pay a lot more - being pretentious comes with a price.",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 3,
  "date": "2011-11-10",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "viPmmrXIABGkdX2z8BShnw",
  "review_id": "nk6QMXbeeDLcwslVAfKILA",
  "text": "The wife and I went here prior to a show at the Colosseum.  We decided to try the five course tasting menu with match wine.  \nNegatives: Overall, I was a disappointed.  There were only three different wines which didn't start until we were on our third course.  The sauvignon blanc served with the lobster didn't pair at all.  My wife's seared sea bass was tempura-ed and very fishy.  Normally, when one orders a paired wine service, that service includes poring the wine in front of the guest with a brief description of the wine and why it was chosen for that particular course.  The only piece of information we received was, \"this is an xxxx, enjoy\".  \n\nPositives:  The staff was very attentive and accommodating.  The space is extremely pleasant and relaxing.  The Pinot Noir and desert Muscat were excellent.  (It would have been nice to have seen the bottle they were poured from.  I would have found them at the wine store and purchase a few bottles.)\n\nI think we might go back sometime and try ordering A la carte.",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 3,
  "date": "2010-05-12",
  "useful": 1,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "Gf5II9mRnaeU4ZPZxhNmWA",
  "review_id": "NFlroQxkAbbOb7QfWmPtiQ",
  "text": "Great delicious food (Oishi).  The best pastrami ever. \nCool place.\nFriendly staff.\nWill be back soon.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 5,
  "date": "2017-11-25",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "LRQTlvVNh1u-vVEg_2-Nag",
  "review_id": "9TEu91qvsUFgxeMuxtCu5g",
  "text": "Came here to eat after watching Penn & Teller. Thought our options were limited so we settled on quick Chinese food.\n\nTo my surprise, the noodles are pretty legit. Definitely more expensive than I'm used to (holla at some $3 won ton mein!) but FAR better than what I expected for late nite casino eats. The duck noodles were satisfying considering I got about a third of a duck, a nice helping of choy and noodles that only seemed to expand as I ate. \n\nWould come back again next time I'm at the Rio.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 3,
  "date": "2010-05-12",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "HeTqkQClXiWtV2ePaj1fSA",
  "review_id": "UqEdtoonLb2BELqC-poitw",
  "text": "Eh I didn't expect much out of this place from my first glance at the menu. Orange chicken is not considered real chinese food sigh... Regardless, I had a long day without food so I basically went for the first restaurant I saw in Rio. I ordered the duck noodle soup because it did not sound that bad. I thought the duck was actually alright the skin was crispy and there was actually a large portion of duck on my noodles. However, a lot less could be said for the noodles. The noodles were so dry and hard.. not fresh noodles at all more like instant ramen texture. Considering I paid 10 bucks for it they could at least use fresh noodles? Anyway I say skip this place unless you are desperate like I was.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 2,
  "date": "2012-01-08",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "Dd0Y5Gk5nyw1pRIpUb7XdA",
  "review_id": "W-ApdCRsckckPkQ7KZEheg",
  "text": "I love their Planchas! Its a platter with fish, octopus, shrimp, onions, peppers and comes with rice, beans and soup. OR you can pick the platter with carne asada, chicken and green chile pork. Their food is delicious! Try their oysters and ceviche!! I cant wait to go back!",
  "business_id": "KUbCQ2ah__c5x0q_6b4oTA",
  "stars": 5,
  "date": "2014-05-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "84VhjLo7IUBHzv26Dsjhcg",
  "review_id": "UFqGwtuiD3z-oFhPn-80Fg",
  "text": "I was looking for someplace to have a quick sandwich before A show found this little place in the back room of billions casino not much to look at but a really good pastrami sandwich really enjoyed The server was a wonderful guy will have to go back again when I'm back in town again Argentine cowboys Boston mass",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 4,
  "date": "2017-02-13",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ud8KV_7ZYqa1jOGapI7YFA",
  "review_id": "5LBmF7jw9CtO7pjfSk56HQ",
  "text": "It was very busy and the place doesn't seem fully finished as there was still some construction outside, but not once did I second guess coming in. Everything was handled great. Food is good as usual, service as well. I'm used to the Warm/Springs/Durango location, but I have my new favorite restaurant in Downtown Summerlin.",
  "business_id": "j4F5LtyQ3_dKLJbIEkwFpQ",
  "stars": 5,
  "date": "2017-12-10",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "lLyBzM0l6R2DWHzNKqrN2Q",
  "review_id": "gDUl_SKom7W03YWpIJjFEw",
  "text": "Brand New Deli just opened a month ago, they really have their stuff together. The food is amazing and the service is spectacular. The easiest access point is on the Promenade Around The LINQ Casino.\n\nWe'll be back for the Pastrami!!",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 4,
  "date": "2017-11-19",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "1A65giueKox9xbcar5uv9A",
  "review_id": "-CQodgTovfWwf-kKndrHjQ",
  "text": "Don't stand around 2hrs on a Fri or Sat night waiting for ramen, come here! 4 times the size, clean fresh food quickly with friendly service! Didn't give 5 stars only bc they were out of 2 items, otherwise perfect!",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 4,
  "date": "2017-09-24",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "aGgNm24n_jpgD52nhbJiHw",
  "review_id": "xvDgFPFIUETpA0TwWyRN8w",
  "text": "So when you are in Vegas and you need some thing before you start drinking the night away, think about getting chinese food. Why chinese food? I have this theory that the greasy the food the better the alcky doesnt soak in your stomach. haha! The first night we got there we were in a rush to head out to XS, so we stopped down here since we were staying at the Rio. \n\nThe prices for the dishes range around 10-12 dollars for the main dishes. You might think these prices are steep but its family style and the portions are pretty big! We had the general chicken which came with a bowl of rice, and chow fun. Everything was nicely cooked and not over seasoned which I came to the conclusion that there probably wasnt MSG in the meal which is always a bonus. They have a full stock of condomints: soy sauce, sriracha, garlic chili sauce, hot mustard, sweet sour sauce and many more. I also liked that the cooks in the back were old chinese guys so you know the food has to be sorta legit hahaha.  The last night there we had the food again, this time me and my gf split the hot and sour soup and the Singapore noodles. Now that I look at the pictures of the duck, I should of ordered that too.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 3,
  "date": "2010-08-04",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "pXFHEXL_bjvzbnLVGEcOIA",
  "review_id": "07ud6jsM9tuN0q8m1VRZAA",
  "text": "My fiancee and I ate at here over the weekend during our \"nice\" dinner night.  Our \"nice\" dinner quickly (or should I say, very slowly) turned horrible.\n\nWhen we walked up, we were greeted by a nice hostess who promptly seated us.  This was the last pleasant moment.  We ordered an appetizer, which took 30 minutes to get to us (mind that there were only 3-5 other couples dining).  I eventually had to tell the manager that we had yet to receive our appetizer -- 30 seconds later he returned with it.  I will mention that our server walked by us approximately 20 times during our wait, without making eye contact or apologizing at all.\n\nAbout 1 minute after finishing our appetizer, another waiter (who we had not seen all night) brought us our entrees without even removing the appetizer plate.  The food looked horrible, as if it had been sitting in a steam tray all day.  I had ordered the Hong Kong style noodles, which were thrown in a cheap, green-tinted pyrex serving tray and looked like one giant glob of noodle.  The sauce was bland.  The shrimp had a nice flavor to it, but that was about it.\n\nMy fiancee ordered Egg braised tofu with abalone sauce, and it essentially was fried tofu slathered in a disgusting looking gravy on a bed of creamed cabbage.\n\nBoth my fiancee and I have traveled the world extensively and have eaten fare from numerous countries and this was by far the poorest \"authentic\" cuisine we had ever tasted.\n\nSteer clear, don't waste your money (or your time) here.\n\nFood:          D\nService:      F\nAmbiance:  B+",
  "business_id": "pzBTsxScWslK5VpfK-qWjw",
  "stars": 1,
  "date": "2010-02-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "FCGCxiXBrj1p_8cscTeQXg",
  "review_id": "0wNn55A5T5m_gljYcJEleg",
  "text": "Even though the dishes average $10- they are big portions.  Great for sharing.. Pho for $10?? pretty expensive right? But you don't have to leave the hotel if you are staying here, so that is the convenience... the yellow noodles were just okay, i liked the pho a lot better, and I was very surprise they are very generous with their portions, so generous that the 2nd time we went back, we had to request for less noodles and more broth.. the noodle soups here are loaded with lots of noodles, lots of meat and beef balls which is great since you get a lot for what you pay for.  I would definitely recommend sharing because they are big portions..Only thing I didn't like was the crappy bowl that it came in...It was too flimsy and hard to eat...Definitely a great spot to come to cure hangovers if you are staying at the Rio..",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 4,
  "date": "2011-06-21",
  "useful": 0,
  "cool": 0
}, {
  "funny": 3,
  "user_id": "Bqe0HSxLfDfc38AxlKxYbQ",
  "review_id": "kank_EIZWE_tdNGPQHn-XA",
  "text": "Apparently today, Canter's Can't \n\nThey can't tell you the WiFi password and have no motivation to find out (three servers). \n\nThey can't tell the difference between regular and passion fruit iced tea (twice). \n\nThey can't put all the ingredients in a dish without a staff meeting. This was Lox, Bagel, cream cheese, tomato, onion and capers. They missed the onions and capers. Duh?  At a Deli?\n\nIf you've been to the one in LA,  DO NOT go here. You will cry.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 2,
  "date": "2017-11-24",
  "useful": 1,
  "cool": 0
}, {
  "funny": 6,
  "user_id": "JyA-y8z7UKJVOaIY9L6_aA",
  "review_id": "lkNSvQT4sdeXYIiTO4PIuw",
  "text": "Ive always wanted to visit bc it doesnt look like your average bar. However the service was horrible. It seems like its a place that only caters to their older regular crowd. There were a number of things that were rude:\n\n1. The hostess looked like a deer caught in the headlights. She provided no info about the establishment and was not at all warm and welcoming\n\n2. The older male bartender advised me and my two friends to sit at the part of the bar with no machine games, JUST IN CASE the other patrons wanted to hop games\n\n3. He was very persistent that we needed to order our drinks before we can order our food\n\n4. In an effort to be nice, my friend asked \"what drinks do you make best\" he looked at her in acknowledgment and pointed to me for my order , thus ignoring her\n\n5. As i cash out from playing black jack for 5.50. He ask me to play again so i could lose and he only has to give me an even 5. He proceeds to start pressing the buttons for me.\n\nThis place may he lovely its regulars, but it cant be good for business to treat new comers like this. \n\nNot to mentions the spinach dip was like white nacho dip with green clumps in it",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 1,
  "date": "2012-03-18",
  "useful": 12,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "nGGTEoAQ214j3ReN8Pwy4g",
  "review_id": "is9_Mfyq1s5uPKpMbwmHLQ",
  "text": "This is just an awesome little \"hole in the wall\" Mexican restaurant. Their prices are great and their food has that home made taste that many places struggle to capture, but El Cordobes does it with ease.\n\nIf I had to describe this place in one word it would be \"authentic\". Their menu isn't tailored towards Americanized Mexican food like so many other places do. You won't find a salsa bar or queso dip, but you will find tortas (Mexican sandwiches) and things like goat soup.\n\nAs soon as you walk in you'll notice the dining area is very small, just a few booths and some tables in the middle. I wouldn't come here as a large group, as I don't think they would have the staff to handle it even if they had the room. This seems like a place that always has just one cook and one server.\n\nI love the salsa here, though be warned it is a little spicy and they don't have anything milder (like I said, authentic). Funny enough this is they only thing I have had that seem's spicy, though everything is well seasoned. One thing that stand's out about their food is they seem to use less salt than any other Mexican Restaurant I have been to. You don't really notice how salty most Mexican food is until you come to a place like this that doesn't use as much. The lack of salt is actually a good thing, as it let's the natural flavors of the ingredients and seasoning's stand on their own. And heck, you can always add a little salt if you need it (though I have never felt the need here).\n\nI've tried quite a few things on the menu, and I have been impressed with almost everything. I am even more impressed considering their prices are excellent. Almost all their meals are less than $10, and burritos run for $6 or less. The two thing's that just astound me are that they have ceviche tostadas for $1.50 and tacos for $1.25. You can't find prices like that at Mexican fast food, let alone a sit down environment! And they have a ton of meat options for the tacos to; chorizo, asada, pastor, carnitas and chicken just to name a few. My wife and I almost always get a few tacos in addition to our meals every time we come here as they are very good and you just can't beat that price.\n\nMy favorite thing on the menu is anything with shredded beef in it, though I also love their chili verde. To be honest the only thing I ever had here that I didn't like is a torta with breaded steak, and even then the flavor was good it was just really chewy and tough. I also see a lot of people order soups, which I haven't tried myself but smell great and are served in large bowls. The next time we come here I plan on trying one.\n\nOne last thing, they have Mexican sodas and Mexican beers for great prices to. Sodas are $2 and beers are $3. Everything is served in glass bottles, and the coke is even in the larger size than the typical 12 ounce size. Yet another thing that adds to the authenticity of this establishment.\n\nIf you love really good authentic Mexican food, then you really need to give El Cordobes a try. This is one of those places that really stands above most of the rest.",
  "business_id": "ifkCEpYaSAUT3WVQNxwvXA",
  "stars": 5,
  "date": "2017-07-27",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "tijY6q1RKwXi3yG8ckF2EA",
  "review_id": "_nnU5AcStJlVHalsy9xzkQ",
  "text": "Went once and it will be my last. There were two ladies working there and a group of 5 playing poker to the side of the bar. I sat at the bar for AT LEAST 15 minutes (mind you no one else but the poker players were there) until I was greeted. It took ANOTHER 10 minutes to get a drink. Service is horrible.",
  "business_id": "YAiHkQAQ9sm23V1CyNT2zQ",
  "stars": 1,
  "date": "2014-09-20",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ACMYTmlycF2-HgSZ8lyC0A",
  "review_id": "pKOGaUVq6Iy6ivfy5L34Gw",
  "text": "Where else can you get a foot long beef hotdog and a 20 oz drink with free refills for $1.50 + tax. Enough said 5 stars!",
  "business_id": "C2tt_-1YE4X2T7azXEF7IQ",
  "stars": 5,
  "date": "2017-04-02",
  "useful": 0,
  "cool": 0
}, {
  "funny": 3,
  "user_id": "mYNZLYcnZol-oSfU-WP4CQ",
  "review_id": "YLaDwTshCjy5wj7j9m_G8A",
  "text": "I placed an order for takeout-- we ordered Panang curry, massaman curry, and soup. We had high hopes-- but Benjarong wasn't very good (the Thai place that was at this location before) and this place isn't very good either. Same owners new name?\n\nThe curries weren't creamy or flavorful. The Panang lacked flavor and the chicken used was weird dark meat and cut in large hunks.\n\nThe massaman curry was very viscus and just again, not good. \n\nUnfortunately we wont be ordering from this restaurant again.",
  "business_id": "UeEzvTGkSyaHRvWTlZ1ISA",
  "stars": 2,
  "date": "2017-10-22",
  "useful": 8,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "Me4Tg7Zv1uSnY4udq32Sbw",
  "review_id": "DimznMmpl6HU6hPZlErkag",
  "text": "Holy crap, this place is awesome! Talk about a killer corned beef sandwich! Haven't had a sandwich that good in Vegas ever. Chose potato salad as a side just because it came with the meal. Also came with a plate of pickles and tomatoes, loved the salty pickles! Tried the green tomatoes but they aren't really my thing. I could live on the corned beef and pickles alone. Be nice if they added a couple T.Vs to catch some football games on. Service was good, drink refills definitely wasn't a problem. Highly recommend!",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 5,
  "date": "2017-11-18",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "p3DMYR9Qc4ADPPG82czHBg",
  "review_id": "0q-PxG6W3GME4QHyWmlziw",
  "text": "Great pastrami piled high on rye, just the way we like it!  This place is tucked in a corner off the casino floor which actually makes it even better, away from all the noise and smoke.  Simple and basic but fast and tasty!  Could have used a larger portion of potato salad on the side just to balance the meat out but there was more than enough food.  Another great find with a little help from Yelp reviews!",
  "business_id": "yCUM58iPU8-G6KbgmzuKjA",
  "stars": 4,
  "date": "2013-05-22",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "VeAYUb4tWFgWi81NjKTWEA",
  "review_id": "RUpqosR_NOGk_WWQW5NVSg",
  "text": "LOVE, LOVE, LOVE Five Star!  Best little place with the best service ever!!  Five Star Friday's with Katie and Amy were the hi-light of my week (and date night tradition with the hubs) until my work schedule ended it.  Welcome though to Five Star Saturday morning with Jordan, my new after work spot!  6 am the guys from work and I love to go hang with Jordan and enjoy his exceptional service!  Bored on Saturday night, then Katie and Rich will keep you company (and keep you laughing all night!) And let me just tell you about Sunday morning breakfast with Terri!  She is the sweetest!  Always has our redbulls ready as soon as she see's us and knows my breakfast order by heart!  Can't beat Five Star Tavern on Craig and Rancho!  I fell in love with the place the first time I walked in the door and it's the only place I feel comfortable going by myself!",
  "business_id": "J2nCJBrGn4EQT1abnBHaUQ",
  "stars": 5,
  "date": "2014-06-23",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "KWS0883bbBEJoDlCiyDBuw",
  "review_id": "5HaJtTr7QCwj2TApPJP96g",
  "text": "Before a High Roller ride, my husband & I decided to have a breakfast nearby. We were surprised to see Canter's Deli from our Yelp app. Since we're from LA, we had been to the Fairfax location. \n    At 1st, we were skeptical because of the 2 star rating and the negative reviews. But as  we're in the casino area we took our chances (LOL). And we're grateful that we did. \n    1st win:  Upon entry, we were greeted by a smile as we were seated in a comfortable place. Noticed the cleanliness of this deli, great atmosphere. \n     2nd win: service - Our drinks were served real quick. Our orders came just right on time & were served hot the way that I requested from our server.\n      3rd win: food - OMG. My hubby ordered the pastrami sandwich. I ordered the combo sandwich (pastrami & corned beef) . We added the matzo ball soup. These came with sides of pickles and green tomatoes. The rye bread was soft & fresh. The matzo ball was savory.  The huge serving of pastrami was seriously delicious & melted in our mouths. \n      For the negative price comments: our huge servings relatively covered 2 meals versus 1 meal, not to mention the great taste of our food, clean place and cozy dining area.  Come on, you're in Vegas. I bet everyone else spends more to have fun. Then why not spend on something that satisfies your hunger & gives you a nice dining experience. \n        Canter's - you're now in the list our favorite spot in Vegas.",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 5,
  "date": "2017-11-13",
  "useful": 3,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "6vuLSEjKyQpE3rC88MQmkA",
  "review_id": "zEq9bbibyMkwFDRXIIhT9g",
  "text": "Owner is a racist a^^%$#@! Maybe next time you wont talk shit in front of your customers thinking they don't understand you. A bunch of fake 5 star reviews wont help bad customer service",
  "business_id": "2xCswTbQwG6CVka0U3XayQ",
  "stars": 1,
  "date": "2017-08-11",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "-PbPi3wYwpLHs6bM7pwFrA",
  "review_id": "tAoqOaBDe7eWdd6JQ5PfCw",
  "text": "Inside the Rio Hotel...\n\nI'm sick.  So I got the shrimp wonton soup.  It was good.  But small.\n\nMy brother got the combination fried rice.  It was good.  But small.\n\nFor $11-12 a dish it should either be fan-freaking-tastic yummy or be served in bigger portion.",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 4,
  "date": "2010-02-12",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "rtzVfZdITZukLjMlBH92Kg",
  "review_id": "6Ed3axDApbv4dQ4HMLBzgA",
  "text": "On my to the movies, I decided to stop in for a quick bite...ordered the pastrami sandwich, which, by the way was scrumptious!! But the highlight of the entire visit was our AWSOME server Kelly!!!  She was bright and bubbly and was extremely attentive to our needs!  If you are ever in the neighborhood and want excellent service and fantastic deli sandwiches...make sure to stop in and ASK FOR KELLY!! You won't be sorry! Thanks Canter's!",
  "business_id": "VSKuaELhYMXOpLql_r4Z0A",
  "stars": 5,
  "date": "2017-12-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "xomN4f3bYsaUnrw2su9aKQ",
  "review_id": "sOAByKmuVzSyoHGnEkViPQ",
  "text": "Same thrown together nonsense...its never better the second time..save your money or go to rivas next door...not the pre-cooked sitting on the grill crap like here..just saying..i give it two stars for being clean",
  "business_id": "KuZJcLIe3r0zO0x5TlmsKw",
  "stars": 1,
  "date": "2011-06-15",
  "useful": 3,
  "cool": 1
}, {
  "funny": 20,
  "user_id": "nC4x02Sv0YYT9CV0UcMSxw",
  "review_id": "wWLkXJFaKwCpdRyRp7hy8A",
  "text": "Happy hour is so cool here I always make my way here after drinking. The Jack Daniels sliders are so good, and last time I got the spicy chicken sliders to they're also good, the Bacon potato wedges where kind of mushy. Prices are for 4  Jack Daniels sliders $6.00, 4 spicy chicken sliders $6.00 I forgot how many bacon wages you get cause  didn't finish those but those or $6.00 also. I Think happy hour starts at 10 till closing  not sure cause it's always late at night when go there and it is only in the bar Area there's also booths there too where you can sit not just at bar. I will be back next time I'm in town",
  "business_id": "X5Q_PKC-AeMrO4uSpnmgGg",
  "stars": 4,
  "date": "2016-08-24",
  "useful": 34,
  "cool": 31
}, {
  "funny": 8,
  "user_id": "HipNu3vK_MSJ-IIGsKFbfg",
  "review_id": "BdIUcfETqBfVSEgOrPy3cw",
  "text": "Chinese Chow\n\nWe were defeating the system as we purchased a mini Heinekin keg @ the on site \"one stop shop\" in the Rio. Beer filled Starbucks cups in hand- we walked around the casino and finally planted our butts @ the food-court like area right next to the sports betting. \n\nPerfect!\n\nBrew, the Lakers game, and a few steps from some grub. I hovered back and forth from the two choices and Mah Jong won (but not by much). A $12 hot dog verses a $12 Chinese food.. take YOUR pick. \n\nHighlights & Low-lights:\n\n*Pricey but think about where you are\n*Ordered the BBQ Pork Soup: The broth wasn't flavorful AT ALL but it's nothing a LOAD of hot and hoisin sauce can't fix\n*Pork itself was good but overly fatty\n*Lines can get long so of course the wait can get lengthy as well\n*Service was middle of the road \n*Lots of condiments out for your taste buds pleasure\n\nYes, I've had WAYYY better Chinese food. Would I go back? Maybe if I were staying in the Rio again and had my fill of Buffet madness. \n\nNot bad but not tooo good either!!",
  "business_id": "eHgxuooEDnjsmmckxPcKHQ",
  "stars": 2,
  "date": "2011-04-07",
  "useful": 11,
  "cool": 5
}]
