[{
  "funny": 1,
  "user_id": "-cDkbjwFxZQOvd95O2SREw",
  "review_id": "d_CORW3mRsB4crdBpG2QnQ",
  "text": "Two people\nOrder 1: Philly Cheesesteak: $14 - Yuck! No flavor and very expensive. \nOrder 2: Chili Cheese Hotdog: $8 - Good but very small. It's like a kid's hotdog. \nOrder 3: Regular drink: $4 \n\nTwo stars because it did fill me up. I had to force myself from finishing my $14 cheesesteak. Soda has free refills.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2016-04-07",
  "useful": 0,
  "cool": 0
}, {
  "funny": 6,
  "user_id": "A2HbQtcuK2tkegX7BXcEtg",
  "review_id": "gwtAX3XAwuYjNglhIMe2Dw",
  "text": "For some reason, whenever I have good hot dogs that are worth every stinking dollar I paid, I always want to smoke two (2) cigarettes, one after another, while faux-drunk calling an ex-girlfriend.\n\nFood court did not have ashtrays nearby. \nCellphone signal was blocked in the casino.\n\nSerendipity likes to tie me up and have her way with me sometimes.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2008-07-29",
  "useful": 4,
  "cool": 3
}, {
  "funny": 0,
  "user_id": "VpsAZVHauSn5qdDVznLTGA",
  "review_id": "3M2iuw6ho68SMJecXML5gg",
  "text": "My wife and I had lunch here today. She ordered the Foot Long Hotdog with onions, sauerkraut, and relish; she topped it off with ketchup and mustard. It was delicious. She would definitely order this again. I ordered the Chicken Philly Cheese sandwich. Delicious! And get ready for Nathan fries....they are huge and delicious! Not to mention they give free drink refills! We will definitely be back. Check out the picture of our meal!",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2015-07-16",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "n2Qk6brSnjwx0iBRrz_G2Q",
  "review_id": "iai8cWceyXLkMS8Z6qWvKw",
  "text": "Very slow and rude service, but the food was good.  It's also pricey for what you get, try a different place in the food court.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2016-07-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "W1AN4kBUQVTvVTvg5IbP5w",
  "review_id": "ut21HnEKixuEtotVMFdLNA",
  "text": "Fries were over cooked and burned and the Krispy Chicken sandwich was $10 and it was the size of a McDonalds small Hamburger, LOL definitely not the business and as far as the flavor it was OK nothing special though, I would never eat here again to be honest. Oh Yeah LMAO the medium soda was $4.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2015-02-05",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "SMdpowQh1FdDvRvXmM_coQ",
  "review_id": "8y4r672M67SF33QoeuuLew",
  "text": "Just tried a footlong hotdog and it was so good. It had sauerkraut ketchup and relish. It was really good and the French fries were really good too. The price is very reasonable too. Good bang for the buck.   \n\n\n\n\n\nHad pancakes here this morning. They were good and my husband had a breakfast sandwich and he enjoyed it too. Not bad for a fast food",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2015-07-16",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ju5QIg3E6QbcZhtG-gF6Qw",
  "review_id": "YQJG6pHAb86Uwo3FP-eR9g",
  "text": "The Philly cheese steak is good, meat is moist and tasty, bread is warm and soft, and they cut it into half for you ....pricey for a food court, for $14.00, yes, but hey, this is inside a casino in Vegas..so it is expected.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2016-11-13",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "F6zrhW-q0gxqJayoD-MPiw",
  "review_id": "4m3-KvNx14oF7hUMPS_AWQ",
  "text": "Looking at other reviews, it looks like this Nathan's is unique in its grossness.\n\nWe went there for breakfast on our last day in Vegas as we didn't want to spend time going to another hotel.  The line at McDonald's was long and there was nobody at Nathan's.  Now I know why.\n\nThe express breakfast (which is the only breakfast option) is $8 or $9.  The food was horrible and greasy.  My wife was literally gagging trying to choke down her food and ended up just eating the soft, moist toast.  I'm a bigger eater than her, and even I was having trouble.  Just disgusting.\n\nThe food on my plane ride here was much better.  If  you're trying to decide between the two, go for McDonald's.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2010-10-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 6,
  "user_id": "8v3aEuuHEJU_8h0OgmsfDA",
  "review_id": "NdibHTmyvbGdXlq8pkukfg",
  "text": "Very tasty cheesecake platters made while you wait. Attentive service. CLEAN!",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2016-04-03",
  "useful": 8,
  "cool": 7
}, {
  "funny": 2,
  "user_id": "bgJTrktV65nC4LvuVfQ-GQ",
  "review_id": "gm2HtDu-yxX9Gx-hFlVYrA",
  "text": "Bacon wrapped hot dog. Yup. Why you so expensive though? $4 for a drink? I'd rather compile, collect, and store my saliva in my left cheek and swallow every 10 minutes.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2009-08-01",
  "useful": 1,
  "cool": 1
}, {
  "funny": 1,
  "user_id": "g_DnmdEq-JQEt4QL1uSuQw",
  "review_id": "tdCWvsMJIxGtAOOYPA6GAw",
  "text": "I'd never eat here again.  The only reason I did in the first place is b/c I needed something fast in order to make the Ka show I was attending.  Like ppl have already said, it wasn't very fast and the dog itself was overcooked and the fries were soggy.  Why this place is \"famous\" is beyond me!",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2009-05-12",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "hV0bpNkyvEQUL7mkOunJ6A",
  "review_id": "5lD8AR8UXNzl0ZVVrB7sGA",
  "text": "Love Nathan's every time we go to Vegas. Their French fries are to die for.\nService is good and fast. We've gone to the one in Luxor,MGM and Bally's \nWe always get the Philly Cheese steak and a side of fries.\nJust make sure to check the hotels for their hours- their is most of the hotels on the strip.\nAnd don't forget to grab your coupon off of your placemat before throwing it away too.\nNever disappointed when we go- I recommend everyone check them out when in Vegas",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 5,
  "date": "2017-11-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ZcxJFtoyD6fz85f6HEYlbg",
  "review_id": "JDO_EL2bmbR8BMnjf3ly0Q",
  "text": "compared with the nathan's I had at the palms after the bjork show, this dog tasted like it had been cooked days before, maybe years - still, it's cheap for vegas and oh so tasty with beer.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2008-11-24",
  "useful": 1,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "vk7v2F5X63S3hVL_-IUfiA",
  "review_id": "M-Foh9lVwkI_oUHu8fD6KQ",
  "text": "I don't know what caused me to think of reviewing this place now.  I joined Yelp several months ago, and dined here back in what must have been September 2007.  \n\nI guess that fact is I still remember this experience vividly.  \n\nEver stay at the MGM and have to spend an entire night vomiting in / sitting on the toilet in your hotel room?  Well, I have.  And the only thing I had to eat that day?  A hot dog and cheese fries from Nathan's at the MGM.  \n\nAll food poisoning aside, the food still tasted like shit.  I don't see how anyone has ever eaten one of those hot dogs and thought \"this tastes good!\".  Those are probably the same people eating at a McDonald's every day, and the ones that build the hype machine around Nathan's annual 4th of July cattle call on Coney Island.  \n\nAnd the employees that worked here were FAR less than enthused about their career path.  Out of the group of six people I was with, I was the only one to eat at Nathan's.  The rest of the group, all five of them, got their food before me.  I think it had something to do with the cheese sauce they put on my fries, which unbeknownst to me at the time, would likely be the cause of my food poisoning later.  Anyway, if I worked here I would seriously contemplate self immolation or starting up a promising career in the drug game (Las Vegas is a great place for drugs, I hear).  \n\nI guess the one positive out of this is my friends get to tell the story of me running for a trash can in hotel room and vomiting into it in the hallway, as our bathroom was being occupied by a female at the time.  That and I didn't vomit on my flight back to St. Louis the next day.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2011-09-21",
  "useful": 1,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "skbZO4vHHHA-ejA_BUwKjg",
  "review_id": "Q7qHTixINmgVZwNtDmRiXA",
  "text": "Hot dogs for breakfast??? HOT DOGS FOR BREAKFAST!!!\n\nI hadn't eaten at a Nathan's since Coney Island in '06, so I was understandably nostalgic. Grocery Nathan's on the grill taste delish, especially on sale, but it can't quite replicate the yum factor of getting the real thing.\n\nUnfortunately, the Vegas version isn't close to the real thing either, especially since they don't offer the vaunted \"onion sauce\" that makes a New York dog a NEW YORK DOG. (Don't worry, sauerkraut and dijon mustard still available)\n\n$5 for a single hot dog is highway robbery; 2 for $10 gets you fries on the side. Breakfast menu is available but you might as well get that at the MDonald's next door.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2012-11-14",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "6YAPZtzvMCAtqc6RIBKC2Q",
  "review_id": "NO25rr_ec6zbEG77gd_bPg",
  "text": "Beware of the chicken cheese steak! i should have known better than to order it since I am from Philly. Awful, didnt ev en eat it and tossed it. big huge gagging chunks of undercooked chicken. Makes you gag. absolutely terrible. fries were excellent! but was disaapointed to waste money on chicken cheesesteak, quite pricy.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2012-07-07",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "UA5-e4_EQ2T2ieKaq7c9jA",
  "review_id": "DYhzneUR3tWDyJiFAcW0yg",
  "text": "When I first tried Nathan's at New York, New York Hotel in Las Vegas as a midnight snack, I absolutely loved it!! Then the following year, we tried it at MGM Grand and it was a huge disappointment. It looked good but the dog had no snap to it!! And the bread fell apart, which is one of my pet peeves when it comes to a hot dog. A bun should never, ever break!!! \n\nOne positive thing? I ordered grilled onions (it's not on the menu so you have to ask) and they were the best part of my meal.\n\nMaybe I need to go back to NY-NY Hotel and try theirs again.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2010-09-25",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "DtajKETYfOtSsKJCD33SOw",
  "review_id": "7Le--zaNvoPhwITYugspIw",
  "text": "so we decide to grab a bite before the NYE craziness...I get a bacon, cheese hotdog...it was like $6.95 just for the dog...OMG r u serious? Totally not worth it...and the bf got the philly cheese steak and fries combo..it was totally dry and NG (not good)...we liked the environment at the MGM food court but Nathan's was a total bust here..not worth the $20+ we spent here...",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2010-01-01",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "DWuU0TAdLl4bYW5oCo2p9Q",
  "review_id": "Z65D7zF1d4Ulm0qnD_XTwA",
  "text": "Mediocre food that is very bland. For the price and quality, the cost is way off. Footlong chili cheese dog and onion rings will run you $20.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2015-08-25",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "Rdmv8UT5u-ZW0tOC-YP79Q",
  "review_id": "pcRQ9CHaSRqH7AgeiFf9UA",
  "text": "Tasty? Yes. Over-priced? WOW- by a ton!!! Two of us ate hot dogs and salads for $40! Way too much.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2011-04-26",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "XYPsgVwI_mngzYL6StH03g",
  "review_id": "JiXDKZV2pwzvEzx8mvXFrQ",
  "text": "So disappointing...  I was at the MGM Grand in Las Vegas over the weekend and made a trip to the food court.  It was right between breakfast/lunch switch.  I got in line for the breakfast waffle bar at Nathan's Hotdogs.  I was approached by what seemed to be a shift leader or manager in a white shirt.  She told me that she had to cut the breakfast line and that I could start a lunch line if I wanted lunch.  I totally understood, told her no worries and was first in the lunch line.  Several groups of people got behind me.  What happened next was very frustrating.  A young woman walked up and she didn't ask her to move.  I waited to make sure she was going to be served breakfast.  Once she was allowed to order a waffle I walked up to the manager and said that this was not right.  Myself along with 3 or 4 other people were refused breakfast but she let this woman order.  She then spoke to the other woman in Spanish, which I do not understand.  To add injury to insult they tried to tell me she phoned in an order.  Which was a lie; we all saw her order the waffle.  2 other people also started to complain that she too should have been turned away.  One gentleman asked to speak to her supervisor.  The supervisor just stood there like we were wasting his time.  After the gentleman explained this incident, the supervisor said Thank You, turned and walked in the back.   I have always been a Nathan's fan but myself and the customers that witnessed this behavior got out of line and  went to McDonald's next store and I vowed to never again purchase a Nathan's product if this is the way they value their customers.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2014-07-18",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "uHZxYHgjxhXY7PS6g2rFsA",
  "review_id": "KFNTva60aOYmvOj9bimR9A",
  "text": "Not the typical Nathan's quality and ridiculously overpriced. $28 for two people. No thanks.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2012-12-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "EXC3dft1PBkZDhigWm9eMg",
  "review_id": "L379ZIGh3RRG79t9VMaLCQ",
  "text": "Guys, if you're ordering anything other than hot dogs and fries, you're making a big mistake. This is Nathan's, homies - that original gangsta dog all the way from Coney Island, New York. Order what they specialize in, ignore the haters, and five-star these pimps. 'Nuff said.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 5,
  "date": "2016-05-05",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "Cb2wK7PP8-ttT8_TnL3fog",
  "review_id": "AV3ZojC6L9oNAzYdUYq4KQ",
  "text": "I ordered the foot long chili cheese dog. Terrible. Their food is normally not bad, but this one looked and tasted like it was made a few days earlier. I dont expect great food from nathans, but I also dont expect food that most places would have thrown away hours earlier",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2017-06-01",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "EWk_Be2aXp_kYTJSB-3S5w",
  "review_id": "90o95yxad_A841psOWLETQ",
  "text": "Ate at this place and was over charged. when i checked my receipt to see why i paid $18 for tenders and fries and noticed the register calculated my check incorrectly.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2013-10-01",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "XWsvSWFfLtqxlh6_J60OOw",
  "review_id": "QuOW5_ONpMob2YwPcEtvtw",
  "text": "Best Philly cheesesteak I ever had. Soo juicy and cook to perfection. The sandwich is pretty big and filling. I will definitely eat at Nathan's for Philly cheesesteaks.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 5,
  "date": "2017-07-05",
  "useful": 0,
  "cool": 0
}, {
  "funny": 10,
  "user_id": "lLfcbYGTeVxQN5Ig0ompJg",
  "review_id": "77t7ZTIJUQ25kMaAvvaFIw",
  "text": "Nathan's became a much needed stop before heading to the pool in the mornings. Not for a hot dog, but for breakfast sandwiches!\n\nWe stopped by on Thursday, July 11th & Friday, July 12th. Though we gravitated towards the familiar McDonald's for a sandwich, Nathan's line was shorter, so we decided to try them out.\n\nI got the Sausage, egg and cheese on an English muffin, add bacon the first morning. I figured they would just add bacon to the sandwich, but they gave me a good amount on the side. I think like 5 strips. I believe it was an extra $2 to add bacon, so the amount justified the cost. The second morning, I got the same sandwich without adding bacon. I believe the sandwich was over $5, but less than $6. I can't really remember as I didn't document any of these meals. Both days, the sandwiches hit the spot! I liked that the cheese was melted on the egg and not all over the muffin as I could just eat the inside of the sandwich if I wasn't super hungry.\n\nNathan's offered a great alternative to McDonald's sausage egg mcmuffin. Plus, we didn't have to wait in their ridiculously long line!",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2015-07-22",
  "useful": 10,
  "cool": 10
}, {
  "funny": 0,
  "user_id": "3YK7REruC4FwDTOj8zUYcQ",
  "review_id": "XvZO-vg42GG6RbXgk_2Tlg",
  "text": "I dont know which address is the one at the Las Vegas Hilton off the strip, outside the convention center, thats the one I am reviewing.\n\nOne word: pukey\nCannot understand the rave about their hot dogs and \"the snap\" what snap? The one were your stomach tells you to stop putting this toxic dump of a dog inside it? \nFirst, no matter what item I get from here, its cold or lukewarm. Their dogs suck, I buy he-blew internationals that taste 1000 times better at costcos. Hell costcos dogs are as good, or bad.\nI ordered crispy chicken sandwich to change things up a bit, my goodness it was worse than anything I have eaten, tempurate, quality, taste, and appearance wise\nSure their small wavy cut thumb fries look cute and are somewhat edible, but this whole establishment sucks ass.\nWhen you are at a trade show and can't decide what to get from this mini-food court, do NOT get this crap, move 10 spaces to the left and get sbarros pizza (not that that will be getting a michelin star anytime soon but compared to this it's gourmet)\nP.s. And shit aint cheap yet gross!!!!",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2011-09-08",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "VYOQLKuR0Ugy9lU-QiOuLw",
  "review_id": "TU6jGXNm_J3yhIkXzVCrRw",
  "text": "Too expensive here...\n\n$9 for hot dog and fries?!\n$12 for philly cheesesteak and fries.\n\nEverything tastes good but nothing over the top great.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2011-06-05",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "0q4dBp-rDyJBIbqzBIlNGw",
  "review_id": "TzQLe41pB06kN4JXkcyHdQ",
  "text": "Decent hot dogs",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2011-03-07",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "4fkAp87rGJdfQXY5IBMtXQ",
  "review_id": "ND08b_Glz3Fxwjc0q9H6oA",
  "text": "Philly cheesesteak: overcooked and flavourless, overall it was dry and a little disappointing. I love a good philly, and this was not that",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2015-10-01",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "bN25cOkFDluT1NjMNkWqAQ",
  "review_id": "yLX-d9a2IxFX2ARDR8aVWA",
  "text": "I got the Philly Cheese steak.  It was pretty greasy.  It was alright.  Definitely not good hangover food.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2015-08-03",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "MMXwhTMpy9W7rvpltcZglg",
  "review_id": "29M8q1iOIeF_TTeURJ71xg",
  "text": "Located inside the MGM food court, had this as a convenience stop more then anything. Basically had a meal from every restaurant just to have a variety...and yes, I do eat a lot. \n\nI had the Chili Cheese Dog and the Bacon Dog. I'm not sure if it was just this location, but the dogs themselves were a bit on the salty side. Good enough to eat though, I guess the saving grace were the toppings and the bun. I've had a lot better hot dogs, but if you were craving a hot dog and are in the MGM, then this is what you would want.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2014-07-02",
  "useful": 0,
  "cool": 0
}, {
  "funny": 3,
  "user_id": "nzsv-p1O8gCfP3XijfQrIw",
  "review_id": "yOfs4lqPRx4Mn9uAHffb7g",
  "text": "I've had Nathan's dogs at Coney Island and that was yonks ago. I don't think I'll be going back out there anytime soon so in the meantime, these dogs will have to do.\n\nWe've come back here several times to get snacks whether it be an early or a late snack there is always a line at this location. I guess if you're staying in the hotel then it just makes sense to go to this place.\n\nI agree that the buns aren't so great and if the dogs were thicker it would be even better. However, nothing comes close to the snap of the Nathan's hot dogs and even though most of the time I try to resist these dogs so I can eat somewhere else, I end up having a bite or two of the dog. Their fries are seriously addictive, but I must say, it's damn expensive for what you get.\n\n3.5 stars",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2007-12-28",
  "useful": 3,
  "cool": 4
}, {
  "funny": 0,
  "user_id": "uUmJsYzdXukkZLmbmfYW_w",
  "review_id": "94LhEp7wMPX-DGJGTiUhNQ",
  "text": "I read a few of the reviews and it surprised me that hardly anyone got JUST a hotdog. There is literally nothing wrong with these hotdogs, they have a natural casing and come with most of the hotdog necessities (sauerkraut, relish and onions). Don't come for anything but, is my advice and you'll be ok!",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2016-02-16",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "SjlOVEa7uj5an6kroRYuJg",
  "review_id": "kxBZPplMVtObBU-aY4e0MA",
  "text": "Best inexpensive breakfast so far at the MGM\nOrdered Scrambled eggs & bacon with a side of sausage, coffee and no toast. Eggs were moist & fluffy and I loved that they added country gravy on top of my eggs without charging extra. Nice! Gravy great flavor, the bacon I prefer crispy and it wasn't but was still warm and good. Sausage was hot and had good flavor. Preparation area seamed clean, servers were friendly and attentive to what you wanted. Note, they have hot sauce if you need it. Fourth day at MGM best breakfast so far, two more days and two more places to try.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 5,
  "date": "2016-11-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "XeFRfwBV14TDQtbwc7D4ag",
  "review_id": "dzaxCQL06RyX6pv4obXMHQ",
  "text": "The hotdog tastes pretty good. Love their fried onion ring.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2013-04-16",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "NwcGBiMFusgKzjq9By1ndw",
  "review_id": "RibWPWOqcoN3o7GYilOgow",
  "text": "I should have looked at the review stars before I ordered. Horrible! Cold mushy fries. Waste of money and I ended up throwing them away.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2014-01-10",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "He_WqjEl5iUYyiE6EJrd7w",
  "review_id": "bp1kXERtmkdRcaiIg0HXEA",
  "text": "Overrated. Dogs were small and overpriced. Also they used cheese whiz on the dogs.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2008-07-15",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "vL3MlgFxow2juEZn0SvKlA",
  "review_id": "3ThS-qv5kuh1sDhtPYZAUg",
  "text": "woke up late and i really want a quick breakfast and got a really bad service and equally lousy food at nathan's in the las vegas strip food court.  i have to say \"i want 2 waffles\" 4 times before the bilingual server got my order correctly. my coffee didn't show up on my tray, and the bilingual cashier told me she didn't get the coffee order. in my frustration i  went to starbucks accross the stall to get my fix instead of reordering nathan's coffee. the food is equally bad. the waffle is soggy, the bacon is hard, and the biscuit didn't come with butter or jam. i should have gone to mcdonald's, 2 stalls away for half the price.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2011-05-06",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "BH_TTlQie1ucGJP-g3XUWQ",
  "review_id": "TUt3Dysvy0do6dwCJdSkAA",
  "text": "No ice in the soda fountain. Pizza took 20min to get; it cost $20 and was the same size and tasted like a $5 Little Caesar pizza.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2010-07-29",
  "useful": 0,
  "cool": 0
}, {
  "funny": 2,
  "user_id": "Cc1nCwhvA7UxsRnBE-FLCQ",
  "review_id": "h0TudJ109zq3EcbiRdfvgQ",
  "text": "Does anybody know what fries taste like?!  This place sucked ASS!!!  Before I go on, I like Weinershnietzel, Hot dog on a Stick and damn Costco dogs...I'm not a picky eater.  But this hot dog place SUCKED ASS!!! I can't express this enough.\n\nI ordered a chili cheese dog, w/ cheese fries and bacon.  I got a plain hot dog, a bacon hot dog, w/ cheese fries... ?? okay.  That's fine, it was probably a long night for them; the lady in front of us sweared she handed them a $20, and the cashier gave her  $1 in change, who knows the customer seemed shady herself...ANYWAYS....they corrected my order and now we're good again...\n\nIt tasted like they cooked the fries in a month old oil for 14 hours; the fries we're horrible!!  Let me remind you I'm not picky, it was just that bad!  The hot dog, the runny cheese even the bacon!  I thought I could just pick off the bacon but that too was apparently fried in the same vat. So much for a quick bite to eat.  I've never been able to make myself throw up, and that day I WISHED I was bulimic. Gross.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2008-03-14",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "soXCrtlQ3_z_kBC7OrT-_Q",
  "review_id": "m0u9l34sqtsHjC53mIzB4A",
  "text": "We had a coupon for a buy one, get one free hot dog.\nSo, my boyfriend got two chili dogs with everything on it. One chili dog is $11.45 plus tax. He's never had Nathan's hot dogs before, and he quite enjoyed them. He had been talking about hot dogs all vacation.\nOf course, they aren't as good as Pink's hot dogs (on La Brea in Los Angeles, CA). If you haven't had those, it's totally worth the long wait in line.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2014-04-19",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "RWhsNzyE1EvB8DYsqWIX9g",
  "review_id": "PsmuC1guygy44RuQGZeYUw",
  "text": "Tried it while wandering around late at night after hearing all the hype. Plain and simple it's a hot dog all be it an expensive damn hotdog. Chili tasted like it came from a can and the hotdogs were a little over cooked. 40 bucks later I can now say I've had a Nathan's famous hotdog.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2014-06-28",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "c5x707w3UKiVIt3OgpU8fw",
  "review_id": "V3tOTcWGMdrlLO00njOztA",
  "text": "$12 chicken sandwich and fries. I felt like I'll wasted $12 on a snack that wasn't that great.  Why can't In N Out be inside the casinos??",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2014-01-16",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "B0ENvYKQdNNr1Izd2r-BAA",
  "review_id": "bY-rEAHa3W47-H-vJmkAWQ",
  "text": "Got a regular hot dog and chili cheese fries, it hit the spot. I wasn't expecting much from a hot dog stand, but they delivered. Chili cheese fries were the bomb.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2015-01-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 18,
  "user_id": "NBJVYt7sO-2WDg3bPwBT0Q",
  "review_id": "MR0AVtINtIDD8cUiQqqA6w",
  "text": "So this Nathan's is in the foodcourt at the MGM, which shares the space with a Panda Express-like Chinese food place, a McDonald's, and a Pizza place.  It's actually an interesting place for a foodcourt, considering Craftsteak and SeaBlue (by Michael Mina) are practically right next door.\n\nI got the 2 hot dog and fries combo for $8.95.  The staff seemed friendly enough.  I didn't have any problems.\n\nThe hot dogs are just.  I guess you can say it's like how people go gaga over Pink's for no good reason because let's face it, Pink's isn't even really that good.  You go really only for the experience of eating at a Los Angeles institution.  I feel the same way with Nathan's.  It's such a historic New York tradition that when someone says \"I want to go try Nathan's\" not because it's THAT good, but because it's a cultural experience.  That's my two cents anyway.\n\nI would however have to say that the hotdog skin has nice pop.  You know what I mean?  No?  Amateurs....\n\nI probably wouldn't come back though.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2009-09-13",
  "useful": 20,
  "cool": 19
}, {
  "funny": 0,
  "user_id": "MpVoHga5M5msFXe9nkg7zA",
  "review_id": "9t9cmRDZeMcZVF_HJ1-kVA",
  "text": "This is definitely the worst Nathan's place ever.  The hot dog was so disgusting and the fries were soggy, greasy and ridiculously huge. The workers were in a bad mood.  And they didn't even say thank you at all.  Not even a fake smile.   Nothing!!!!! \nI do not recommend this place at all. I knew the price would be high. But the quality was the worst.  Costco hotdogs are way better.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2017-09-19",
  "useful": 0,
  "cool": 0
}, {
  "funny": 2,
  "user_id": "CdKvRVLHbX3pokKhj96X0w",
  "review_id": "4WJxsyNx-8N6EbUrfDk6nQ",
  "text": "Despite nothing wrong with this location, I don't really know why anyone would stop by here unless you are about to hit the MGM pool and want something quick and fast.\n\nWhy do I choose to keep coming here?  Mainly because the line is not too long and the food comes out fairly quick. Located in the busy MGM food court, Nathan's Famous is one of the chains that can be frequently found throughout the Las Vegas strip.  With other viable options here, the food here is simply not up to snuff to warrant the high cost of the mediocre product that comes out.  \n\nHere is what I have ordered:\nChargrilled Chicken Sandwich- Everytime I have ordered this the chicken has been lukewarm and underseasoned.  I also found the bun preparation inconsistent.  Sometimes it came out a little warm and other times there was a char on the bottom.  I say go for this item if you must get something with chicken, but it has never been fully satisfying.\n\nSausage, egg, and cheese sandwich - An okay breakfast sandwich.  I did enjoy that the English muffin was toasted nice to get that nice crunch and the cheese melted nice and evenly with the egg.  However, the size was on the smaller side making it not very satisfying.\n\nPerhaps because I have not actually ordered the hot dogs which Nathan's is well known for I am not giving them a fair assessment of their product.  However, I do believe if you are not able to produce a similar quality product on your other items you are better off not serving the item.\n\nOverall, the food here at Nathan's is nothing to be excited about and definitely should not be your go to place at the MGM food court which already has so many other options.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2015-09-03",
  "useful": 3,
  "cool": 3
}, {
  "funny": 2,
  "user_id": "t0VpajjP2VgCwja0Bcr2yw",
  "review_id": "H6P9gY9yIIShT4tCP3gVsQ",
  "text": "This review is only on the philly cheese steak at Nathan's at the MGM Grand Food Court.  It was a good meal - sandwich, fries, and soft drink for about $11...  I was pretty darn hungry and could barely finish this meal.  You could probably split the meal with someone else, and still be very satisfied by paying $5 bucks for half of the sandwich.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2009-01-20",
  "useful": 3,
  "cool": 2
}, {
  "funny": 0,
  "user_id": "x-A-PU52L4ru0ttqW-Nhtw",
  "review_id": "W9uys4raNy6aoITTCbwbeQ",
  "text": "I have always wanted to try Nathan's hot dogs after watching them on TV......\n\nBoy did I regret wasting my money here. Super salty and ridiculously overpriced for 1 hotdog.\n\nWould have been better off eating at McDonalds next door if you want something to eat.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2013-01-31",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "rcqC7AtTO9vuptVKRXrVnA",
  "review_id": "F5LItelJyblMJenTdqY-nQ",
  "text": "It is what it is. Good Hotdog  add kraut and onions. Nothing to complain about. And then there's the fries.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 5,
  "date": "2014-10-13",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "kHupEzJ5QdaNvg2Myj4KpQ",
  "review_id": "WWiJx7WnDejmuWk2F5sMRw",
  "text": "Nathan's hot dogs outside of Coney Island is a different story than the original.  I stopped by for a dog yesterday and the most annoying thing happened. You know when the bottom of the bun rips?  Yeah, both dogs had that problem which means that the buns we not so fresh.  I find the Nathan's across the street at NYNY to be much better on a previous trip.  But none comes close to the original location.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2007-11-09",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "dkEFGj-2V4Rgf6AQBlO6TA",
  "review_id": "1a4T4NX7_T522h0wskIUhA",
  "text": "It was barely ok. Staff were nice. Food had very little flavor. I never add salt to my food, today I had to. The ranch dressing was good. I gave it 3 stars because it's clean",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2017-08-09",
  "useful": 0,
  "cool": 0
}, {
  "funny": 2,
  "user_id": "1dwa6Wkp0chKBcrRuO05lA",
  "review_id": "DHh0W_yLtCJfFb10Tm2mVg",
  "text": "I had the \"famous\" hot dog at the MGM and NYNY, they booth sucked ass. We had coupons for free hot dogs and we supposedly got the normal \"$6\" hot dog, what the hell? It tasted like shit free I can only imagine how mad I would have gotten if I had actually payed for that, slip it... it is NOT a cheap it for the strip, if you really want cheap and decently good hot dogs visit Bill's and go to the cart that is located at the Sports book.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2009-01-02",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "Sh0DLlZ2a1A49A21S5cF_Q",
  "review_id": "2mHPoYTLATTTCet7QU8xIA",
  "text": "Nathan's hot dogs have a nice pop when you bite into them.  It was the best tasting thing i had all day partially because I hadn't eaten anything since i got off work and made the 7 drive from LA to Vegas during a Friday evening commute.  the fries were pretty terrible though, if i'm ever craving a NY Nathan's hot dog AND fries at the same time, i'd probably go to McD's next door for fries and Nathan's for the hot dog.  also, it was pretty pricey for a meal combo, about 12 bucks and that didnt even include a drink",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2009-10-25",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "RQR-bncvVssevK_WIPWvCA",
  "review_id": "BuxyLVb_7R50QW6wJZAhqw",
  "text": "I think if I had to pick between overpriced Nathan's and overpriced Bonanno's, Bonanno's wins. I couldn't go to McDonald's next door out of principle, but I was sorely tempted.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2011-09-12",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "EdbeBDYmDR2txDvEZS5-kA",
  "review_id": "I2GOPLypnRUf7kM7cDp6GA",
  "text": "This review is for their breakfast only. We ordered our breakfast from here two days in a row because we loved their pancakes and applewood smoked bacon. In addition to Alicia's friendly service...she was absolutely courteous and polite. She really made us feel welcome. Other ladies were great too! A very friendly group! We will be back possibly tomorrow!!!",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2015-06-25",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "AI6aqgey7mTJdy7XJQ8wOA",
  "review_id": "8egqeZEw1RNMvO3UTT9Zfw",
  "text": "Stopped for a quick breakfast.  Reasonable prices.  Had the scrambled eggs, came with potatoes and toast. Added 2 sausage links. Good food, very filling.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2017-03-16",
  "useful": 0,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "k8_7nhvb-7nziGiHWvg35w",
  "review_id": "WLT4ELLhWOmDx-u8-a4Tkw",
  "text": "Stopped in for a quick bite for lunch and this was the only place serving something other than breakfast.  Now I'm wishing I gone for breakfast instead.  The chili was from a can, the cheese was  flavorless canned cheese and the hotdog casing was weirdly tough. It was almost like a thin layer of plastic.  Weird & gross.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2015-11-15",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "-hDRLqC8VqceLEXQbvrAIA",
  "review_id": "PMPnhWIcvb0l_rPYkaSr1w",
  "text": "My wife and I got off the MGM Grand Monorail and decided to eat at the casino. We didn't want to spend too much money, so we decided to check out the food court. For me reason, I felt like Nathan's after we have eaten at the Venetian location the night before. I ordered the 2 Nathan Hot Dogs and Fries for $9.99. If you know how expensive this place is, you'd understand that this is actually a great deal. For some odd reason, the hot dogs did not have that snap that I was used to. I was also quite disappointed with the quality of fries; they were soggy. The quality of the food is supposed to be consistent at all Nathan's chains. The MGM Grand's location has failed that tremendously. Oh well. We'll see what happens when Nathan's reopens at New York New York.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2008-05-19",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "ZRnsUs9q6DbeJbOLjCY4ZA",
  "review_id": "TeHDWjIbYOLp9UsisPaxSg",
  "text": "Stopped by today for Philly sandwich and split for 2 of us. Real good sandwich and just right portion to split in half, which they did. Busy today but did not take long. I would return.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2015-12-04",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "qli_qsPTW-N6tymtUNpUrA",
  "review_id": "RI46TI6_WcOfb5M710thrQ",
  "text": "i'd eat just about anything late night after drinking, but 1/3 way through my chicken cheesesteak i realized that it was kinda gross and i should prob cut my losses.\nboyfriend got a regular cheesesteak and felt similarly.\nthe bread was dry, meat was greasy and just not fresh tasting.  there wasn't enough ketchup in the mgm grand to save this.\n\ni will say however, the fries meet the nathan's standard so if you need some salty, fried crunchiness late night, i'd hit them up for fries only.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2014-11-04",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "IBUQnMtXDYR2T_0oaIRV6A",
  "review_id": "ewWCWT40ozJ3olkYvmnXRA",
  "text": "Nothing spectacular. I think I've made better hot dogs at home..",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2011-09-23",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "jkn8iwKwXPXVtNwiFALZBA",
  "review_id": "lZlmhhfQSLbyw-jy4TGVTA",
  "text": "I was excited to see this when my boyfriend and I were walking through the hotel. I love Nathan's hot dogs! We decided to just get a normal hot dog with onions, hot dogs were good but the bun had a VERY strange taste, I mean really weird.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2016-09-24",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "4xgbVGM9yklvk8zrOf7tiA",
  "review_id": "JgKP1ZE787pSZ9tPz_jUwg",
  "text": "Good taste... always trustworthy on cleanliness... but DANG! Why you gotta be the stingiest place I've been to with the meats. Philly places usually STACK their sandwiches with the contents inside. I could physically close my sandwich into a complete fold without you seeing any of the contents inside. That's a problem. \n\nI like you. I do. So stop trying to be so unlikable. Have you ever had that ex that you enjoyed but they were just TRYING to get broken up with? That's what this feels like. Make the people happy. Put a little bit of food inside of that bread. It's not going to break the bank THAT much giving maybe even a single ounce more of meat for example. But that's just me and my opinion for a guy paying $13 for a fast food Philly. Just saying.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2017-03-03",
  "useful": 0,
  "cool": 0
}, {
  "funny": 1,
  "user_id": "SBDQBj2VEE9fbZfaQLeT_g",
  "review_id": "p760MX8De4B_YL43Oe7JRQ",
  "text": "I was in Las Vegas for a personal business trip and needed something quick, easy, and fast. The MGM Grand food court offered four to five different places to eat and I chose Nathan's Famous Hot Dogs.\n\nI ordered the Combo - two standard Nathan's Famous Hot Dogs, fries, and a drink.  It came out to almost $12....WOW....expensive for simple hot dogs, but it was decent filler food.  I actually thought the prices are actually reasonable due to the close proximity to the MGM Grand Convention Center and of course the area is a tourist trap.\n\nThree stars is a decent rating for what I needed this restaurant for...maybe this review is more for the MGM Grand Food Court for the convenience to the convention attendees like myself.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2009-02-18",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "bULBMkGqXU2xjFuPL-3JgQ",
  "review_id": "pDjAxCSxsbupaJF0WTQtvw",
  "text": "Over hyped and over priced! $5.95+tax=$6.43 for a little teeny weeny chili dog?! Come on its just a hotdog! No wonder those hotdog eating contestants can eat so much of these!",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2011-09-15",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "e03iPZLuSJ5_3LY4TOp2iQ",
  "review_id": "ufDWfX_bDPXUZYbVF_Cnqg",
  "text": "This seems to be as close as I can get to an original Nathan's dog lately since it's been a while since I've been back out east.  Still, whenever I stay at the MGM, I tend to find myself here at least once scarfing down a dog.\n\nCan't really complain too much about the food court stand.  Everything for the most part is cooked when you order it.  The fries and rings are always hot and crispy.  The Cheese-steaks are decent as well.  Still tastes a bit off from what I remember back east, however it still provides the same artery clogging affects.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2008-02-04",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "rKkpHJkJ27xOwnhy_bMkvA",
  "review_id": "P1aA1IGDwqNCUmMKUM1VEA",
  "text": "I refused to give my business to this establishment a few years back when I repeatedly received VERY poor customer service (I know it's \"fast food,\" but the McDonald's next door is 10x better).  They have messed up my order or completely FORGOTTEN to make my order many times.  Really disappointing.\n\nWell, for some reason tonight I decided to give it another try.  The cashier was semi-friendly, took my order and gave me the little vibrating number holder.  I ordered the chicken finger platter....I know that they make these fresh, but it took a looooong time.  Other customers came and went with their food and I still stood there, waiting.  Finally, after 15 minutes, they were ready.  I ordered (and paid for) a side of the cheese sauce, along with hot sauce and ranch.  None of that was in my bag when she gave me my order.  When I asked for them, she made a loud sigh and proceeded to get the items I requested.\n\nThe food itself was good and fresh.  The chicken fingers were crispy and light and the fries were good as well.\n\nI am borderline 3 stars for this place.  Unfortunately, the prices are enough to bring me back to 2 stars.  I understand that it's the strip, but the McDonald's next door has similar prices to what you would find anywhere.  $11.95 for a chicken caesar salad is a bit ridiculous.  And if they were nice, I could even look past that....But rudeness and lack of attention to detail will bump you down every time.  Sorry 'bout it!",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2012-08-01",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "t22nHNFyjAsOd4ZEHA5EiA",
  "review_id": "VsHxRx7YyjvnmOOgFPRa8w",
  "text": "I think the 2.5 star rating for this place is a bit unfair. I thought it was decently good. I ordered the classic hot dog with sauerkraut and grilled onions. I thought it was a very good hot dog. The service isn't always the fastest, but that can be expected for a busy place like the MGM food court. Also, $6 is a bit pricey for a hot dog, but again it's the MGM food court. All things considered, it's not a bad option.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2016-04-10",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "P0pFmBdgsP4_ceJuRaMbBA",
  "review_id": "l2b0sAnicujfDEgYa62cVQ",
  "text": "We wanted something \"light\" for dinner.  With 5 fast food restaurants in the food court there wasn't a large selection to have a lighter meal.  So we had salads at Nathan's.  Given that Nathan's is a hot dog joint, the salads were surprisingly good and hit the spot.\n\nThe process is to order then they give you a buzzer for when your food is ready.  I guess it comes in handy if it gets really crowded but it wasn't so that seemed like a waste of time.\n\nThe bacon cheese fries were also good (OK, so I didn't entirely go light) but the bacon was overly smokey tasting.  Next time it will be cheese only.\n\nOverall not a bad choice given the selection of restaurants in the food court.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2010-03-14",
  "useful": 0,
  "cool": 0
}, {
  "funny": 5,
  "user_id": "i7NVUz1pke7c45uvzzyRfA",
  "review_id": "hTC8tVTu8rLaAuJTf_FqUQ",
  "text": "I was desperately hungry. I regret ordering the breakfast platter from this place. For $15 I got:\n\nA plate filled with eggs\n2 pieces of bacon\n1 biscuit\nGravy\n1 Hashbrown\n\nThey were all greasy and flavorless.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2012-07-29",
  "useful": 4,
  "cool": 3
}, {
  "funny": 1,
  "user_id": "B-UIuLaVBpixJYyWn4nIFg",
  "review_id": "RHG6ht5dC3j5yjJpF0w23w",
  "text": "Tried Nathan's after leaving wet republic. I tried the Philly cheesesteak with bacon. It was everything I was hoping it to be specially after hours of partying hahah. \n\nIt was a huge portion with tons of meat mixed with sautéed onions, green peppers, mushrooms and of course plenty of fatty bacon. \n\nThe bread was lightly toasted with butter and it was crispy from the outside and nice and fluffy from the inside. \n\nYou can get the nacho cheese included or as I prefer on the side. It's about $12-15 per person including a drink. Next time I will be trying the famous hot dogs hopefully there good too.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2014-05-06",
  "useful": 2,
  "cool": 2
}, {
  "funny": 3,
  "user_id": "r3Gw9EjLT6BT9xD9evpwEw",
  "review_id": "xKBqpZiO6j0H4qVGdTaSwQ",
  "text": "I was drunk, I was hungry, and a dog sounded good.\n\nit was alright. \n\nI honestly can't imagine eating 68 of these things in a Competitive eating contest. 2 was enough. \n\n*puke*",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2009-09-26",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "B9aFhdLhM-1fn1A-mapGYA",
  "review_id": "-DnYsL_lMYsiYVRUMG1Pqw",
  "text": "Coming out of the MGM pool we decided to drop by and grab a dog.  This place was horrible.  It took almost 20 minutes to get three hot dogs and a fries (no that's not all for me...).  The buzzer thingies didn't even match the recipes!  While we were standing there, there was a couple that said they had been waiting for almost 30 minutes and one of the workers gave their food to someone else.  If I knew it took that long to get fast food, I woulda called ahead for reservations.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2008-09-04",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "sgoOp-mPQIkVRc5o7xrSpQ",
  "review_id": "cz7n7bSn5BCOnuPGchuvxw",
  "text": "Ordered the philly and the worst I've tasted. At Vegas the price is over inflated. With tax it's 15.13.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2017-07-17",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "KlMyEZKf_WWAVZ-_PYffaQ",
  "review_id": "8VbkGPzfHsOHjVeLOOZ5eg",
  "text": "Not the place you thought you would find in a well known spot like the MGM Grand, first lets just say the food is eatable cause half the people who will eat here is either drunk or too poor to eat elsewhere. That said the price at Nathan's is not cheap,  it pars at the same price at a concession stand at an event center if not higher. I had the foot long chilli dog, (get your mind out of the gutter). And chiili fries. My drink was over filled with ice took 4 zips and hello? Where is my soda? Chilli fries was delicious and the foot long was not warm. there are other choices at roughly the same pricing move on.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 2,
  "date": "2016-08-08",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "dMRvVUdoiBx0Jf3bgZvm3Q",
  "review_id": "KMtS-ql5xOmlP2HYHb2Cgg",
  "text": "One of the girls in our group needed a quick bite and none of the restaurants were open so we grabbed a couple chili dogs and an order of chili fries to soak up the alcohol. \nOur order was $30 and the most disgusting fast food I've ever had. How does chili have NO flavor? The dog was dry and flavorless. The fries were soggy and again FLAVORLESS!! I know they can get premium $'s in a hotel but at least sell a better product. Nathan's is famous? Really?\nMust be a boardwalk thing - gross",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 1,
  "date": "2013-12-11",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "WrOGwNFouiqAb7f9C1j8jQ",
  "review_id": "oxyJ6Dg8ucX_9o_Ho3zWHA",
  "text": "Large waffle, soft and not crispy, and an optional bacon side. Simple fair and a slight step above Mc D's. No real complaints here. Only grab food from here if you're on a budget and if you are, why are you staying at MGM and gambling?\n\n3 stars for decent food given that it is fast food. Breakfast ends at 11 or so. Seating is food court style.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 3,
  "date": "2013-06-15",
  "useful": 3,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "WyvvWRCCHizctkFdGWz72A",
  "review_id": "FMR6NgU1oNqaNuCt5j9iCw",
  "text": "One of my favorite places at the food court at the MGM Grand.  This is fast food:  Nothing fancy and the people behind the counter don't give a shit about you so you have to speak up when you order.  That's really the bottom line.  I had the sausage, egg and cheese muffin two mornings in a row along with a hashbrown.  Other than trying to hustle drinks on you, I'd say this is a really good place to eat.  Your other choices are McDonald's (for the price conscience), or the pizza place.  I forgot the other place to the left of Nathan's.  This is a great place for breakfast.  However, looking at all the other reviews, you probably want to pass for all the other meals.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2013-05-08",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "a9-HrWEepagqmJOPvxFTdg",
  "review_id": "igVYOHIL54DTYOjKu_AvsQ",
  "text": "So, I've never had authentic Nathan's and, based on reviews, wish I'd had the opportunity to try it before this Vegas excursion. But if you just want a chili cheese fry and a hot dog with relish, ketchup, mustard and onions, Nathan's at MGM is sufficient. The food was fast food good. But they did mess up the order which should have added chili and cheese to the dogs.  Mind you, I'm a burger and fry freak who does triathlons at the Iron distance so I don't take my cheat meals lightly. And I was more than happy to gobble down this hot mess before moving on to the next adventure.",
  "business_id": "k1PkpDm5d5pYJI1K_3UYpw",
  "stars": 4,
  "date": "2015-08-23",
  "useful": 0,
  "cool": 0
}]
