[{"funny": 0, "user_id": "YIMeEHUYm69m-Mqf-NjPHw", "review_id": "5iNtrqJSJgaflbp5ABtn_A", "text": "A solid traditional donut shop.\nDon't look for s'mores donuts or cronuts or balsamic fig creations here, they stick with the classics and do a good job. Selection is not huge, and the only thing I've seen out of the 'originals' genre was fried apple burritos (making a note to get one next time!). So far I've only tried the blueberry and the old fashioned, but they were both delicious: light and cakey, not too crumbly.\nAs others have mentioned, Donut Tyme is 24 hours, so don't fret about getting a maple long john in the afternoon or late at night.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2016-01-11", "useful": 1, "cool": 1}, {"funny": 1, "user_id": "yw7vWx_La4-XbVZXt7ubBQ", "review_id": "O7qz8x90rAA74Gdv8w50KQ", "text": "LooooOooove Donut Tyme. They have traditional donuts and my FAVES are their fresh donut holes!!!!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-03-23", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "M2ywRTY1UYTiJEDp2x14yQ", "review_id": "Muw_brU9WfliOL0GVAjVGQ", "text": "This place used to be the best donuts in town but they changed their recipe.  I go to Winchell's now.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 3, "date": "2015-11-08", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "Ii7GTLNo-Uhx3meHBaBTGw", "review_id": "yH5GQqtcC3i3xl3WEbtkig", "text": "By far the best donuts in Las Vegas! Always fresh no matter what time day or night (which you can do because they're always open)!!\nIs it the most appealing on the outside, no, that's because it's in the hood, but the donuts and hard workers and their customer service is what makes this place great!!!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-08-05", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "R7mPYLXWIxVUwsdO10xzXw", "review_id": "AFBwBy6EnqZyBGFJojC5Gg", "text": "Some of the best donuts in Las Vegas, especially in the Eastside. Pretty inexpensive for good quality service, a dozen for about $8.99.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-02-17", "useful": 0, "cool": 1}, {"funny": 1, "user_id": "XtHLD11D1qvqPmUTDGclhA", "review_id": "KNqOtbi6rZr7kITs2LdzNQ", "text": "Favorite spot since I was kid. Always friendly and yummy! Probably one of the few great places for food on the east side!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2014-07-31", "useful": 2, "cool": 1}, {"funny": 0, "user_id": "97qEu_8WUPsAvpOINUvoEA", "review_id": "aAEC06zpEWALWWv56pGhbQ", "text": "I love donuts and this happy little store on Charleston is the closest shop to my house. And whenever i want a donut, i want it as soon as possible. Donut Tyme is open 24 hours! which is a plus for me. I love their Cinnamon Rolls and their plain donuts with blueberries in it.\n\nThe dozen is 8 or 9 dollars and usually when i go they add 1 or 2 extra glazed donuts in there which is quite nice, and for 8 or 9 dollars, that's a great deal! Everytime i walk in, i'm greeted and the place is very clean. Though sometimes the workers don't wear gloves or have a hair net or a hat, and there's no screen or window for the doughnuts so for me i have to take a star off.  I like a clean store with some sort of barrier for their foods and a bit of health regulation in the front. Looking in the back i do see gloves and cleanliness so good job!!\n\nOverall i do like this place for my doughnuts. Fresh made, tasty doughnuts, good customer service, clean store, price is just right. \n\nThough wish something were covering those doughnuts, as flies and dust may get on them, and for someone with no hair net or hat risking the chance to have hair fall out and into the doughnuts, is a no.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2013-08-19", "useful": 0, "cool": 0}, {"funny": 2, "user_id": "YTDM5iqsTFIyi1oUBhE1aA", "review_id": "1BLqjQvG4YsWihhQ74e-mw", "text": "As far as donut (or doughnut, depending on how official you wanna get) places go, this one is alright. I like the fact that it's local and with the decor, I feel like I'm stepping back into the 70's, when the donut was KING. \n\nI like the fact that it is open 24 hours. I do not like the fact it is on my way home coming back from the gym. With that being said, I do not hold it against Donut Time for being on Charleston. I blame my incessant craving and weakness for cakes, coffee, and sushi. Anything that falls into one of those categories is like kryptonite for me! \nNeedless to say, it's hard for me to pass by without stopping!\n\nWhen I finally did give in, I was glad for it. 'Cuz MAN, this place has some really good plain glazed donuts. And they're huge! I just wish they they had more of a selection. They seemed to only have the typical stuff like glazed, chocolate covered (but no chocolate glazed. Weird), crullers, coconut, and nut crumble covered, and custard-filled. No blueberry glazed, no cream filled, no strawberry glazed.\nMaybe it was because I went there at 12 or 1am, not sure.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 3, "date": "2013-01-06", "useful": 2, "cool": 2}, {"funny": 0, "user_id": "K-vSXUJTEmb6dyMwbImfOQ", "review_id": "_71Bl2BU-yFRy8ZX_13_Vg", "text": "I've been going to this place since I was in high school roughly 25 years. The donuts here were amazing. This batch I just got were terrible! The two we enjoyed were the apple fritters and glazed. The cake donuts so so dry and all you could taste was oil. Definitely need to find a new donut place after this. Was very disappointed", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 2, "date": "2016-12-26", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "6LzS8Mdtga0gY-Fd3V7vhQ", "review_id": "mQj92FUKgnIm2fz9RlTznw", "text": "Donuttyme is the best donut for me,any time and anywhere.. the chocolate cake style is my favorite.. and the owner super cool", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-08-14", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "N2viBiauX4siILKsCCBQ-A", "review_id": "OUwYTR0yhlSNzTtjewcdBA", "text": "I just simply love this place! Never once had a bad experience or donut from them! At the end of the day, I love me some donuts and this hits the spot for me! And of course, as previously mentioned, being 24hrs never hurts. After all, it's Vegas baby!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-03-25", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "63pbW-tt6gbCtb317XbvUg", "review_id": "MHdtswyt-dZPS3UFFcmoGw", "text": "Really yummy donuts! They were soft and pillowy. Drove there at midnight and the place was still open. We got half a dozen sugar covered donuts and they were out of this world! Very airy and soft and not too sweet. Delicious!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-12-04", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "W6r9qsjheAJFdWvW6tl43Q", "review_id": "XnEYzTFA-1GdCA_gq3HfCw", "text": "Made fresh everyday at 7pm... Check out the Jumbo size!!!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2013-01-16", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "nYbLdMOWQnP8cDYIEp5NAA", "review_id": "Y3ZoOcbGVqnIlfYAg0Qnhw", "text": "Great donut shop open 24 hours.  The donuts are fresh and taste like the good Ole days. They have all your favorites and you can even watch them making the donuts as your ordering. We will drive clear across town for these lovely pieces of fried dough.  Better than Krispy Kreme for sure.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-06-08", "useful": 0, "cool": 1}, {"funny": 0, "user_id": "GE6Amb4sSvxvjxvv_vvKPg", "review_id": "8VPJOGv--EgId_WRXfvRfw", "text": "Once you come here, you won't ever want to go to another donut shop, hands down the best in town! Friendly staff, open 24 hours, inexpensive, and great quality donuts...what more could you possibly ask for? If you ever find yourself on the east side of Las Vegas, make sure you stop by and treat yourself to a donut or two.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-07-21", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "9b2VOdhdHEEMXXeM2fnR0A", "review_id": "e_ScXKp6n1rR8zXpR0Prlw", "text": "I love these donuts I've been coming here ever since I was a little boy the staff are excellent the people there are really nice I also love it because they give free coffee in general this place is the right to get your donuts !", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-08-25", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "BA2n6btUUcGzVELjkNm9Zw", "review_id": "49L50MCtfozRT9pAKL5tBg", "text": "The best and freshest donuts in Nevada! Our little hidden gem store on E. Charelston. I know churches, groups and individuals that will drive all the way across town to come to our little hidden store. Better than Krispy Cream. Better than the other donut stores. Cooked fresh and open 24 hours a day and night. Best in the west and priced fair. Enjoy!!! :)", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-09-20", "useful": 0, "cool": 0}, {"funny": 2, "user_id": "4r_4feU3sXI4K-U-T1pPdw", "review_id": "bvooqSL4B5bE6QnlJ2I-aA", "text": "I went here at midnight. I was the only customer there. The guy behind the counter was not cool at all. He kept rushing me, breathing hard and grunting like he had something else to do. At one point, he literally said \"come on....\". Like.... seriously? Slow your roll man. Let me pick these donuts. I wasn't even ready when he approached me, he just came up, stared at me like I'm on the clock and I have to pick before a bomb goes off. I'm the only guy here and I'm not holding anyone up... relax. \n\nOther than the rude guy rushing me, the donuts here are pretty good. Old fashioned chocolate was fluffy and delicious. \n\nCustomer service is important though. Don't rush the only guy in your shop so you can get back to standing there waiting for someone else to rush and grunt at. What an impatient jerk.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 2, "date": "2017-04-10", "useful": 1, "cool": 0}, {"funny": 6, "user_id": "_XcsG3krzuXLXaLDncBITQ", "review_id": "lI41XKfKme-w93j0tiMU1w", "text": "This place has some good glazed donuts and the sized just right. I mean really huge. I wasn't too thrilled with the selection but that was ok because when the craving for a donut comes it comes fast and furious.  \n\nI love the fact that this local donut joint is open 24 hours.  Donut Tyme actually fits right in on Charleston.  that whole section of the building has that step back in time feeling.  I love the old school feel.  When pulling up to the place images or flashbacks of old cop cars come to mind with cops eating inside the joint. \n\nThese donuts are pretty good even though the selection is small. I REALLY wish the selection had blueberry donuts or something strawberry glazed.    I know if Im in the area Im defiantly thinking about stopping here.  I compare this joint to winchells without the famous name.  Donuts to me are still KING of the sweets!  I can have an awesome day at the gym and drive by Donut time and it's like the car takes control of my willpower and parks itself in front of the store and I walk into the place all zombie like ready to stuff my face with the tasty donuts.  This place will live to fight many more days......you understand!  lol", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2015-01-08", "useful": 9, "cool": 10}, {"funny": 0, "user_id": "2FyHUsC_lintSPKDvPy9CA", "review_id": "tUhWxSU19_7yP3O4bV4L3w", "text": "I walked in about 8:30pm and the doughnuts looked very fresh.  Many places make their doughnuts in the morning and they are quite old by evening.  This was most certainly not the case here.  I ordered a glaze doughnut (always the test of a good doughnut place) and a yummy cake doughnut with orange icing.  Both were delicious.  The orange doughnut was really quite wonderful.  The icing had orange pieces...orange zest I imagine.  I was really impressed with the freshness of both doughnuts.  The prices were under $1 each.  If I recall correctly the regular doughnuts were .95 cents and the fancy minis were .85 cents.  The minis were more like mediums as they were not very small.  I will definitely be going back here again.  My favorite doughnut shop in Vegas for sure!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-09-12", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "G2vljP_LAtF2s8jq9cxESA", "review_id": "-rfYE4zGrwsZX-jwGrLuwg", "text": "What can I say I love this place with all my heart, growing up on the east. This was my favorite place coming when I was a teenager. And the fact that it's still here !! YES !!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-06-24", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "5eAYHVbAnXxhZTYM4x7UKw", "review_id": "eADiSgAx8uGHCcrUvnt0pg", "text": "The lady and I stopped by here around 8pm and it was pretty \"busy\". About 4 people in front of us and the place is sorta small. They have a nice assortment of donuts behind the worker and donuts in the front of the worker from a glass see-thru display with a noted reminder to: NOT lean on the glass! With how busy the one lady working was, she still threw in a free chocolate cake sprinkled donut with our assorted dozen! Free is always awesome. \nI love maple bars and since I got one out of the last 3 that was there at that time, it sorta wasn't AS soft, but hey - beggars can't be choosers. \n\n*Reminder: Parking is very limited and tight! It's really hard to get a parking spot and personally, I dislike parking so close. So I park on the side street upon entering if coming past Lamb street.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2016-08-29", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "w0ucAwG5ZqBn4iKQa4lBAw", "review_id": "Gm-A92mEJ_JO_xEuDEoE6g", "text": "No other Donut place can compare ! Hands down best donut place ever. Prices are amazing. Everyone is beyond friendly and open 24/7", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-09-09", "useful": 0, "cool": 0}, {"funny": 11, "user_id": "z4RytucxI_XfcMFaEI2DRg", "review_id": "L5Hqh1IQWhkUS2mN_FRgeQ", "text": "Donut Tyme is my favorite mom and pops donut shop on the east side. They've been open ever since I could remember and they continue to keep the same quality as the years go by. They are open 24 hours if you are ever craving a donut at weird hours of the night. \n\nI went in one morning to get donuts for my staff and I was greeted by the whiff of fresh donuts. Don't expect any unique flavors like you would see at Pink Box or Donut Bar, they sell old school donuts, but make them well. I got a dozen donuts for about $8 and chatted with the owner for a bit. She is very sweet and even offered me 2 extra donuts and a cup of coffee to take on my way to work. \n\nIf you're looking for quality old school donuts, definitely check it out!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-05-10", "useful": 13, "cool": 14}, {"funny": 1, "user_id": "vfn2YxnpAf5tl3qE1o-ZLw", "review_id": "E70Wf5gU-JagMFIMjP9sog", "text": "Love that it's open 24 hours perfect for when we're craving donuts which Is often. I feel that if I wasn't allergic to milk we'd be coming here more often", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2014-09-10", "useful": 1, "cool": 2}, {"funny": 0, "user_id": "5G6GPwe1C-vmlW3AZ7mnsg", "review_id": "TZgzJX65MjBXGIRq9ReAKA", "text": "Been going to another donut shop closer to where I live but when I was in this side of town I encountered this hidden gem. I'm telling you these donuts are fresh, taste great and honestly will be making the 25 minute drive for some donuts. I'm a huge DD fan but from here on out this place is my spot for a sweet tooth.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-08-23", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "SA31FaGECrh-tZpk2ECNdw", "review_id": "kpQzvCutfCIWRSSwYnXB3A", "text": "Needed 6 dozen donuts and not living in LV it was Yelp to the rescue! Called about 5pm the day before and explained what I wanted, the lady on the phone was very helpful and friendly. Picked them up the next morning at 8:30. Great selection & prices. The mini apple fritters are delicious, not at all greasy and heavy. The jelly donuts were light and airy with just the right amount of filling. Will definitely be back.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-05-12", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "JjvFRa-oGLXgsmCQjwC0YA", "review_id": "sOa2hccK8bTJ0VVA_NFM1g", "text": "By far the best damn donuts I have ever tasted.  Move over krispy Kreme and dunkin donuts.  This donut place is by far the best in taste and also soft and warm.  I'm so excited to come back tomorrow.  I love this donut place.  keep up the great work!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-09-20", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "rwsz4-xScU0KwwRArsHZhQ", "review_id": "NlK0Qs8wueU7kvPeOcL6FA", "text": "Donut Tyme has fresh and soft donuts made by hand each morning. This is a close location to the 95 and makes it a convenient stop for me to pick up some snacks for my friends and coworkers. The cake donut lacks variety as well as the donut holes. The only flavor donut hole the offer is glazed. \n\nFor a dozen donuts, it's only $8.99. The place is relatively clean and had excellent customer service. The have a cappuccino machine if you need a quick pick me up as well! \n\nThe fruit fritters are very popular and seem to sell out the fastest!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-03-18", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "540jRPuxliI6CnEdb3_rqQ", "review_id": "tuX7dN03SEXZxm0Ctf4_Mw", "text": "We walked in after a night out on Fremont and a random donut craving. We got greeted by a super cheerful gentleman. He gave us great genuine customer service. We got half a dozen donuts some milk and coffee . They were Delish! We got home and heated them up a bit . Perfect midnight snack after a night out. Will definitely be coming back here again.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-01-19", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "ZU1RpTm_7kuFDBs1QpHDIA", "review_id": "bRbbNVKO1NC8aJSOaZ9YOA", "text": "This shop is amazing. Selection on most days is great. My co-workers have commented how they are glad they don't live near a good donut shop, haha! They wait for me to bring 'em in to get their fix. My hubby is a great cook and he is very pleased with the quality of Donut Tyme's offerings.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2014-09-27", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "n-xYvlrFyhTmPBUObkW-AQ", "review_id": "_JJx53mXozMexWFgNQh3sA", "text": "Best donuts in Vegas!  Always open and always fresh!  Delicious coffee.  Very clean.  My favorite is the glazed donut but the \"burrito\" is very creative and tastes great.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-03-04", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "wjNDR7wEv6qR0vaOa-Uxlg", "review_id": "nKwkefD4nvJGfZpc1aUKFw", "text": "I'll be honest, sometimes the service is here or there, but that's not what keeps me coming back, it's the donuts that keep me coming back. The donuts are amazing. I still have yet to find another shop that makes them as great as this place. Take a bite out of a fresh donut here and it'll bring you back to your childhood, hence donut tyme. Really makes you nostalgic. Keep up the great baking, guys!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-12-22", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "fPR9PShdUam2KvvgnTrSNQ", "review_id": "XT9wohthksKv8J4yJssUYQ", "text": "I came here at 8am on a Sunday morning. The service was immediate. The donuts are awesome. I ordered a Apple fitter it comes in large or small size. Perfectly glazed and also very fresh. I ordered a coffee and I wasn't too fond of it. I am a coffee fanatic and this was something I could have done without. It tasted a tad bit burnt and there aren't much choices for creamer. I'd love to see that. The place is clean. I'd consider going here again. Oh and I need to mention the prices are AWESOME.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2017-05-28", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "h42nVD7qekIjwBezBfh6Jw", "review_id": "49qMWj703rPwv1Sk64H-3w", "text": "It's pretty far from the strip for a tourist but it's worth the drive to me. The donuts here would have to be some of the freshness i have ever tasted. It's great with coffee or a late night snack. The only downfall is the location.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2014-07-04", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "ufbEaTy5TdycUdQWlIcgaA", "review_id": "pEjbaHUsEJhhgWe6gvS01w", "text": "You know it's gonna be a good night when Grammy and Granddad show up at your door and you all decide to do a donut run at 10 o'clock at night. Even though it's 30 minutes away from our house, it's worth the drive!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-10-22", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "DvnCjHJLt6Bz_Jg5nL69Ug", "review_id": "bBd_sav7BWTLnOlacVtUlA", "text": "YES IT'S LONG, BUT PLEASE READ!!! 3/29/16 around 8:45 pm. The only reason they are getting one star is because I can't select no stars. I have been going to this doughnut shop as long as I can remember and I grew up in that neighborhood in the late 80's. The last three times I have gone, there has been some type of problem that I have left empty handed either due to lack of products, malfunctioning equipment, or now horrible service! Tonight was the last straw! This place used to be amazing, but tonight they lost a customer that has been going to and referring people to this place for nearly 25 years. The man working the counter not only did not greet us after helping the customer before us (my fiance and myself), but just stared at us. I said, we would like a dozen please and he walked over to the radio to tune it to a different station, which took him a couple minutes to find one he wanted. Then I repeated, \"A dozen, please\". He said, \"Yes...\" rudely while I was still waiting for him to grab a box before telling him what we wanted. He finally grabbed one and I asked for two old fashion doughnuts, his response, (again in a rude, you are a waste of my time kind of tone) \"Glazed?!\" I told him yes please and then asked for a crumb doughnut. By this time my fiance didn't even want to order doughnuts because he sensed the man's attitude as well, but then said can I have one of these with sprinkles (as he pointed to it in the case) and the man turned his back on us and got a coffee cup and started looking like he was going to fix himself a drink in the middle of our order!!! My fiance finally said, \"You can keep your doughnuts\" (as the man was still messing with the drink machine behind the counter) as we turned to walk out the door and the man behind the counter said, \"Thank you!\" and started putting the doughnuts back on the shelves. He then started helping the customers who were waiting behind us right away. He was not a very nice man and had no customer service skills what so ever!!! The people who used to run this place were great, but not any more!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 1, "date": "2016-03-30", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "gDHVUe8xSlqgiWmtPSDFhA", "review_id": "3RiBpRPVTOLYPdxYvON9OA", "text": "Customer of almost 20 years and still going strong. No other place has ever compared to here. Even when they have got new owners, donuts still taste the same. SIMPLY AMAZING!!!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-04-18", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "A3SSi5bY1taLkJoKo00uDw", "review_id": "PMSM8j10ZJ7EZ-P__GsL_w", "text": "Great Donuts, Great Price! I was a little disappointed when I walked in on my first visit ever when the lady behind the counter told me that the only donuts they had at the moment were a couple of large pans of donuts. I asked if the had any creme filled donuts and some raspberry filled donuts. Surprisingly she said yes so I was pleased and bought 1/2 dozen of each.\n\nI brought the donuts home to my wife who loves the creme filled and I'm the raspberry lover. When she bit into the chocolate covered and creme filled donut, she said Mmmmm these are yummy! SO as the saying goes, \"Happy wife, Happy life\"!  I'll be back!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2017-03-24", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "pgMxiwSL7Hhz98jxCkYqHA", "review_id": "kqLNOlPEq4B0ubnZZW_i-w", "text": "We love this neighborhood joint so much. Great selection of donuts at a fair price unlike their competitors, i.e Winchell's and Dunkin. With being open 24hrs it makes for a cozy spot to stop in and grab a quick treat. All donuts are fresh and baked to perfection each and every time.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2014-07-07", "useful": 4, "cool": 4}, {"funny": 2, "user_id": "k4M43lXJuQMpQW65DTqzIQ", "review_id": "auySq9iAj-hW4a6cdEUFaw", "text": "I've been coming here for years.  8-9 years ago, I would meet my friend/classmate at 4am here so we could grab a nice donut, hot drink, and study before class.  I still frequent this donut shop randomly between the hours of 3am - 5am.  What's a dukedom without reviewing the place?!  That's not yelp justice!  \n\nSo they make their donuts the way they want to unlike commercial Krispy Kreme or whatever and I would gladly support a local product over others.  Honestly, the sugar/carbs in these donuts was probably what helped me pass college!  I never thought abou that until now!  \n\nBeing a lowkey customer for over so many years, this shop has never dissapoint.  Homer Simpson, these are the donuts you should eat!   Where you at Homer??", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2011-11-06", "useful": 4, "cool": 2}, {"funny": 0, "user_id": "ZcAi2ddbQyAhgta4VfxM2A", "review_id": "dFnPptjMvHGaIkrH7w-KaA", "text": "These are the best donuts in Las Vegas. Don't waste your time with the big chains that over charge. I drive over 20 minutes to get these as opposed to the chain that is just down the street.  They're wonderful any time of the day, but they're especially good at about 8 pm when they are fresh.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-09-28", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "qewG3X2O4X6JKskxyyqFwQ", "review_id": "MVrzao3Lop4eYOhnmrYlyg", "text": "You can get your donut fix anytyme right here because they are open 24-hours. It's always Donut Tyme! This is good information to have if you wake up at 2am fiending for fried dough. Although, I recently discovered that several donut shops in Vegas are actually open overnight and then close in the afternoon, so perhaps this is the place to go if you are feinding at 5pm!\n\nThis was the first stop of our Saturday donut crawl that was to include 5 stops. The shop is clean and simple with plenty of spots to take a seat, and the service is friendly. One donut was .75.\n\nThe donuts are on display Dunkin Donut style on trays up behind the counter, and I think this may affect the final product if you don't arrive when they are fresh out of the fryer. When we arrived, the donuts had been hanging out for a bit, and our cinnamon roll variety ended up being a little dry. But, hey, that didn't stop us from eating every last little crumb of cinnamon goodness. The glaze was generous and sweet. Overall, a solid mom and pop choice for a sweet treat 24/7.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 3, "date": "2010-10-26", "useful": 7, "cool": 3}, {"funny": 0, "user_id": "htmEcADTpMV7_hDtASdnUA", "review_id": "0Xs83Gu3dHSOX8OIhq6wbQ", "text": "Giving donut tyme 5 stars for the actual shop and whoever makes the wonderful donuts lol but as far as the service.... well there was an old guy that use to run the place, but hes gone now and theres this little snobby girl. Ugh she has thee worst customer service skill i have ever seen!!! She obviously hates her job not sure why shes even there.  U walk in and you are never welcomed or greeted in anyway! Im sure im not the only one who feels this way about this particular person!! But like i said the donuts are delishhh. Been going here since i was in 4th grade and im now 28!!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-12-22", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "sIxSuqjxgs57Gm6OmBO38A", "review_id": "Hk2vLDuNRfaqgmcNOmck2g", "text": "This place used to be good but now i dont find it all that appealing. Donuts are ok and every time i go, i never see a variety.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 2, "date": "2016-07-04", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "gQDLi67PvBxEWsQYAcyMsw", "review_id": "dZ5bGsN2aIW9cKOm36GneA", "text": "This place is very nice. It is simple and straight to the point. Good donuts! Fresh coffee and friendly service. Comfortable seating. 24hrs, accepts cards. :)", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2011-12-01", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "YtSJsJMe0OCgZEsXqkaasw", "review_id": "ogoFEq_rAAC9Uht7T-OaDA", "text": "I don't normally write reviews but these are the best damn donuts in vegas!!! They keep them simple nothing to extravagant but damn super delicious!! They almost melt in your mouth, they're so soft and not heavy at all. Most places where I buy donuts, they get hard overnight, these don't. They keep the same soft texture and they remain delicious. I can eat a whole box by myself in one sitting.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-03-23", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "BGwwoQ06R348ktKbvo8pTA", "review_id": "JWnOGFCldwJnhg6PjjhEgQ", "text": "I've lived in the East side most my life and only just found this donut shop a few months ago. I love how it's open 24hrs. Most food places should be. When you get off work late, this is the spot I like to stop by before going home. Their donuts are so fresh all the time. So soft and flavor full. The large fancies are fun!! I like getting their ice mochas, it just completed the donut experience. Big thumbs up!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2014-12-02", "useful": 1, "cool": 0}, {"funny": 2, "user_id": "U4INQZOPSUaj8hMjLlZ3KA", "review_id": "WfbguGfZZVpFH3tau5mxAQ", "text": "Items Selected:\nPumpkin Cake\nCrumb Cake\nApple Fritter\nButtermilk Bar\nSour Cream Old Fashioned\nBlueberry Cake\n\nOpen 24/7 in a nondescript strip-mall at 4268 East Charleston with a mantra of \"Making mouthful of happy moments\" an early morning stop at Donut Tyme was largely a result of my inability to sleep in on Saturdays and with a sixteen mile run already under my belt with breakfast plans at eight o'clock a 6:35am arrival proved perfectly timely, the morning's fresh options emerging from the fryer just a few minutes before I entered the front door.\n\nClearly a local's spot with regulars proving the rule as nearly every patron's order was already known to the friendly clerk on their arrival it was only after a few questions, easily managed despite language barriers, that a half dozen was ordered and with the $4.95 tab paid and laptop in hand the next hour was spent in sugary indulgence while perusing the internet via free WiFi for information on the Kings and Buckeyes games later that night.\n\nEntirely ignoring yeasted options in favor of the cake based classics by which any donut shop should be judged it was with a seasonal pumpkin ring that the tasting began and with surprisingly restrained glaze and a supple center without a hint of grease the nutmeg notes of spice shined, a similar lightness found in streusel-topped crumb selection with a slightly less dense cake beneath a similar lacquer of sweetness that acted to balance a substantial compliment of cinnamon that otherwise could have easily been 'too much.'\n\nMoving next to blueberry, obviously artificial but tasty none the less, it was a small fritter into which I next sank my teeth and although a bit less 'apple' than I'd have personally preferred the crispy shellac over soft batter was virtually oilless, an impressive feat for any bakery to overcome such a common complaint.\n\nHoping for a 'best for last finish' with two personal favorites following the fritter it would be difficult for any local bakery to outperform the high standards set by the buttermilk bar at Sunrise Too and although Donut Tyme admittedly came close despite over glazing this particular piece it was the Sour Cream Old-Fashioned that effortlessly stole the show, a smooth and rich finish to the delicate base with light sourness that rose to the palate as initial sugary notes faded on the tongue.\n\nClearly overlooked, likely in part due to location, but executing well across the board Donut Thyme is the sort of place many would claim 'doesn't exist' in Nevada - a 24-hour donut parlor on par with the likes of those in California and easily a rival to Real or Friendly for 'best overall' in the 702.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2014-11-11", "useful": 9, "cool": 7}, {"funny": 0, "user_id": "z1cuEVUb58zaYkLyqJEgug", "review_id": "TuewsXY7aWRhuGy4548-Iw", "text": "I brought a dozen donuts about 7:45 pm and they were as fresh as I would buy them 6:00 in the morning somewhere else... A must go to anytime of the night and day year round..", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-04-07", "useful": 0, "cool": 0}, {"funny": 3, "user_id": "2t__HKqBFV1-2eIW2Nom9g", "review_id": "vKS-PxCh0-6tg5rNcf1E-g", "text": "I am almost never on the east side of town, but when I was finally in the area, I decided to give this place a try. The donuts were excellent! I ate a half dozen myself. They were all very fresh. I had a buttermilk bar, sour cream, glazed twist, cake with sprinkles, blueberry cake and apple filled. Great low prices too. Some donut shops in town charge twice as much for donuts which are not as good.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-12-18", "useful": 4, "cool": 5}, {"funny": 0, "user_id": "T4QZ-z3IbMg-4FmuBt8Idg", "review_id": "YvQXwDpwbaFmQWRG9Uw6bQ", "text": "The donuts are decent but selection could have been better.  I heard mixed reviews about the place so I had to give a try myself.  I went later in the day so Ofcourse they weren't fresh but I miss the mom and pop - type donut places so it was worth a visit.  Overall,  pretty good;  better than most,  but its no krispy creme.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 3, "date": "2013-12-23", "useful": 1, "cool": 0}, {"funny": 1, "user_id": "mFHbNX5qhG5CREr9PqQqGQ", "review_id": "2_JZzASC3hj3t1-kwXYCwQ", "text": "3 stars because I know he was holding out on the fresh, warm stuff when I specifically asked (I saw them in the back) and he was getting exasperated because he was mumbling and getting exasperated when I asked a couple of questions. \n\nThe cinnamon crunch was good, apple fritter is a must get, blueberry cake was also a solid choice and the chocolate dipped old fashioned was amaaaaazing.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 3, "date": "2017-09-27", "useful": 3, "cool": 1}, {"funny": 0, "user_id": "j6jYcOHKGNMvAWnHxa6lJA", "review_id": "_RQPiuKo60YniVfa2VgPjQ", "text": "Great selection of donuts! They are also very delicious. AND they're open 24 hours. Will return.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-05-25", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "tRdX5by2rU8swIoN4qpfwQ", "review_id": "ExQ0qpnv6iduGHpItAaL5g", "text": "This is my favorite donut place in town! The prices are more than reasonable and the staff works quickly. They also have a very wide selection. I believe it's open 24 hours a day and they always have fresh coffee!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-01-26", "useful": 0, "cool": 0}, {"funny": 4, "user_id": "SoiacX2r2mvHqIh3GgRMUw", "review_id": "srUS2XNNvTH13NvZtwG-tA", "text": "Love this donut shop. Super old school, staff people always nice and to top it off it's always open :)", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-10-26", "useful": 5, "cool": 5}, {"funny": 3, "user_id": "u6wAG4h60a0vOikJ1wtjcg", "review_id": "wXwVOrN1cO4CjSb1q_MBoA", "text": "Outstanding selection of traditional favorites that are melt in your mouth delicious.  Fantastic service always with a smile no matter what hour you may get your craving.   Any time day is the right time for Donut Tyme!!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-06-07", "useful": 5, "cool": 4}, {"funny": 0, "user_id": "jn3N7FHv--yLgChbEwpMNw", "review_id": "5tXTNfslsyrrHuN10thGIA", "text": "Been coming here for 18 years!!!! Best donuts in town and it's open 24/7 go early in am and there's tons of them fresh and place smells awesome.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-08-20", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "Gy6W9VtYtsYObtiNe1C4EA", "review_id": "MLWJiK7pXuWmljlzJcoADg", "text": "Good donuts, good selection, friendly service.  Reasonable prices.  I will be back.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2017-04-05", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "Bj_MarPEKBe2xN12YimekQ", "review_id": "oWT_dwMeXyb2UKAf70zGsA", "text": "I came in here a couple of times before and each time yielded the same results....ok doughnut but super friendly service. Service goes a long way with me but over all I need the quality to be improved. It's open 24 hrs. so thats a plus :-)  Just a little fresher doughnuts and I would be a happy camper :-)", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 3, "date": "2012-04-06", "useful": 1, "cool": 1}, {"funny": 8, "user_id": "8DBH3BpLINfTAK_Up5BtUQ", "review_id": "Z60p6NwQVV5JpcT6beDK-Q", "text": "Do-do-do-donuts!  Who doesn't love donuts????  Especially fresh donuts that you can get 24 hours a day!  Yes, 24 hours a day!!!\n\nDonut Tyme is my mom's go-to donut shop on the East Side.  I have sampled their donuts plenty of times and have always had a happy belly afterwards.  I finally made a trip to the store to pick up some donuts for my mommy.  \n\nThe store is in a small strip mall on Charleston and Lamb.  It doesn't stand out much, so you do have to look for it.  Parking is treacherous, so watch out for the crazies in the lot.  I almost got hit 3 times because not one person was looking while driving.  The lanes seem narrow too, so it seems you are right on top of the next car.  \n\nAs you walk in, the store doesn't have any ambiance, but the donuts totally make up for that!  They have all of the wonderful classics you grew up with like maple bars, chocolate covered, apple fritters, and of course SPRINKLES!  They also have specialities options like the apple burrito and giant pinwheels.  I haven't tried all of them, but the ones I have are yummy goodness.  My favorite it the glazed donut with chocolate topping, closely followed by the glazed buttermilk.  I know it isn't fancy, but it is super great!\n\nThe prices are reasonable too.  Regular donuts start at $.80 and the jumbo ones start at $1.50.  You can get a dozen regular donuts for $8.50!\n\nThe shop isn't fancy or trendy, but they have legit donuts.  Don't walk in hungry, because you might walk out with 4 dozen donuts!!!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2013-12-11", "useful": 10, "cool": 8}, {"funny": 1, "user_id": "uXd-tA7nboj-9nV0vLTh8g", "review_id": "CfGzKkbnsZW4yASnRlDOnw", "text": "As soon as my sweet tooth is locked n' loaded, I'm huntin' me some donuts!  I spot this mom and pop kinda donut shop on the eastside of town and thank God they were open.  It's your traditional Ol' Timer shop where the elderly come by every morning for a cup of coffee as they sit down and chatter about the latest politics and read the news paper while they chew on their favorite frosted pastry.  \n\nDT's selection of morning treats was definitely a selection.  They have all the classics like the buttermilk sort and the twists to some new inventive yellow glazed roll don't know what to call it kinda' thing that resembles a cannoli :). \n\n$8.50 scores you a box of 12.  The donuts were nice and sweet lil' things but they were a little doughishly dry, if that makes any sense.   My all time fave is the maple bar and it passed the test.  The only donut from my collection of 12 that didn't make the cut was the jelly filled.  The strawberry jam was too.. Manufactured? Thick? Artificial? Straight nasty!  \n\nBut hey..  It's donut time anytime at Donut Tyme!!! ..well, literally 'cuz they're open 24hrs.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2013-05-09", "useful": 2, "cool": 1}, {"funny": 1, "user_id": "W5iGpA5vgaWRyt4nY4cYBQ", "review_id": "tHw9v9oern25sF5AULuJNQ", "text": "Can't get enough of their donutssss! I rarely crave for donuts, but when I do, this is the place to be! Their donuts just melt in my mouth! I have yet to try all the flavors, but so far, all I've tried were really good!! Better than dunkin donuts! Oh yes! Way better! =P", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-11-11", "useful": 1, "cool": 1}, {"funny": 0, "user_id": "pDNeS1nbkKS7mJmhRQJPig", "review_id": "t2_KwcVJVskirJaEnB2Teg", "text": "Amazing. No other doughnut compares. In a weird part of town but it's my go to place when I want a doughnut. The buttermilk donut is the best and the second best IMO is the cinnamon crunch. Come here at least and try it out once. I promise you'll be hooked.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-06-26", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "ex4OMhYVR_n9tvVtTli2mw", "review_id": "k2TVpMIPWpT4Liebt6Ls5g", "text": "Best donuts ! If you like fluffy donuts you'll love this place! I hate anorexic krispy kreme donuts. Such a waste of money. Donut Tyme always has a huge selection too", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-07-30", "useful": 0, "cool": 0}, {"funny": 3, "user_id": "yyDp7MZ2st7p0fOQuFYpcA", "review_id": "FVgdVru5vXUaqTY9NFR2IA", "text": "Had some donuts and they were very fresh and fluffy. They were on the more sweeter side which I know sounds silly for donuts, but they are. The donut base was sweet, the glaze was also sweet so it made the whole thing too sweet. I like how fresh it was though because it was so soft the other donuts looked like it was crushing the others in the box. I tried the apple filled donut and it was ok. Tasty, but a tad too sugary for me. Would like to have more apple filling. The place is open 24/7 and has free WiFi so that's good to know if you're working late or odd hours.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 3, "date": "2017-07-23", "useful": 4, "cool": 1}, {"funny": 0, "user_id": "DwS5fvL_BR1-uUaafGTkOQ", "review_id": "pWJH_hwNVqfXRltPslugbw", "text": "Thank you, Misti, for reminding me just -where- was my review for this place!? I thought the name of the business was Donut Tyme, not Time. No matter, i'll get cracking on my review!\n\nA family-owned donut shop, and very good, when you are there at the right time! Working swing-shift for 11 years, and living in the general area, i'd get donuts from here weekly. I live on the other side of town, the past few years, so I get them quite infrequently now. But,  while they are 24/7, they make the goodies in the middle of the night and that's IT. If you get there at 12 midnite, you'll get a possibility of some fresh made...But you might get a few no-so-fresh ones. Consider it the Vegas gamble, ya know?\n\nIf you get there after 4am, your selection will be glorious! A treat they make daily are French crullers, with either chocolate, vanilla or maple glazes. Other donut shops makes these on weekend only, not here. They literally MELT in your mouth, they are so tender. Other great choices are fluffy and delicious raised cinnamon crumb, and maple bars.\n\nSo...neighborhood's not the greatest, but this shop is great!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2010-10-22", "useful": 3, "cool": 2}, {"funny": 0, "user_id": "r5Df9Md3Uq-jTpVcS5bndg", "review_id": "FdmhtmkZ4-wh6lp1q9Eogg", "text": "Cozy mom and pop donut shop. Not the most wide variety but the quality is good.  My favorite is the glazed buttermilk. \n\nThey've been at this location for at least 10 years. Love supporting the small shops.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2015-06-05", "useful": 2, "cool": 0}, {"funny": 4, "user_id": "7Oe6ikklTjVBbEFw9emLcA", "review_id": "oPRePeF7Yer9OOOIzDzEHg", "text": "I've been meaning to come here for ages, but it's not really near me.  However, I happened to be driving by one day last week and I made a point to stop and take this bookmark off the list.\n\nFirst of all, Donut Tyme is open 24/7.  I'm not sure of any other donut places that are open all the time except for maybe one of the chains that starts with a 'W.'  Secondly, there is not a huge selection compared to your other traditional donut shops, but they do have some huge donuts, literally.  See the pics of the cinnamon twist and glazed donut that I took:  BIG!  And let me tell you that the cinnamon twist is not only big in size, but it's big in taste.  Anyone who knows me well knows that I love cinnamon and this may have been the best cinnamon twist I've had in a long time.  You want to know how good it is?  I ate the WHOLE thing by myself, in the car, on my way to work.  There was no shame in my donut game that morning.  I would go out of my way just to get another one knowing how good that twist was.  I also tried something unique they have there called the fried apple burrito, which is almost like Mickey D's old school apple pie but made with a glazed tortilla.  It was okay, but the filling was too sweet for me.\nThose are actually the only two that I tried.  The lady behind the counter was very friendly and there were customers who were probably regulars hanging out.  I'd come back for the twist, but nothing else really caught my eye.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 3, "date": "2016-01-21", "useful": 4, "cool": 2}, {"funny": 1, "user_id": "EkF5gkKG_OZAGP0C7cYSMg", "review_id": "-PC1Boy0RhuluD8F-WbmzQ", "text": "A 24HR donut shop, yay!  New to the neighborhood and was pleased I could make a quick stop before my early shift. Been to this shop for a dozen more than a few times to take to the office and they were always fresh and honestly good.  Buttermilk donuts got two thumbs up from a couple of the gals who like the classics.  Thanks, Donut Tyme for honestly good donuts!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 4, "date": "2014-05-02", "useful": 1, "cool": 1}, {"funny": 0, "user_id": "PIYit1DYIFcKp8VrJZfrOA", "review_id": "mSj1gBflnYUwEqUA5P7iew", "text": "i just keep going back and turning my friends onto donut tyme. the prices can't be beat and the flavors are awesome!!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-09-30", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "YYh8iYLYfgRGRs7cCNJJEg", "review_id": "LY3JVGmqqAbvq7VEwjzP2A", "text": "The rave reviews for this place here on Yelp (and from others at home) are well warranted. Not only is the staff here incredibly friendly, but the donuts are fantastically delicious and surprisingly cheap.\n\nJust one example: during our latest visit, we couldn't decide between two different donuts, and she threw both in for free to try, and both were amazing.\n\nMy only warning is to note the difference between cake donuts and the normal ones when coming here for the first time. I vastly prefer the latter!", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2016-08-13", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "9K7rn-ALII1cPUQVxlBA5Q", "review_id": "oX3pIn6J6u1wn_Qg8sSSmg", "text": "Best donuts  ever been  coming  here for years they  have  a  wide variety  of donuts  at a decent  price they blow away any of the other donuts  like dunkin Winchells and krispy creme... even their plaon donuts are fresh and just taste awesome. . They are open 24/7 baby donut  time anytime", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-05-10", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "lagOUe22SRIFWdOOzGXLhg", "review_id": "0hWpCeMqWjFu6Kx9n14hXA", "text": "Love their donuts they just have to put their donuts in separate boxes if they are gonna overlap since all the icing will come off and stick to other donuts but they taste awesome", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2015-04-07", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "6S1TOP1RsPt-mwyyhk8XoQ", "review_id": "VwjW1_71cEZCnTthwdr0Rw", "text": "This place has been around for years and has always had great donuts, I particularly like their old fashioned that kinda look like a small loaf of split top bread. We moved to the other side of town but was in the first time in a while still great donuts. Locally owned please support small businesses.", "business_id": "PJ-VbAtIOso1dqd2frQqqg", "stars": 5, "date": "2017-08-14", "useful": 0, "cool": 0}]