[{
  "funny": 0,
  "user_id": "wnO99pBbGqwqOoTQM25iCw",
  "review_id": "_1OY1xzWG-04z_XlkKhFXQ",
  "text": "I dread Palace Station.  Mainly because I hate smoke and Palace, like most older casinos, reeks of smoke.  You can almost picture the rat pack smoking in front of every wall in the place.  So I was reluctant to eat here but our friends were staying here and we met them on their turf for dinner. \n\nI was pleasantly surprised.  The place was dead as it was Sunday but the food was good.  The chicken quesadilla really hit the spot and the buffalo chicken wedge salad was a hit.  Our waitress was cute and friendly and attentive. (maybe because we were one of three customers (I even forgive her transgression of KEEPING MY CHANGE).  \n\nA few notes:\n1) Although an Irish Pub, very few items are authentic Irish meals, or even attempts thereon.  Basic Pub Food is what you should expect.\n2) Although there are some TV's, not all of them are in direct view so if you come here to watch specific games make sure you sit in the center or pointed at the game you want.\n3) The portions are large.  4 of us got out of there at 31 dollars plus tip for dinner.  We can't complain about that.\n\nIf I am at Palace meeting friends or playing poker, I would definitely eat here again.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 3,
  "date": "2013-02-26",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "uq7ESURWa6MRgZo49rVeCw",
  "review_id": "1QykbrWKliWoCxi55OcBfg",
  "text": "This bar is located in the palace station not far from the main entrance. Had so much fun here. Went a few different nights. One band was amazing, and even the band we thought wouldn't be very good turned out to be pretty awesome. Stay at palace station, play at palace station, but drink at Jacks.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 4,
  "date": "2011-03-07",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "UAF1qKkTIcZOVpx0lhU3gA",
  "review_id": "6Gsa8WrZ1RztusGJE0YtJw",
  "text": "Hands down, this is the most disappointing Irish pub in Las Vegas.\n\nDad and I ate here at about 1PM on a Tuesday afternoon. There were a couple of people at the bar and one older couple sitting at another table. You'd think the service would be quick since the place was so empty, but it turned out the bartender was actually working as the server as well.\n\nWe ordered our food shortly after sitting down. Dad ordered a hamburger ($7.99) and I ordered 2 Scotch Eggs ($5) and a side of waffle fries. \n\n25-30 minutes later, a cook from the kitchen came out with Dad's hamburger from the kitchen and set it down on the end of the bar. Five to seven minutes later, the server brought the burger to our table...which by this time was cold. Ten minutes later, my food was brought to the table.\n\nThe food was NOT worth the wait at all! The hamburger resembled a hockey puck on its bun and wasn't even of a decent size, nor did it have any flavor to speak of. The Scotch Eggs were so crispy on the outside that they were unpleasant to eat, and barely tasted of sausage at all. The waffle fries were the only item that tasted very good...and even then, they were probably the same ones that can be found in any frozen aisle.\n\nAbsolutely NOT worth visiting! Horrible service and terrible food!",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 1,
  "date": "2013-01-02",
  "useful": 1,
  "cool": 0
}, {
  "funny": 4,
  "user_id": "8DEyKVyplnOcSKx39vatbg",
  "review_id": "gaaKr9kpKuFEfk0FJW5-vg",
  "text": "The weather for St Patty's 2012 was pretty lousy.  We had fully intended on going the Three Angry Wives after work but decided anything to do with standing outside in the cold with people who had been drinking since 11am was a bad idea.  \n\nI didn't want to pay a $20 cover to go to McMullen's where the police also conveniently placed a sobriety check right in front of.  So enter the ever dependable \"search for Irish bars\" on Yelp mobile.  Jack's Pub?  There's an Irish bar in Palace Station?  I called them and they informed me of some of the specials they had on top of their current happy hour deals and it sounded like a plan.  When I asked the manager if it was crowded there, her response was \"It's filling up.\" Translation: \"Plenty of seats!!\".\n\n$3 beers, half price on all appetizers and $8 plates of corned beef and cabbage!  That's all they needed to say.  Decent food and atmosphere while watching my NCAA basketball brackets go down in flames.  They had a band setting up by the time we left and the place had filled in nicely but we were too full of Guinness to get rowdy.  \n\nThis is not a bad meal option if the Oyster Bar line is too long.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 3,
  "date": "2012-04-01",
  "useful": 6,
  "cool": 5
}, {
  "funny": 1,
  "user_id": "2iIHR8q8Lor_gA685Lkb8w",
  "review_id": "-qcy7Gsjww5_rXMg1TecdA",
  "text": "I was very discouraged by the condition and poor service I experienced at Jack's Irish Pub.  \n\nI called ahead to ensure that I had the correct time for the availability of the St. Patrick's Day menu.  I was told that it would be available from 11am-11pm.  I arrived well after 11am and was told by the gentleman behind the bar that he had no idea when the menu would be available.\n\nAfter waiting for about 10 minutes, I then went to the player's club desk where someone contacted the food and beverage manager after another wait.  I was told that I should return to the restaurant to talk to the manager.  I walked the few step directly to the restaurant and was told that the manager had left and was \"in the middle of something\".\n\nI subsequently found out that they had rebooted the registers and the St. Patrick's Day food menu was now available.  I ordered the corned beef and cabbage and my friend ordered the Irish stew.  \n\nWhile sitting at the table I noticed that there were sticky stains on the table.  I spoke to the bartender about it and she came over in a few minutes and gave the table a cursory wipe-down.  She remarked that no one had been at that table that day, so someone must have forgotten to wipe the table down the previous night.  No apology for the unsanitary conditions was offered.\n\nSubsequently, the stew was brought out by the same bartender.  She stopped before bringing it to the table and placed it at the service area of the bar and said that someone else would have to bring the stew to the table.  I don't know why.  I was told that my corned beef and cabbage would be coming \"soon\".\n\nMy friend was eating the stew and the other the usual metal flatware, when the male bartender came to the table with a plastic spoon, fork, and napkin in a cellophane package.  He gave that to me.  I incredulously asked him, \"plastic utensils???\"  \"really???\".  He replied, yes, and explained that they had run out of flatware.  My friend and I were the only two diners in the whole place.  That was it for me.  I then left the restaurant, very disappointed with the entire experience.\n\nOh, and by the way, the whole time we were at the restaurant/bar, we were serenade with loud, Heavy Metal rock, courtesy of three video monitors around the room.  This was not the authentic or semi-authentic Irish, St. Patty's Day experience I expected, nor was it close to the level of service I expect from a sit-down restaurant.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 1,
  "date": "2015-03-17",
  "useful": 6,
  "cool": 1
}, {
  "funny": 1,
  "user_id": "g_VYtZv_3w03LIJbvYodZg",
  "review_id": "TIpxJmJx7as-n3F4l8Lssg",
  "text": "Biased-opinion because I know how this place is run. But I know that even if I didn't, I would probably feel the same, me being in. food&beverage . Only One girl serving on weekdays and some days are randomly busy. You can't expect ONE girl to give their undivided attention to specifically your needs if she has a room full of people who also are paying. It's not Her fault. But I get it, there are those couple girls who stand around, but Most of the girls hustle. The bartenders are also busy, and as they are the ones who make the drinks, the girls are on their time. I think most of the reviews for this establishment are too harsh.\n\nOkay I'm done ranting.\n\nGood prices on drafts from $3.50 to $4.75 depending on imported or domestic beers as well as if there is entertainment. It's pub food, and you get what you pay for. The Irish nachos are addicting as well as fish & chips. The burgers are large and good for the price. Bump it shots after purchase of a beer is $2, which includes Jameson, Jim beam, jack or sauza (which typically starts at $6 each). You can smoke, watch whatever game you would like with the 20 or so tvs around the room, and you could choose to sit at a high top or one of the many booths.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 4,
  "date": "2013-12-18",
  "useful": 1,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "cKEGgK0H1OS1x9pukOyqJQ",
  "review_id": "vNHjru4Wfm8jkdziCrqIBw",
  "text": "The food is ok, but the service is terrible.  Seriously had a waitress hand us a pad of paper and tell us to take our own order and give it to her.   Not her fault, she was the only server in the place.   We have been there several times and it is always the same.   Very slow service because there is only one person working.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 2,
  "date": "2017-05-04",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "UYcmGbelzRa0Q6JqzLoguw",
  "review_id": "RRVGJpGewJzSXV1QDgl3VQ",
  "text": "Headed here after work for a Happy Hour with friends. The place was deserted, but they have some good specials and their happy lasts until 8, score. \n\nWell drinks are $2 and there are some good beer specials as well. We ordered some bar grub as well, which is 50% off during happy hour. The food wasn't horrible. Pretty tasty for the price I feel. The only problem with this place is the service. It was horrible. Our waitress would disappear for long periods of time and it took about 30 minutes for any of our food items to come out. Refills were pretty hard to come by as well.  \n\nI noticed that the waitress was the only one in the entire establishment, but given the fact that there were so few patrons, I don't think that should account for the slow service. \n\nI've been on previous occasions and had better service, so I'm hoping that was a freak occurrence. I'd probably come back if I'm in the area again.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 3,
  "date": "2011-10-20",
  "useful": 4,
  "cool": 2
}, {
  "funny": 1,
  "user_id": "-50XWnmQGqBgEI-9ANvLlg",
  "review_id": "OWSqpo5mZUcYDeFSPV_-Jg",
  "text": "Experience:  was supposed to meet some friends at the oyster bar, but the line was long and they were late, so we met here instead. \n\nFacility:  this is a nice place. It has u-shaped booth seating that could fit 4 folks comfortably and squeeze 5. There is a lot of high stool seating at the bar and an additional bar (without bartender) behind it. There were lots of TVs to watch sports and it had a comfortable casual atmosphere. \n\nService:  this is the main reason why I am giving this place 1 star.  There was 1 waitress serving the booths. But, please keep in mind that there was only one other table filled, so she was not busy.  She did come over and get my drink order pretty fast, but when my friends arrived she did not come for a while. We were ready to order some food, and she wasn't around.  She kept goign to the back for long periods. One of two things is happening...either the management has her doing some food prep, which is poor management decision, since there is only one waitress, or she is doing things she shouldn't be, and management probably has no clue.  Either way, it heavily affected our service.  \nNow, here's the worst part....I spilled my beer.  Ok, that's bad, but not the worst...it's coming...\nSo, of course the waitress is no where to be found....I'm scrambling trying to keep it on the table wiping with the two cocktail napkins on the table, and apologizing to my friend for getting her wet...finally the waitress goes by and I wave her down and show her we spilled, apologized and asked for her help.  \nShe leaves and takes forever to come back.  I finally got up, walked over to the bar and got my own napkins.  She did not know this, and when she came out from hiding in the back again, she walked over to the other table to help them.  Then she goes back to the back and comes out again, with at least a dish rag in her hand. BUT, she walks past our table AGAIN to the other table, and then finally comes back by to us and hands me the rag.  I was shocked!  I explained that I had spilled a beer and why wouldn't she come back and help immediately.  Her response was \"the other table needed ranch.\"  Yep, that's what she said!  I did not get her name, but she was a blonde lady with a heavy accent.  Steer clear if she's working!!! \n\nFood:  we ordered the Irish nachos, which were typical bar food...good, but nothing special.  Then we got the fish and chips. The fries were not overdone to the eye...a nice golden brown, but they were kinda hard when you bit them.  The fish had too much batter and flavorless.  I might get the nachos again, but would never order the fish and chips again. But that would mean I would come back p, and I never plan on doing that, unless they change their staff. \n\nOverall:  in the less than a year time I have been posting, this is my 111th review, and I have only given one other 1 star, so I don't give them lightly.  They really need to retrain that waitress, or just get rid of her. I won't be back to eat.  Might come back with friends to grab a beer at the bar.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 1,
  "date": "2015-01-15",
  "useful": 2,
  "cool": 1
}, {
  "funny": 0,
  "user_id": "DPuzlVDpOBu0vLFWbocEhg",
  "review_id": "_ptPNxmnyvNYYWns4JyBww",
  "text": "We've been here several times before and have had great service . This time ? Yeah WTF? The waitress couldn't be bothered to even acknowledge us . If it had been busy I get it but not even close . Epic fail . Very disappointed .",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 1,
  "date": "2015-08-11",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "3Vd_ATdvvuVVgn_YCpz8fw",
  "review_id": "yghUzkNr3rRxzmICCsioag",
  "text": "at Palace @stationcasinos on St Patricks Day for Corned Beef,Cabbage, Red Potaotes and a Pint for $12.\n\nThis bar REALLY gets to rocking with LIVE entertainment and HOT waitresses dressed in SHORT plaid skirts.\n\nGreat Beer Specials and the food wasn't half bad either!! The corned beef was good a little dry but good, the potatos slightly hard and undercooked and the cabbage JUST right. Overall all tasty enough for this Irish tradition and it didn't hurt it cam with a PINT:)",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 4,
  "date": "2010-03-21",
  "useful": 5,
  "cool": 3
}, {
  "funny": 0,
  "user_id": "-7Ww7NzE3m8GzMbbykcZQQ",
  "review_id": "ZH3DZofrN8zwd2dQYnplJg",
  "text": "So came here cause we saw as an \"announcement\" on yelp from the oyster bar that if u bring ur receipt u get 2 for 1 pints.  We walked in and immediately the bald bartender was a DICK and said he had never heard of it: I showed him the yelp announcement and he still acted like a prick, he even pretended to call his manager and was still unable to give us the deal. I guess there was a reason the place was dead! The female bartender was cute and wanted to help but unfortunately the bald guy called the shots.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 1,
  "date": "2013-08-21",
  "useful": 0,
  "cool": 0
}, {
  "funny": 3,
  "user_id": "vnDCI1OfG_6fKh7vPbjeOQ",
  "review_id": "Ltga_KnkpHs0vt2wUFdBXA",
  "text": "If anyone goes to Palace Station I highly recommend seeing Samantha as she is a top notch bartender. Friendly, honest, quick service, helpful with info. And all around good bartender if ya wanna get piss drunk and talk shit. \n\n\"CAT\" ON THE OTHER HAND was horribly rude to my Australian friend and even though he was not intoxicated, or rude, was gambling consistently, she said he wasn't getting another drink because he wasn't \"gambling enough\" even though he had been there talking with another waitress for over and hour, and was told he we wasn't gambling \"progressively enough\" and even went out of her way to be confrontational. To the point of making him feel like a cheap piece of shit. And ultimately leave the bar. He is a nonconfrontational person, and tips well. I even told Cat she set back relations between our countries  50yrs.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 1,
  "date": "2015-07-11",
  "useful": 1,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "5fuxYOEjyOoa1c-llPFMtQ",
  "review_id": "bvqfZrszhus3H4P2Y_sdxQ",
  "text": "Joke. Sat at hightop just behind the bar for about 20 minutes and had zero interaction with staff. Left without ordering anything. One waitress and one bartender both of which were nonexistent.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 1,
  "date": "2013-12-02",
  "useful": 0,
  "cool": 0
}, {
  "funny": 2,
  "user_id": "q-v8elVPvKz0KvK69QSj1Q",
  "review_id": "gxTlBmsawrIEjYFy0Umxpw",
  "text": "Not our typical place we would go to, but we had to meet some friends here and they were late, so we decided to check it out based on a sign we saw for Happy Hour.\n\nIt was dimly lit and basically seat yourself, so we found a booth near the back. The waitress came over and I complimented her on her outfit ( schoolgirl plaid skirt and top ) she was quite friendly. \n\nThey had 2$ well drinks on special, so I ordered a gin & pineapple. \nWe also ordered nachos and chicken wings which were only 5$ each during Happy Hour. \n\nThe food arrived fairly quickly, and we were really impressed with it for the price. It was so good ! We had a few more drinks and then got the bill. \n\nIt was under 25$ for everything. One of the least expensive meals, and one of the better tasting ones. I guess when you go in with low expectations, you can be pleasantly surprised.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 5,
  "date": "2016-12-23",
  "useful": 4,
  "cool": 5
}, {
  "funny": 0,
  "user_id": "vWP8-aQX0rYJszqkWVL7Ew",
  "review_id": "3W38lfRTeoLJWoIc12sK1w",
  "text": "Friday night at a Irish pub, drinking Irish brew, and listening to Irish band awesome. Jack's is a good place have some fun. Enjoy the Vegas bar pub scene with some good people and not crowded to the point your bumping elbows with everyone around you. Darby O'Gill & The Little People who usually plays here Friday nights was pretty catchy band. \n\nForgot what I was drinking but it was reasonably prices. I loved the atmosphere and decorations. I didn't try their food but I'm sure they have some corned beef cabbage, maybe next time I'm there.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 4,
  "date": "2011-08-07",
  "useful": 1,
  "cool": 0
}, {
  "funny": 2,
  "user_id": "Ae4uXwFHp-5fGrt6OONaXw",
  "review_id": "KZIcEupsKiXj4GJq7DYfeA",
  "text": "After going to see a show at Palace Station that wasn't actually happening the night we went, my husband and I stopped into Jack's Irish Pub with his brother for some drinks and a bite to eat. \n\nThe guys wanted a beer, and $12 gets you a 50 oz. glass of beer, and you get to keep the glass. Refills are $6 each, making this deal a no-brainer!\n\nWe also had some sliders and potato skins.... All food was $5 and you could taste why. Go for the beer, skip the food.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 3,
  "date": "2010-12-28",
  "useful": 6,
  "cool": 3
}, {
  "funny": 0,
  "user_id": "ipqEcqA1MMWPE9QR4izj-w",
  "review_id": "G6pnfN3eFRupMIBCIQBVVQ",
  "text": "Its supper dissapointing. We just to go there cause we have station casino card. And it became our favorite spot for my husbands day off. We loved the happy hour and the food. Our favorite bartenders were Neil and Ian. One time we were playing on the machines from the bar one for each of us. That afternoon was Sergio behind the bar, constantly ignoring us and being rude. At the end we ask for the check and they had charged us the complimentary drinks that it supposed to give us from the tickets they give you from the sports book. Full price, they even wont respect the happy hour prices. We had to tell the manager and then he fix the situation.that time we were showing a friend the place. He was like id rather go to the orleans on monday football.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 1,
  "date": "2017-05-12",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "n_WcdtW3XUkxy-zigNDCog",
  "review_id": "wUuM0gRZ4sBRY8ZCW8Y2ZQ",
  "text": "The last time I went to Vegas, I stayed at the Palace Station because the hubs loves the Oyster Bar (You MUST go!) and I got a great deal and the room which was really nice.\n\nAnyway, while exploring the hotel we stumbled across Jack's.\n\nHummm....Love this place.\n\nThe bar had video machines there, so played some video poker and got free drinks - and we're not talking watered down ones  :-)\n\nI've been  into Vodka lately..... well, they just happened to have a nice selection and the bartender gave me samples of each along with  some details about all of them.  NICE!   After having my vodka lesson, I've decided that I'm a Grey Goose kind of gal  :-)\n\nOh - BTW, they have happy hour and live bands.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 4,
  "date": "2010-05-01",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "G_lPEjqZ9bYbnwuwkfqfOw",
  "review_id": "Y9E62v_4wQVhEL9KxW2QeQ",
  "text": "Stopped in tonight to kill some time and grab a light bite during happy hours. Jammie, our barmaid couldn't seem to get it right on more than one account. My wife and I had trouble putting cash in the poker machines.. Jammie helped get the two $20 bills in the machines that we played. We ordered our drinks and were charged 10 bucks while playing. I asked if they comp'd drinks and she said yes, but you have to play $10 to qualify. HUH?? We just played $40- We ordered Nachos and were brought Irish Nachos (french fries w/ bacon and other crap on it). Oops, my mistake again, I guess!\nNo apology, no comp, NO WAY will we return.. Bummer.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 1,
  "date": "2012-01-28",
  "useful": 0,
  "cool": 0
}, {
  "funny": 0,
  "user_id": "AGzKshnDvXEqLr8N4SYKeg",
  "review_id": "bEnqj9Csfqk50yYVgBQptA",
  "text": "This Irish bar is pretty typical for a casino.  I.E. there isn't much Irish to it.  But it does have a decent selection of beers.  Sometimes they bring in very weird bands or groups to play music.  I would say it would be worth stopping by and grabbing a beer.  Plus you can keep the glass.",
  "business_id": "NoSj3hV8Rlz_gUsOL4_EjQ",
  "stars": 2,
  "date": "2011-03-25",
  "useful": 2,
  "cool": 0
}]
