[{"funny": 0, "user_id": "FxKtjVjH0zif_Y0cw39Crw", "review_id": "4ycNnk1gBsX4hL4y1r_FBw", "text": "Very authentic Thai cuisine. Best meal my husband and I had in Vegas during our trip. They don't take short cuts in making the food. The waitstaff was very friendly. The owner came out and talked to us. I highly recommend this place.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-04-22", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "250RPsQIRjUsaHFQmXIkYA", "review_id": "si9my9Z1tl5wKs3jL6ulEw", "text": "Excellent thai food. We ordered chicken satay, fish cakes. Fish cakes could have been less oily though. We ordered chicken panang and mint meat for our entree. Excellent. Right quantity, right flavour. I could not find anything wrong in the dish. The owner Ken is a young humble guy and his restaurant  should do well with the good food, service and prices he is offering.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 4, "date": "2016-03-27", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "NFodPTpbWK7dSymxaBiUXg", "review_id": "faW2HPKFSvusZfMsbwvZ2A", "text": "Authentic Thai food!!! \nWe tried this restaurant with a great Groupon deal and so glad we did! It's now one of our favorite restaurants! We ordered eggrolls, larb, crab curry, basil beef,  chicken pad see ew, and thai tea, all were delicious. We liked it best because it wasn't over powering with fish sauce on everything. \nThe service was great the lady that helped us was nice and very accommodating. I highly recommend coming here and we'll definitely be going back!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-03-24", "useful": 2, "cool": 1}, {"funny": 1, "user_id": "owlUazXSDLaxlOV7z8181g", "review_id": "Hf7eR6qnfCDSBJJ1_GRfgw", "text": "Wanted to have Thai tonight with our friends to celebrate a birthday and the choices were Lucki Thai, Table Thai and Bistro and Kinthai!  Since some of us had been to Lucki and to Table Thai, we decided on Kinthai as a new experience to all.\n\nLocation - East Sahara and Valley View, about one block past Weera Thai.  Some decent parking. Always an interesting area, that East Sahara strip malls.\n\nThe Restaurant - Nicely decorated, about 10 booths and about 5-6 tables. Spacious and plenty of room.  They can accommodate groups of most size and if you have a large group, it can be quite good for that!\n\nThe Service - Seems family owned.  The owner or gentlemen that comes out to greet you seems to be very concerned about quality and style of his restaurant.  We were well into our conversation with our friends, so I did not engage with the owner as I normally would.  He came by several times to check on us, and that was great. We just did not speak too much with him as we were catching up with friends.\n\nThe Food -\n\nTom Yum Chicken - Spice 5.  I wanted to go higher, to 7 or 8 but we had a mixed crowd.  All the soups seem to have a shrimp base, and one of our friends cannot eat shellfish.  However, my wife who doesn't like spice at all thought the soup was the best compared to her other favorite places. I thought that the soup had the right amount of kick to at least feel the heat and so i was happy.  Very excellent soup, comes out in a metal soup hotpot with the flames blasting through the top. Just the way i like it.\n\nPad Kee Mao - This was good but hardly spicy.  Normally a spicy dish itself, due to most of our friends not wanting spice, we ordered this at a level 2 spice out of 10 and it was good, just that I needed a bit of a kick in the spice and didn't feel it.  We had this with beef and the beef was tender. The noodles were good, but a bit clumped together.\n\nMassaman Curry - With Chicken, spice level 2, good, rich creamy yellow curry with peanut, I thought it was very good overall.\n\nBasil - With ground pork. again spice level 2.  Good overall, lots of meat, not too much basil.   I would order again or ask more questions like if they have eggplant and such.\n\nSteamed Whole Fish - Not bad, liked the fish, bones and head came off quite easy and everyone enjoyed it. I tend to like steamed fish to be very juicy with lots of juice, soy sauce a bit of oil.  This was  a bit drier than I am used to but I did like it overall and I really enjoyed the amount of ginger they give you.  Of course I prepped the serving by deboning the fish and removing the head and I used my plate for all this so I can clean up the bones and the head of the meat which to me is the best part!\n\nLoved the attention, enjoyed the menu, the ambiance, the flavors. Totally enjoyed the soup.  Would it be my most favorite Thai place? That will depend because tonight, we are going to Lucki Thai and will let you know!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 3, "date": "2016-04-03", "useful": 4, "cool": 2}, {"funny": 0, "user_id": "JaqcCU3nxReTW2cBLHounA", "review_id": "8UdvQbHmvg_d0xLB2eJhBg", "text": "This review is for 3.5 stars.\n\nNothing bad to say about Kinthai, I just have to compare it with the plethora of other Thai restaurants in the city and it wasn't in my top 5.  \n\nMy meal was tasty, spicy, and very fairly priced.  I had the stir fry with pork and the larb salad.  I got mine extra spicy, and it sure was.  They do a 1-10 sliding scale; I got an 8 and it was an eye rinser - delicious and deadly.  The outside and the mall outlet it's in are a little run down, but the restaurant itself is very nice and comely.  \n\nKinthai is a solid option if on this part of town.  They have a great $7 lunch special which I would recommend, actually.  But in a town full of outstanding Thai restaurants, I'm going to play the field.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 3, "date": "2016-03-09", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "GelfFty1_TeqtED1TGEdMg", "review_id": "PGQu1ekxg71wjRFDi9h-RA", "text": "Great Thai food.. Ken the owner is kind.. Great food with a great atmosphere.. Very reasonable priced", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-02-14", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "b5uG7MVEFBB21UReDEPlMQ", "review_id": "4yG6t2I_WZZm2mkJddudoQ", "text": "Hands down some of the best Thai food I've ever had. \n\nSuper clean restaurant, great theming, super nice staff, and AMAZING food. \n\nI recommend the Panang Chicken. Great portion size and superb flavors. \n\nKen the owner personally introduced himself and welcomed us. He also told us about how he follows traditional recipes from Thailand. \n\nOverall, best Thai food I've had in Vegas. Can't wait to come back!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-01-14", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "9kElsBhkHl-EzJo2gIZv2w", "review_id": "R2WMZTUvYC8DEoeoAbVakQ", "text": "Great service and great food! Spicy level is on point here! We ordered: Fish Cakes, Basil Meat, Massaman chicken curry are good and we also ordered the Shrimp Padthai (Just ok).\n \nThe Basil meat and Massaman chicken curry comes with a bowl of white rice each and if u switch the white rice to brown rice there is an extra $2 (just a friendly reminder not list it on the menu)!\n\nOverall food are good and service are great with that said we will be back & DON'T LET THE OUTSIDE FOOL YOU INSIDE THE RESTAURANT IS NICE", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-02-02", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "BY4I-bhCUC-lRCV0f3UYtA", "review_id": "QmqZDIZMwBm2f9e6kVzeUw", "text": "Only complaint is that it's far from where I live! Food was amazing and really good portions. Thai food is my favorite so I'm extremely picky but this place was beyond amazing! Oh and did I mention suuuuuper good prices! Definitely a must if you like Thai food :D", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2015-12-30", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "tA7mBbT_UEoEUL-U-hJ2Jg", "review_id": "tLG5QHhYUMZOBWfRmg4Zog", "text": "Probably the best Thai I've had!...And there is a Groupon for it.My new fave place for dinner.Dont let the bad strip Mall put you off....", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-02-22", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "jIoycgNi1aXG7adbsmsquw", "review_id": "zVikw1s7xWxnNckuWPzhTQ", "text": "Highly recommend this place! The food is very impressive and the service is amazingly awesome! I would definitely come back here and invite all friends and family members.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-03-02", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "Gab1_sLsjJLAJojoFd-d-g", "review_id": "BBHsY0yQBuXPO4WLrR1FDw", "text": "Very tasty.  Pad Thai is good.  Tom kha soup has excellent flavor.  Red curry was also tasty.  Dinner portions are generous.  Service was good - very friendly and helpful.  Decor is nice.  Prices are reasonable.  I'm interested to try the lunch specials next time.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 4, "date": "2016-02-20", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "FlcFiUdMqrnBK35_TTyF_w", "review_id": "wmocQSskXPuN5ONR8ib_8w", "text": "Awesome food. Small restaurant in a small shopping plaza but don't let looks fool you. Probably the best Thai food I've ever eaten. Very authentic, fresh and flavorful. Also great customer service. You won't be disappointed.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-03-15", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "u4PqNrboclyb_B8ZoIJCfg", "review_id": "nnqVYqv7vr2Tq2SaQAPSdg", "text": "Wow! Sooooooo good. Best green curry I've ever had. Service was amazing as well. Hidden gem, check it out!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-03-26", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "L8P5OWO1Jh4B2HLa1Fnbng", "review_id": "einFcQmEcCPtTnmrCaXPJw", "text": "There was no one in the place so the chef/owner engaged us in conversation both before and after dinner including a display of his tattoos that mirrored the mural on the back wall. The menu is pretty much what you will find in every other Thai restaurant so we ended up with shared orders of Pad Thai with shrimp and stir fried basil chicken.  Both were well executed.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 3, "date": "2015-12-28", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "gYauBXTFvIqR881KFGULaA", "review_id": "nJR4VVr001XqZD8Q3IjIcQ", "text": "Tried this new restaurant today for lunch with a friend from Bangkok and another from Vancouver. Had the Pad See Ew and it was delicious.  Ordered it with a level-2 spice to make sure it wasn't too hot for the first time.  It was perfect. The chicken was cooked to perfection and very juicy and tender.  My friend from Vancouver had the Boat Noodle Soup and my friend from Bangkok had the Tom Yum Noodle Soup and both said it was very authentic and fantastic. I would recommend this restaurant if you are looking for traditional Thai food.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-05-28", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "hM3oEy9HoC_uQExSdwUysg", "review_id": "iAzbx19EjNt5-_lV-QSiAA", "text": "Walking in, I noticed that the decor seemed traditionally Thai. Everything was really clean and new with the restaurant being less than three months old.\n\nMy meal started off with the owner approaching us and introducing himself to us, Ken. He talked with us and let us know that everything was made in house. The recipes they used are traditional and after tasting them, you can tell it is different than most other Thai places. Ken recommended to us trying the fish cakes and chicken wings. The fish cakes had a slight crisp on the outside and a chewy inside. The chicken wings were marinated overnight with their own recipe and had the fried outer layer and a nice tender inside. After came out main dishes. I ordered the panang curry and the rest of my party ordered pad thai. The panang curry was really good. It was a bit sweet and had a nice strong curry flavor that was aided by the coconut milk. The pad thai was good as well, but different than most commercial Thai places. The fried egg roll and dumpling that came with the the lunch special were fried to perfection and were nice and crispy on the outside, with a soft inside. After out lunch, we had dessert, a chocolate cake. Ken let us know that all the desserts are made in house by his wife since his wife has a baking background. The chocolate cake was absolutely delicious. To say the least, it was a great ending to our lunch. \n\nI enjoyed my meal quite a bit here, along with talking to Ken. He made me feel really comfortable and I will definitely paying them another visit in the future.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-01-09", "useful": 1, "cool": 0}, {"funny": 3, "user_id": "5E_jlZN9wDciEvRGzc1TsQ", "review_id": "95Tnf7KBn5uGscx8gTSeqw", "text": "I ordered Lunch special Padthai Shrimp with Chicken satay and Spaghetti green curry on Wednesday. Their foods are very small portions. Padthai for lunch portion seems like I had only couple bites and then all gone. I know it's only $7 for lunch but the portion is too small anyway. Amd I think they should have lunch special like 7-10 things for choosing. They have like 3 things for lunch and everyday is difference. Like if I want Padthai shrimp and chicken satay I have to come on Wednesday only. So I don't think it's good choice. So I don't think I will come back.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 2, "date": "2015-11-13", "useful": 1, "cool": 0}, {"funny": 3, "user_id": "uG22UT-PeVD32lN0DGuUBg", "review_id": "wUA6q92Z-3Ecopc8TyKeBQ", "text": "This is our first time here.. The service is great. The newly renovated environment is very inviting. The food is authentic. If you are here in Las Vegas, we highly recommend this place. Try their banana cake.. It's to die for", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2015-10-31", "useful": 0, "cool": 1}, {"funny": 0, "user_id": "8Hp9sHAS50hg6Ecovj3CWg", "review_id": "RcA2lYFDpqQXCwjgVDSSJw", "text": "Got lucky enough to stumble upon Ken's place when he first got started. Can't say enough positive things about the food and the service. It's always incredibly clean and pleasant, and my favorite dish is the Panang Curry. A place where I always feel like a valued customer; it's now my go to spot for Thai!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-04-03", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "9FOoRxg1aHOlvzyUlRLr3g", "review_id": "PBXbui6XLunKx_Ykscg-fw", "text": "A co-worker was raving about this new restaurant and told me to check it out. Knowing how snobby she is on where she eats and her excellent taste in different types of cuisines, I decided to take my family out to dinner to this place last month and immensely enjoyed the food! It was such a pleasant surprise! We were truly impressed by how everything was prepared and how they tasted! Our server was very friendly and attentive and even introduced us to Chef Ken. As the saying goes, \"don't judge the book by its cover\", the area where it's located didn't look appealing but once you step in it's like being in an upscale restaurant. It's quite a drive from where we live but it's worth the trip so we will be back!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-03-27", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "oy87_uQ2DlUgBtKS9xUzDw", "review_id": "QL8XgPW9iBkHPiOenhpqUA", "text": "This probably be my go to Thai food place. We had the following:\n1. Pork larb \n2. Shrimp tom yum goon\n3. Yellow chicken curry\n4. Shrimp pad tai. \nEach one of those dishes were absolutely delicious. I think it is better than the Lotus of Siam. I made the mistake of ordering 4 dishes, because they were so good I ate them all. I couldn't move because I was stuffed.  I would definitely recommend going to this place and go on a empty stomach so you can eat.\n\nYou really get you money worth for the quality and flavor of the food.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-01-16", "useful": 2, "cool": 1}, {"funny": 0, "user_id": "V0LJ8YCJ2qsnGoUppDRdBA", "review_id": "ugH1zD8Lt314ar_TaZ1GuQ", "text": "This is my first and second Thai food experience and I'm glad it was here.  From the outside, it looks like a hole in the wall.  But it's just great!  It's calm inside and although not perfectly decorated, you can tell they care about their presentation.  The service is EXCELLENT!  Very nice and they are very quick to refill waters without asking, checking back often, if you even make eye contact at all, they'll likely come over.  And the food is great too.  I'm not able to handle a lot of spicy and I ordered a 5 thinking that's middle of the road, but it was a bit too spicy for me.  It was doable and still good but I was chugging water.  I'd say go lower and then add sauce to it if need be. My mom came with me this second time and she usually never compliments anywhere, and she made a point to let our server know she'll be coming back.  Must try!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-05-27", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "yYTGloQyisaBW7xrLM56_g", "review_id": "A9gf36_nwMiWIoEn2WimMw", "text": "Pad Thai was so tastee & large. I could not finish , took home. Very clean, prices are really good. My wife is thai, she liked her noodle soup, I thought it tasted smoother than some other places, my cream cheese crab puffs were still good at home later. Nice owner, large booths.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-05-17", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "tp2W80ysK4pv8UgqqNFaWQ", "review_id": "r-4IlzevbR7ne3u_ZoDbjA", "text": "Randomly found this on Yelp.. Absolutely amazing :) the cashew dish was perfect. The waitress said it was her favorite, and I see why. Also ordered the coconut lemongrass soup.. Really flavorful and fresh. Overall it seems like good quality of ingredients.. Very homemade and authentic feeling, and talented chef with culinary complexity in the flavor profiles. Definitely coming back", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-04-18", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "aXfXguyE0f-tDOQYj7yPlw", "review_id": "9oLhIoZFGRSOYifl5l6KCw", "text": "Best Thai food in town! I order from here at least once a week, I work in the same shopping center, and the food is always amazing and the staff is very friendly and attentive. I have definitely gotten my coworkers hooked on their food as well.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-02-12", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "9HBhAEu9PuLm_P8pW4AYIw", "review_id": "GMMYQqEFRjaq4tCiV7PYhg", "text": "This small little restaurant has a very nice decor. The blood(liver +intestine) soup was amazing.  I usually get the shrimp Tom yum soup but took a risk. Glad I did and now I think I will order the blood soup at this restaurant from now on. The owner came to our table and he was very friendly. The papaya salad was good too. The basil beef and chicken pad thai wasn't bad either. But the dish of the day was the blood soup.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 4, "date": "2016-02-14", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "mRtWB6bekZqsbf5owT6IVQ", "review_id": "vn066k27wJAld9Ul1FJyJw", "text": "I love how the chef/owner is out in the dinning room making sure everything is perfect. This place is amazing and the food is spectacular. Just opened Jan 1st and we have been here twice.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-01-30", "useful": 0, "cool": 0}, {"funny": 5, "user_id": "bLbSNkLggFnqwNNzzq-Ijw", "review_id": "6BxQY4IyUm-hq7qL8EysAQ", "text": "When you're located in the same block as Weera Thai, you're going to have a hard time if your kitchen isn't up to par- the dining room is nice and going for a more upscale vibe, but they have cheap ($7) weekday lunch specials. But unfortunately the food just wasn't up to par for me.\n\nFISH CAKES APP: 5/$10 Small, oily, and a bit bland. I enjoyed the cucumber dipping sauce but this didn't pop needed a hit of acidity or something.\nPAPAYA SALAD: BF requested this and devoured the entire portion. Sauce was slightly spicy, did not like the half-frozen green beans used though.\nCRAB FRIED RICE: This was listed on the board as a daily special. Portion was large enough, and I like that the extra bit of attention and effort were put into presentation even though this was a takeout order. However, I asked for a spice level of 5 (on their 1-10 scale) and this had no spice whatsoever. I ended up dumping two cups of chili paste and some red pepper flakes into the dish to give it some heat. It's a huge pet peeve of mine to be asked for a spice level and then not even take it into account when cooking the dish. It was even on the receipt so I'm not sure who dropped the ball.\n\nLocated in a blink-and-you'll-miss-it spot on Sahara next door to a leather goods shop, it's not necessarily a place I'll return- the food was fine, but didn't have anything about it to stand out from the sea of other thai places on the block.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 3, "date": "2015-11-08", "useful": 12, "cool": 7}, {"funny": 0, "user_id": "8dxkcmAXY4ttrVFD1GhbdQ", "review_id": "Ux8xcoHVJyAv6_pPoD1EvA", "text": "It's a higgen gem located in a run down shopping strip on Sahara. \n\nI heard about this place through my boyfriend. The first time we stopped by few weeks ago, it was closed. I  called them today but noone picks up the phone. Anyways, we decided to drive there. \n\nThe place is small and with cute table settings. Pleasant Thai music were playing in the background. The menu looks to be authentic Thai food.\n\nWe went there for lunch and it was served on time. We ordered kinthai chicken wings, very crispy and good, comes with a sweet sauce. They sliced the wings into half which was interesting. Pad see Eww with pork was equally palatable and Kinthai fried rice was gratifying too.\n\nThe spice rating is 1-10, and it usually comes pretty spicy. So I like to down the spice a notch and get the spice tray.\n\nThe service was good. The girl gave us suggestions on the food that helped us, she was nice and very accommodating. I highly recommend coming here and we'll definitely be going back to try other items on the menu.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 4, "date": "2016-04-30", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "ScwVhHmUFLZwVW9E5fvKjw", "review_id": "cLHXaTTWwmntpsb8EgGKew", "text": "I originally wanted to go to Weera Thai after hearing good things about it and seeing wonderful photos and reviews, but ended up coming here with my fiancée who bought a Groupon for this place. We ordered the pad Thai, masaman curry with chicken and fried tofu, and garlic beef. The pad Thai was okay, nothing special. It had shrimp in it that obviously we're not fresh. The masaman curry had a good flavor, and it was my favorite item. No complaints. The garlic beef however....was so chewy I ended up having to swallow the pieces practically in their original form. I could not masticate them if I tried. Which I did, for around 5 minutes before my jaw started hurting. The flavor was good, but the quality of the beef was terrible. Terrible. I would not return unfortunately, but I look forward to trying Weera Thai down the street from here.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 3, "date": "2016-03-20", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "Bet1qVniQY7FX8UFuUCVMw", "review_id": "vJKWuQFH0q55qkrvjEib0g", "text": "Best Thai restaurant I've been to in awhile. Amazing customer service! I went two days in a row! New favorite and KinThai will definitely be a weekly spot for me!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-09-30", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "hebSyuC8IQ-PfK2Umuawjg", "review_id": "GJgN5Yw6OIFWgeA75zxBhg", "text": "Found this nicely cozy restaurant on restaurant.com website...\n\nFood was great, very nicely decorated, clean and attentive staff. Cozy restaurant...\n\nWill visit next time i'm in Las Vegas and try more of their menu...", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-03-23", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "txE6KOsO4v5_2zn2ph_4GQ", "review_id": "p-vuGRGW5U9avsVwdb_lCg", "text": "This place is amazing.  I come here at least once a week with my sister.  The food is authentic. The owner is super nice and always pleasant.  If you are looking for authentic Thai food this is definitely the place.  Honestly the best Thai food know Vegas.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-08-07", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "GcnwR7L6hMIn1e-7maWF2A", "review_id": "_B3E6C_oXeIDEoOHFpZeAw", "text": "One of my favorite Thai restaurant . Food is delicious and tasty. Try their papaya salad and crab fried rice- soo good. Place is elegant and cozy. Would definitely go back.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-07-20", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "pBhaCEcdbdDv76kMwm8Nng", "review_id": "PVi9CYX-ZQ1xz2ZrTyMCkg", "text": "Got groupons for this place.  To be honest, we never would have tried this place if not for that. The part of town it is in, is not the best, but...that said, the food was excellent, and we will go back....once there is another groupon, or when we're visiting the hood on the other side of town :)", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-05-03", "useful": 1, "cool": 1}, {"funny": 0, "user_id": "xR0bMuWzcsTREKfiypC_nw", "review_id": "Cu_dHt4pa3cEC3CX4qBmHA", "text": "This Thai restaurant is very good and delicious.\nVery clean and you can have a nice time. I love this restaurant.\nIf you like Thai food. You have to try at KIN THAI ^^", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2015-12-09", "useful": 1, "cool": 1}, {"funny": 0, "user_id": "EQMNB_FcB4M1fzfksyLIIw", "review_id": "yLNnxhK4jwMhz_F5XX6f7w", "text": "Our first time here and we're using a Groupon. Great and fast service, great people and amazing dinner food. Good atmosphere and decorations once inside the place. We ordered chicken satay, fried rice, and others, tasted great and left with our tummy full. The prices are at the low average, nothing unreasonable. The location is not a well maintained and it is an old strip commercial complex. You'll have to slow your driving speed to find it or you'll be lost.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-04-05", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "8Y0JqUWbMf2-r3A20cchbA", "review_id": "e4vyjhsJBGlq6EOprGkY8w", "text": "I came here with a small group of family friends during slower lunch hours of the day, and we were nearly the only people there. the atmosphere was crisp and clean, the music being a loop of truly neutral marimba-only jams, however, the white walls above our heads were quietly begging to be decorated. the waitress was friendly and the service was perfectly adequate. I was eating here with three white people, one of which was a tweenage girl who complained that everything we ordered was spicy, (it was all under a 5), but I enjoyed myself. this particular place puts the straw mushrooms into the soups rather than just regular ones, which I really appreciated. the only item of questionable quality was the seafood in the kinthai fried rice, which was cooked to displeasing texture despite the good flavor of the rice itself. overall, I enjoyed the dining experience and would say it's worth your try if you're in the area and looking for good prices and a relaxed neutral environment.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 3, "date": "2016-03-05", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "bIw2bHKYXokpA0jsqtKetA", "review_id": "J6J3wR2QruVY5umkc8z0_w", "text": "Thoroughly enjoyed our meal!\n\nWe had pad Thai, tom yum fried rice, red curry, tamarind seabass, crab rangoons and pot stickers. I would recommend everything but the seabass - it wasn't my cup of tea. The tom yum fried rice was a highlight that I haven't had elsewhere. \n\nIt's in a rough area but is clean and nice inside. \n\nAll waitstaff were pleasant and attentive.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-02-05", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "56DO5zTZb6YiLmkvcAjXIQ", "review_id": "E8ldfkPScdOLEVnM33IsSw", "text": "Excellent service and great food at a great price. We tried red curry, phad thai and pineapple fried rice. Everything came exactly as we ordered. They also did the vegetarian versions of what we ordered with the right amount of spice. Highly recommended!!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-02-16", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "DWeL9p6XzI-s3DNveFILHw", "review_id": "HCjbfSFqZOPo4EBegpf4nQ", "text": "What a surprise I encountered as I randomly stopped in here for lunch! The food was perfect: well executed dishes plated pleasingly and the 7 of 10 spice level I asked for left an impression but didn't linger past its welcome. Warm and inviting ambience for this hidden gem tucked away in an unassuming strip mall. Bring all your friends! This is great Thai food. \n\nGreen Curry chicken lunch special \nSom Tum: papaya salad", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-06-15", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "kGDYTyh-umSKg-cmKOmIXw", "review_id": "9G5lI8jnMjbUxoA08815GA", "text": "For me It's the best Thai restaurant in Vegas!!! Such a delicious food. Quality of service and food on high level . such a great atmosphere. I will comeback there again .  I would give 5+ . Thai food lovers it's a must go place .", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-03-06", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "n5a1IrgdBetxUKf-f7w2-w", "review_id": "C0CnkliO53yWuYhoweXlHg", "text": "I am absolutely hooked on the \"Pad See Ew\" dish here.  My wife and I discovered this place a few months back, and we eat here (or take out) at least once a week.  Great selection, low prices, and even a nice atmosphere.  Most of the nearby restaurants are very tiny and lacking personality, but this is a great hidden gem.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-05-24", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "DePzetkBAkF9j4YFzqYpEg", "review_id": "9vCoKz5Px45uyi8MGbCMSg", "text": "I love Thai food and when I saw a new place had opened near me, I had to check it out.\nThe location is easy to find with plenty of parking.  Inside the decor is clean and relaxing.  \nWe were served very quickly and our server was very knowledgeable about the menu.  \nWe ordered satay, pad Thai and panang curry and each dish was great.  The owner came by and explained how the dishes were eaten in Thailand and showed us a few good techniques to enjoy our food more.\nAll in all it was a great experience and we will but coming back.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2015-12-23", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "whZfm2quSRffthnn-llBHw", "review_id": "uvTCAJdrk466HwmG7_zJqA", "text": "WTF raw chicken in the Satay. Wish i did already have health issues as this can make me really sick. Dozens of Near by Thai places that do better.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 1, "date": "2016-02-19", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "nhuAYwF8Eyrct4f07TaPzw", "review_id": "cWcGOVS0Q99r5szTzRudSw", "text": "Great food,and great customer service,I recommend this place its fancy and affordable prices", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2015-12-18", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "Ufbk-jgQ2nqEt0fgnPZp6g", "review_id": "DJ82Mbwlz270lq8apOVUqw", "text": "It's new ownership , food tastes even better !!! and it looks very nice inside !! \nthis is the only place that I eat Thai at !", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2015-11-12", "useful": 1, "cool": 1}, {"funny": 0, "user_id": "BFdUn9bY1KfgYCTDvcwvLQ", "review_id": "OmOCAi1_c7rXt35pnWGaXg", "text": "Against my better judgement we continued to eat here after first walking in. The smell when you first walk in is a cross between strange cleaning product smell and no cleaning product smell and at 8pm on a Friday night the place was completely empty... as in zero customers. The pot stickers appetizer didn't have a lot of flavor. The spicy basil pork with a side of white rice was good, not the best I've ever had but it was good. The beef satay was not good...didn't have much flavor and was about as tender as my high school prom shoes. The wait staff were friendly and accommodating but with no one else there to wait on, we got great service. The entire time we were there only one other couple came in to eat. That made us a bit suspicious as to what others know that we didn't...", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 2, "date": "2016-07-09", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "FBCwIMBXt3xmi8EKUhFl1A", "review_id": "jgBzuIpKneOVjmvjSsqzpQ", "text": "What can I say besides the food is the best Thai I've had outside of Thailand. Very authentic and reasonably priced. I asked for the crab curry and requested a 6/10 spice because I enjoy spicy foods more than the average American. My dish arrived with the perfect amount of spice. Not too hot but nothing weak either. Will visit again to try the other dishes. The spicy coconut soups are a must have.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-06-12", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "39XaTQQFm0oH5doCEDFhBg", "review_id": "TcEVTjt2IXnvNqY2kOUFIQ", "text": "This is the best Thai restaurant ever employees are very friendly it's clean,decorated nicely, quiet with a great atmosphere,most of all food  tastes wonderful and the servings are generous. It has only been open for 6 months. I want to see this place be a success please everyone come here to eat and trust me I'm a fat person I wouldn't lie if the food was bad.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-04-21", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "kMllj-8cngemeh5nM9cR1Q", "review_id": "UYKi1Ow-tOo1wmus9tuzkw", "text": "Really fantastic flavors! Everything tasted so homemade.  I loved the Tom Kha soup. Every dish we had was delicious. The service was excellent and the prices were reasonable. This is our new favorite Thai place. Try the fried pork. It comes with Chinese broccoli. Yummm.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-01-23", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "EU7LYGu3Kf-z8XevfncytQ", "review_id": "cPu5YsHqV6xqu7t1Ef2Mog", "text": "Amazing cuisine with a friendly, inviting atmosphere. We have eaten here several times and keep coming back for more. Great prices, substantial portions and flavor that delights the tastebuds!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-04-03", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "uqZS6pYPSpGBp4Jh1jqOzQ", "review_id": "VW1H-4bo9as_9dPUxydFRQ", "text": "Very good thai food! My family and I had a groupon so we decided to try it out. The service was a bit subpar for how empty the restaurant was (server was in the back talking most of the time). The food was delicious! I had Pad Thai - very traditional and the shrimp was perfectly cooked. We also shared Satay and Tom Kha. Both were quite good. The plating for the Satay was clever - the skewers were on top of a slice of pineapple!\n\nI suggest it!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 4, "date": "2016-05-22", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "1VkkpPXrtjuW_Ryz6WezPQ", "review_id": "X3GQXOtd_oDC58dGRB9_Bw", "text": "Great lunch specials for $7 that came with a potsticker and an egg roll.  I ordered the pad see ew beef, my coworker had the drunken noodles with chicken, and her bf had the panang curry lunch special.  Everything was so good, the service is great since there was hardly anyone there, and the restaurant is nice and clean, albeit a little quiet (like a library).  The food is good, though, so I will definitely come back!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 4, "date": "2016-02-29", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "GPQEegLxfYuCew6HD5ff0w", "review_id": "UQ6UUW3zeZrUXG7W45p-9A", "text": "First off I am a huge fan of Weera Thai one strip mall over; however, this restaurant was lovely, great food and service.  It is a little fancier than Weera but priced the same. We will go back.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 4, "date": "2016-01-31", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "4pxnQjTrCbsAPi5qATq1Pw", "review_id": "ik1f3PA5sWBQS_zDs6j4MA", "text": "I've been looking for a great thai place in vegas and I think I found it! Everything was amazing! I ordered the tom yum , beef pad thai and papaya salad", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-07-24", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "0wepzjJLaFiaeA3pffoXdQ", "review_id": "4NpEwttvQKhcciTyEucZUQ", "text": "Real solid Thai food, not too sweet like other places. Authentic Thai taste. From the outside looks a bit run down, but inside is nice and classy. Good size portions also, reasonable prices for good tasting food. I would come again. Btw my wife is Thai and she knows what's real and what is catered to American tastes, the food here is made the proper way.", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2016-05-27", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "SyyYQfNQ4a4Lua5RBlggmQ", "review_id": "rTcAYjAlsHOkGTU5w2VUiA", "text": "Mixed bag here.  We ordered the pad thai, chicken masaman curry and garlic beef.  The flavors on all three dishes were good, my favorite being the curry.  The curry flavor was strong and tasted sweet and delicious.  The garlic beef also had a nice flavor and the pad thai had a succulent fish sauce glaze.  The problem though was the freshness of ingredients.  The beef was super chewy, like they used really a cheap cut.  The shrimp in the pad thai was stringy and chewy like it was from a frozen stock.  The second part that was dissapointing was the portions were a bit small, espexially the pad thai.  \nHope they improve their quality a little and it will definitley be higher scores!", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 3, "date": "2016-03-20", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "SgR_RMYoWUcLNiqsUFrjvA", "review_id": "LeokGcDfcRPfoWcvI-zqPQ", "text": "You will enjoy a really good taste in each plate, my favorite is sour & sweet . \nI recommend 100%.  ( clean and fast to serve ) \nAverage $8- $12 person \nVERY CLEAN AND FRIENDLY", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 5, "date": "2015-12-06", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "RXjAqzHCAQruP87o99DuDw", "review_id": "N_5_8pPlXd4iLUjHiA7IeA", "text": "Awesome choice for Thai in vegas....entrees $7-8-9 all tasty and authentic in the bangkok style.  They will ask you for your desired spice level....if you have been to thailand a 5 there will be a 7 here.  Like previuosly mentioned the owner Kin will come by your table and ask how you liked the meal.  Cant complain about anything....tasty, great value and smiling service...wish i could have paid in baht :-)", "business_id": "u29lf2yPd-qK5ThAS9FRQQ", "stars": 4, "date": "2016-05-21", "useful": 0, "cool": 0}]