[{"funny": 0, "user_id": "tL2pS5UOmN6aAOi3Z-qFGg", "review_id": "dr9fhsNLgzkUJY3oj2QK6g", "text": "I love a good burger! Can't say I love this place.\n\nI was excited to try this place when it opened. I made one visit there and haven't been back since. \n\nI don't remember what I ordered as it was sometime ago. Obviously was unimpressed with their burger. I do recall throwing the fries away they were disgusting enough to be memorable.\n\nOn the plus side the place was neat and clean, The staff was friendly and quick enough. The food just didn't appeal to me.\n\nWould I give it another try? I just don't think so unless someone else was buying.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 2, "date": "2013-01-23", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "aD263WOD4RShoqgvVhcKqQ", "review_id": "nNMgOB7BGxZEk0w46ozxIA", "text": "Smash Burger is my second favorite fast food burger place. Of course Fat Burger is #1. They have great burgers and fries here and I like the fact that they offer whole Wheat Buns.\n\nThe meat tastes better because the way they smash the burger on the grill. It Sears the meat and gives it that distinct taste.\n\nI definitely recommend Smash Burger.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2013-06-12", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "mZRv579CnBtG--OheLP_bQ", "review_id": "DoHkrJJVPffu924i6MLtcg", "text": "I have been to Smashburger a few times and have even ordered takeout. I will never dine IN again after yesterday's experience. 3 out of the 5 back booths were dirty with trays of food and the floor was also dirty. Yes, they were short staffed and finally a manager appeared but she should have taken over. Our server  was Akexandra and she looked miserable to work there. The burger was still tasty. I always get the \"sin city\" burger.The vibe has definitely changed :( Bachi Burger across the street wins.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 1, "date": "2013-03-10", "useful": 4, "cool": 0}, {"funny": 0, "user_id": "8q2tcW4HQXsrJK2ZkJcUkg", "review_id": "aZ47YsUNU-NcKctEj4AdvA", "text": "How can you not love this place? Love the smashfries, burgers, and hot dogs. Our go-to place for delicious burgers!\n\n(SO much better than 5 guys.)", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2011-08-09", "useful": 0, "cool": 1}, {"funny": 0, "user_id": "ZQ3Gr3FR9b3H1MJJJG8tuA", "review_id": "3N_blQUKuLCQooNmelM4ew", "text": "Its a nice alternative to other fast food burger places. \nThe add ons are killer! Talk about variety, and most are included with your price. Pile that burger high, or keep it as is.....whatever you fancy.\nIts a good place to sit down, and enjoy the time with friends, family, and company....or take it home with you (like im doing this time).\nThe vibe is good, and the burgers are good. Doesn't get much better than that!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2014-12-08", "useful": 2, "cool": 3}, {"funny": 0, "user_id": "w5bnlvDwF-vhsA6ENqxQAA", "review_id": "2tCCSiIigo16tZfIX9NOdw", "text": "A lot of people rave about Smashburger so I tried a few different locations starting with this one. I don't understand the hype. It was just okay.\n\nPros: Food made quickly, none of the locations was very busy.\n\nCons: The burgers are quite small. I brought this up and they told me some story about how they're smashed so it's the real weight or something I didn't understand, all I know is the patties are super thin and not very big/filling. The menu is very confusing, just imagine the opposite of the In-n-Out menu and that's Smashburger, a bunch of different screens that don't actually explain anything and it all seems the same. The burgers are overpriced, they're charging Five Guy's type prices but offering 1/2 the meat and 1/4 of the taste.\n\nWill not look to eat at a Smash again but wouldn't refuse if someone else really wanted it.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 3, "date": "2015-11-22", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "zwhty_ZmxbHAHoDfMjNbag", "review_id": "bwyehePAPr0L4j9AXHOMIw", "text": "Most people have heard of Smashburger, so this review will be short and sweet.  Every time I've visited a Smashburger location, my burger has been tasty, hot, and smashed thin, per the name.  I always get a yelp check-in discount, which is a perk, and service is usually good.  Smashburger is a little higher-end than most fast-food chains, as the ingredients used are a bit nicer and the quality of the burgers higher.  This place is good for a cheap burger fix that won't make you feel too guilty about indulging.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2014-12-29", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "Tf7APfEzH-UBw3r3p5JF7A", "review_id": "_q9cPAjtDVXJuMgxPC2p2g", "text": "Came in late on my only day off about 9:30 pm. Didn't have much expectation, but this place delivered. The girls helping out were very friendly. I didn't know what to order, so I asked what was good. The \"Smash Burger\" she replied. Without even looking at the menu, I agreed to the recommendation. Wow. Egg? Are you seriously awesome? Fries were o.k. seasoned, but crispy non-the-less. The only thing I didn't like --which may make others feel nice and comfy-- is the cookie-cutter atmosphere. Feels like I'm in the Smash Factory or P.F. Burger. lol. Other than that, good job guys!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2010-08-17", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "mY3mROf28N-vY1fpR-FFUw", "review_id": "rYHxlXUd-9uH-orztLOxfQ", "text": "I got so many recommendations from strangers to coworkers to give this place a try! Alright, Alright I've had enough! Came here the other day to have a smashin' lunch!\n\nSin City Smashburger: fried egg, applewood smoked bacon, american cheese, grilled onions, haystack onions and their own \"smash sauce\" on an egg bun.\n\n- I saw \"egg\" with burger and I didn't have to read any further. I ordered the 1/2 pounder. Pretty Damn Tasty and Salty might I add. The buns were nice and fluffy yet not too soft, bacon was ordinary (I didn't really notice much apple smoked flavor), medley of onions were great, their \"Smash\" sauce was green and creamy (not bad) and the meat was Juicy and Salty. I prefer less salt on anything I eat but the saltiness in this burger was obvious but wasn't tongue blistering salty. Overall, Still A Very Good Burger\n\nSmashfries: tossed with rosemary, olive oil and garlic.\n\n- ingredients sounded fun and it defintely was! Nice alternate from the usual ordinary french fries! Decent portion too!\n\nI would give this place an easy 5 Stars but the burger meat was just a little too Salty..", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2011-01-27", "useful": 6, "cool": 3}, {"funny": 0, "user_id": "G5HJ8ojD6Dx515m-eJYaXQ", "review_id": "PHg3orNfTPeoAbU4rapv6g", "text": "It's time to write a review since we eat here often. I think their burgers are some of the tastiest in town and reasonably priced. Their shakes and root beer floats are the best. Clean dining room and always someone around to bring out the food to your table fast.  Like SmashBurgers better than Five Guys and Fats Burger and they are way better than McDonalds and Burger Kings for sure.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2013-08-21", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "JslykpuuCDqRTbt5UtGcOA", "review_id": "Voe2qChaBx7fE2LAObw8gQ", "text": "Yummy! Had Sin City Burger on the Hawaiian style bun. Love that you can order the type bun you want, along with substituting toppings for ones recommended. The sweet potatoe fries were some of the best I've had. Were sprinkled with sea salt, garlic and rosemary - not the seasonings I would expect, but absolutely delicious. Service was excellent and prompt. This is definitly a place to return to!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2011-11-17", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "2VABkVdFhHGMo7wAqfofGA", "review_id": "nt3YBVqjodoARffmR-4SAw", "text": "I am trying to eat healthier portions and the burgers here are ginormous (and equally delicious and fattening). \n\nI ordered the kids chicken fingers w/ BBQ sauce, fries, and a small drink for $4. It was perfect! Chicken was delicious and I liked the breading a lot; you get 2-3 strips, I believe. Drinks are refillable, so don't worry about the small kids cup.\n\nAlso, if you want to try something different, get the fried pickles. I hate pickles, but fried ones taste pretty good. The boyfriend had the Cobb salad with crispy chicken and liked it a lot. \n\nI like Smashburger. I have been to other locations in town also. The food is good, with options for those who want to eat healthier (salads, grilled chicken). I recommend getting smashed here!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2012-02-23", "useful": 1, "cool": 1}, {"funny": 0, "user_id": "1PHVlRRHZmGTQQt4_zEBAA", "review_id": "ZfQtgDkGr2Kf58aK5e0FVw", "text": "I cant count the number of times I've gone to SB. Some of the times have been excellent and some have been \"fair\" and some have really p'd me off.\nI went in to get a smash chicken and sweet potato fries to go. Tell my why i waited 30 mins for my \"to-go\" order. I had to go to the counter and ask the manager where my food was and that i had been waiting for 30 mins for TO GO, She went to the window and grabbed a bag under the heating lamps. Why ask my name when you dont call it when my food is ready? She wasn't apologetic i had to wait that long either! My fries werent that good after 30 mins.\nAnother time i got the chicken sandwich and ate almost all of it then realized it was pink inside! I was not too happy. lucky i didnt get sick! I have learned from that and i cut in my chicken whether its in the salad or my smash chicken! Dont bother to do the surveys if you have a legit complaint *my raw chicken* No one ever contacts you. Although you do get a free side during your next visit. Maybe do the survey but if you have a complaint don't expect someone to call and see what was wrong.\nAlso i dont like the menu change! You used to be able to add any cheese to your burger or chicken at no charge. Now they wanna charge for everything. :( Even if your burger is supposed to already have cheese on it. I do love this place thats why i keep coming back but i hope they dont get too greedy and end up like another run of the mill burger place.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2012-01-27", "useful": 1, "cool": 1}, {"funny": 0, "user_id": "jKw5cGjQkTV1T2Qv7u5qwQ", "review_id": "z6lpEjPsnPek87DEF8tjyw", "text": "Great place to have a true fresh hamburger! You can tell they make there patties by hand! Very satisfied!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2015-11-07", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "Z4LjGuS6LGmSijnRB5hZBQ", "review_id": "okeb-iK1h96M6GArAn0UOQ", "text": "We've been to the W. Lake Mead Blvd. location several times and wanted to try the newest location (which is closer to where we usually stay when we're in Las Vegas).  We brought some friends and family with us (who had never had Smashburger before).  They liked it so much that we went twice during our trip.  Yes, Smashburger two days in a row.\n\nThe Good:\n+LOVE their Sin City burger (fried onions, bacon, and a fried egg).  Too bad I can't get it at Smashburger locations in other cities.\n+Brother-in-law was totally into the Spicy Baja burger\n+Service: these employees tried really hard to make sure we had a good time (in a very sincere, not-annoying way).  One even offered to take our cups up and refill them (at the self-service beverage station).\n+The meat: well seasoned, well cooked.\n+Fried dill pickle chips: probably won't get them every time, but we all liked them.\n+Delicious chocolate shake\n+Easy parking\n+They have Splenda (but it doesn't matter since I don;t like Tazo tea)\n\nThe Bad: \n-The fries: very greasy.  Not into the whole adding olive oil after frying thing.\n-Iced Tea: we don't like Tazo iced tea.  Personal preference, just don't like the taste of it.\n-Why no seat covers in the bathrooms?\n\nOverall, this location is off to a very good start.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2010-06-24", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "fd-kBIs5tlCYyiTHcJZi1Q", "review_id": "mLn0yiSp3_nzd9Cf6_66jA", "text": "Went for the first time today.....Wonderful!\n\nI didn't understand the seating at first but I went in through a side door instead of the front.  You will understand when you get in.  I love that they have monus everywhere.  Everything is simplfied yet elegant at the same time.  They even have 2 different size patties!  We came in late during a full moon....apparently everyone was starving for Smash Burger tonight because they ran out of 1/2 burger patties!  I ordered sweet potato fries and they were great.  My favorite thing was the customizable burger I created for myself.  I felt like there were no boundaries.  All in all, for those of us that love burgers.....this is a must try!\n\nI welcome Adam Richman from MAN VS FOOD to try this.  \n\nGo Smash Burger!!!!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2010-07-25", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "77lef7kKkoOVupY-7AmieQ", "review_id": "7Qq5EfKEl2Dw1ThbxcoywA", "text": "I've been seeing the reviews for Smash Burger and when I heard that they opened up one near us we decided to give it a try. \n\nWe walk in and the setup is just like at Fudruckers. Order at the cashier and have a seat but instead, they bring the food out to your table. The cashier was very helpful and really nice. \n\nI forgot what the burger's called but it had guac, onions and jalapenos... I asked for the jalapenos on the side, no big stink like at other places I've been to. I was really impressed with the burgers. They were juicy and the toppings were yummy! The patty to bread ratio was pretty good. \n\nBussers were really nice and very accommodating. \n\nWe'll be back. :)", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2010-09-21", "useful": 2, "cool": 1}, {"funny": 0, "user_id": "wnO99pBbGqwqOoTQM25iCw", "review_id": "Wv6cKuNODnvhAkIkoSx1Dg", "text": "Smashburger is an experience that I have wanted to try.  So we walk in and instructed to take a menu, controll our excitement and then order at the counter.  I actually was amused by this and the menu sounded great.  I mean you get to pick your bun and a large amount of topping choices.  The buns were excellent, crisp and flavorful instead of wilted and soft like most hamburger joints.  I ordered the BBQ bacon burger and they put the BBQ sauce on the side making me happy as I like to control the amount of sauce on my burger.  The wife made a blue cheese and avocado burger on a spicy bun.  Overall the burgers were decent but I am not sure whether it is due to the smashing or just poor chefmanship but our burgers were overcooked.  \n\nThe atmosphere is so so, diner style seating with a few old school vegas photos hanging around.  For kids they have hamburgers, hot dogs, grilled cheese and some chicken.\n\nThe fries are thin and rubbery, almost an afterthought.  I have had better fries nearly everywhere.\n\nI wish the burgers were slightly less cooked as the bun was worth coming here for.  Alas, the search for the perfect burger continues.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 3, "date": "2012-05-18", "useful": 2, "cool": 0}, {"funny": 0, "user_id": "3ebGVNm6T7pam4Ym4RQwCg", "review_id": "7wniR4iB7khIeI0BIcZbzA", "text": "BBQ, Bacon and Cheddar Burger = Amazing\nClassic Burger = Ok\nFries = Ok\nOnion rings = not a fan\n\nOverall = Would recommend for burger fans", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2013-12-26", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "L-L1X9Q7ptjFLExAIxf3yw", "review_id": "Iys68S0DlD8xBXMsgM1_Eg", "text": "Sorry, I don't get this place. It's looks dirty and it's so dark inside you can't see anything. Servers delivering the food scream out behind you, \"who has this, etc..\" Food is overly salty, kinda commercially generic taste. Why better options out there for my liking.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 2, "date": "2013-11-10", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "Ew2y3jL11uooMQxSwwL6tw", "review_id": "d39PbOYuFXgNQzeKSl4r4g", "text": "Finally went to try this place, since I had heard it was so good.  I thought it was okay.  I think In and Out and even Five Guys is better.  I got the smashfries, they were just kind of dry and plain.  I got the sin city burger, again just okay.  I like fried onion and egg in a burger, but it just wasn't as flavorful as other places.  Glad I got to finally try it, but probably won't be heading back.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 2, "date": "2012-02-13", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "JhV-D6a2tL6xpzGdBruepg", "review_id": "6Ic0Bt0iODSl1XcypQubug", "text": "Not even close to In-N-Out quality but burger is good like your grandma makes in her skillet.  However, the patty is a little dry. Probably since the \"100% Angus Beef is smashed on the grill\".  Bad technique for burgers since smashing patties squeezes the juices from them. French fries are very unspectacular.  Dinning room is your basic strip mall sub-leased space but decent decor.  Great shakes with real Haagen-Dazs ice cream. One area where SB separates itself from the others is they have iced mugs for their root beer and have beer and wine as well.  Was expecting more because of the hype, but burger was pretty good anyway.  Not on the same level as In-N-Out or Five Guys but definitely better than your normal fast food burger joint.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 3, "date": "2010-08-28", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "wAwlgeJpWY_-RUqHLGTx3w", "review_id": "23seOZuUpTGCOaT3fcimOA", "text": "Food was good the sauces they service with onion stack not so good...all in all great place for a great burger!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2012-02-15", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "eCErX2uz7AVmYuZu30CBvA", "review_id": "ap7txmeHGzVMoyY8-1kaIg", "text": "The second-best burgers in town after The Dispensary. Delicious salads and chili, too!\nDon't miss this place. Sooo good!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2010-12-28", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "1DVCkL1W6TGzXcu8ZbBptA", "review_id": "uAafhZHLYESFb9jY35uVQQ", "text": "I like this place.  The food was very good.  The hostess that took our order was great.  She was very friendly and recommended a burger that was terrific.  The guy that brought our meal was nice.  I'd recommend Smashburger.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2013-06-13", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "vH_e5gsm44SGfdbQVFtBDw", "review_id": "ZQjvTdtZpUloPcVnuoL4jA", "text": "Went here last night and got their 10th anniversary special burger- was soggy and very very greasy. The grease overpowered any flavors on the burger. I ordered smash fries and sweet potato fries. They were out of sweet potato fries so I got their veggie frites which the girl said was fried and came with ranch. Well these are literally carrot sticks and green beans fried with no breading on them and no seasoning at all- no salt or pepper. These were not good. I definitely won't be back. This place is overpriced and not good quality.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 1, "date": "2017-07-28", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "kFuqgoQCKs19a8-o2JvbYg", "review_id": "IcaULsWSvhvhceMD9GXt8A", "text": "We all know how Smashburger is. This is a great location in terms of speed of order taking, accuracy of order and friendliness of staff. The black bean burger is tasty baja style. Buffalo chicken sandwich is another great option.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2017-05-14", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "RJVpaFHx3MwynTM8TNjz0A", "review_id": "0LU4uNo_sp5Dmg1oK157Ew", "text": "Stopped by here with Anthony M and Jieun L before the CMYE Milkshake Tasting started so we could grab a bite before the place got packed. \n\nWhat I ordered:\n\nMushroom Swiss Burger \nSmash Fries\nRoot Beer (IBC)\n\nThe burger was good. The fries were not seasoned enough and just tasted like regular fries. The root beer was good cause they gave me an ice cold mug to pour it into.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 3, "date": "2010-09-19", "useful": 2, "cool": 1}, {"funny": 0, "user_id": "SssXdhbeYJOCF6sfSFwC-Q", "review_id": "ZNX4q5FQcFdCu50N0BP7Dg", "text": "created my own burger for lunch.. here's what i came up with:\n\n1/3 lb burger\nchipotle bun\nchipotle sauce (mayo?)\nlettuce\ntomato\nonion\nfried egg\npepperjack cheese\n\nthe patty for my burger was flavorless... but everything else on the burger made it better. my dining companion ate the other half of my burger and realized my patty had probably been left out for a while. he said it wasn't up to the standard he had when he first tried smashburger. darn. i came right before a big rush so maybe my patty was leftover from the last rush? it was around 12:45ish..... \n\nthe sweet potato fries were yum! \n\nanyway.. the service while ordering was okay.. and food came out in a timely manner. and it was hot. \n\none strange thing i noticed was the soda machine was placed in a poorly though out location. not only is it next to the restroom (gross!).. it's on the opposite side of the restaurant from the register. so you have to order.. get your soda then backtrack to the dining area. the dining area and the soda machine are separated by a short wall which makes the space to get soda very tight. if you walk in through the back door... you have to squeeze by the people who are waiting to get the soda. \n\ni'll give it another try since i was told my burger was not normally what is served. will update next time!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 3, "date": "2011-02-06", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "lYMj7VJ-cd-K14-NwgiIOQ", "review_id": "vDuqCoCExVQdK1dGr3T_tw", "text": "Slow service and only one register on a Friday night.  The line is out the door. Stop cutting your labor and get some help.  Will never come back!!!!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 1, "date": "2017-09-16", "useful": 0, "cool": 0}, {"funny": 6, "user_id": "9eKk90OB9wKDacTDyYvFWg", "review_id": "sfkGPTJ03T3Matigtl0sCw", "text": "This post is from my last trip to Las Vegas. It was supposed to be \"No Meat March,\" but obviously it didn't turn out that way. When I am on vacation it pretty much an all you can eat time. I absolutely enjoy trying new places and cannot resist temptation; therefore, out with \"No Meat March\" and in with Smash Burger! It's utterly necessary that you try this place, especially the sweet potato fries! Pictures on my blog.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2011-04-02", "useful": 5, "cool": 4}, {"funny": 4, "user_id": "kVAy8nol_GefMbR7awm5TA", "review_id": "N_nspSJ3QZKsNypY5cIZNQ", "text": "I just popped my smashburger cherry!\n\nThere's been so much hype that I had to try it.  I ordered the mushroom burger.  They technically have 3 sizes - kids, regular and big smash.  The mushroom burger has garlic, mushrooms, swish cheese on an egg bun.  I held the mayo.  The burger was real juicy and cooked medium.  I wish the egg bun was toasted as it was softer than I'm used to but since it was obviously fresh it didn't hurt.\n\nNote - you can make your own burger and there's a menu with a slew of free sauces and toppings.  That'll be my next burger.\n\nWhat put me over the top was their smashfries.  Wow.  Rosemary, olive oil and garlic.  I wish it was served a bit more crispy as I prefer my fries more well done but the flavor was incredible.  I'll just ask for it well done next time.   My next fries order will be the truffle fries.  I'm drooling already.\n\nThe service was quick.   You order at the counter and they bring it to you.  Very low key but it's reflected in their decent prices.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2012-05-12", "useful": 2, "cool": 3}, {"funny": 0, "user_id": "Q_MZSN0jJqrI6R8FY-f44Q", "review_id": "uVvIA__JoE98jChotq1GYg", "text": "This place is awesome. Quality and service are on point every time. Burgers are good and sweet potato fries are some of the best around. Good little hamburger place but they serve beer, by the bucket, so that gets them the 5th star.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2012-06-14", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "OHS9hVIOUBNKIcMeVukOdA", "review_id": "6vJJjvLCFdgD26RthEnTrQ", "text": "After hearing about this place from a friend of mine, I had to give it a try.  Soooooo glad I did.  Like many others have mentioned, I was pretty impressed by the cleanliness and the nice friendly service.  However is was definitely the Sin City Burger that earned the 5 stars.  Omg, the burger was so juicy and had such a nice char/crunch to it.  The bacon was crispy and the combo of grilled/fried onions took it over the top.  It was one of those that kept getting better and better with each bite.  I'm drooling right now just thinking about it.  I used to be a tried and true In-N-Out fan..........but move over buddy, Smash Burger is king.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2011-11-06", "useful": 1, "cool": 1}, {"funny": 0, "user_id": "gvuvcjAVl1ElyXTgU80VRg", "review_id": "zFmDuhx_2aUtbM9GowqcJw", "text": "After having bachi burger a few days ago I've been craving it ever since.  Since its a bit far for me i decided to compromise and go for smash burger because i remember it being fairly decent last time i went.\n\nGot the sin city burger with smash fries this time.  The burger was decent, the onions were grilled nicely and had a lot of flavor but for some reason the burger just wasn't satisfying.   \n\nThe smash fries were way too weak on the garlic and it was extremely greasy.  There was an actual puddle oil/grease at the bottom which was pretty disgusting.\n\nOverall, I left with a gross oily after taste and will probably be burping up grease for the rest of the night.\n\nTo finish my burger obsession for the weak I gota compare this place to fuddruckers and then the fukuburger truck.  Stay tuned...", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 3, "date": "2010-07-21", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "X2DmLKiWZXmxm5NAGAO6Lg", "review_id": "lWC3vS0x2DycrgvPK0G8yw", "text": "i normally like this place, but I was very upset when my burger had a soggy bun, nothing turns you off than a soggy bun. Yukk.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 3, "date": "2011-12-23", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "uWBeZ84QOwG-ihV2z-XK1A", "review_id": "EF0zVcD-7I7Qh0qpQbgBkw", "text": "What is the purpose of closing at a certain time and when you get there  10 minutes before 10pm doors are closed and employees pretend not to see you and worst people are inside eating.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 1, "date": "2017-03-19", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "pzyiSXtKK14_PnuQQvWi3A", "review_id": "s1FoB6fLD9GyP93Q83pERA", "text": "Burgers are fresh and great quality ingredients. The fries with rosemary are delicious. I highly recommend it!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2013-01-15", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "LSw5J-mDFXr75jmYmRnWow", "review_id": "Mt8W2JX6iWTAF_llSdMbnQ", "text": "I have been a total of 4 times now so i really feel i can give it a fair view. Its hardly crowded the few times i have been so good for me to not have to wait a long time. Employees are friendly enough. I joined the smashclub and took advantage of the buy one and get one burger. Great so i can have someone else try it. My daughter got the original smash and i got the one with the bacon and haystack onion rings. GREAT meaty burger, great taste and all...love the onion straws . Now the only mixed feeling i have is the prices of the burgers while very good $5.99 and up for a burger is a bit pricey especially when u have kids. Especially when In N Out can feed the whole family for about $12 and here u would be spending a WHOLE LOT more.\n\nI enjoyed the burgers each time but this would be a special treat place and not an oh lets grab a burger for everyone place. But love the variety of the menu, veggie burgers, or chicken or salad. and even the chiptole bun. Love it just cant do it daily", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2013-04-06", "useful": 0, "cool": 1}, {"funny": 2, "user_id": "NVA5YEBmV_OdgCuI5RGp3A", "review_id": "Sr-ialsepbgZk6fFA76I4A", "text": "Okay, so let's be honest here; I've pretty much f*^ked my diet and thrown in the garbage..... then taken it out of garbage, shoved it down my throat then crapped it down the toilet.....okay scratch this introduction......start over...\n\nOn my occasional sojourn towards the Western hemisphere of Sin City, I have a list of places where I want to eat to review, but about the time I've reached the front doors of those yet-to-be-ventured dining establishments I scrap it, turn myself around and go to Smashburger- the best brick and mortar burger joint in town.\n\nNow that consuming Burgers has virtually become a weekly event for me, I've decided to embrace my vices and dive in deep....real deep.  There and only there, will you find Smashburger; the mother load of decadence and flavor, your hands will smell of burger grease, onions and cheese for days.\n\nSmashburger: Smash. Sizzle. Savor.  Catchy right?  Well, to be honest, they deliver a pretty amazing burger: the quality of meat is there (Angus Beef Meatball) which is smashed on the grill (giving it it's imperfect shape) sprinkled with heavenly Smash seasoning while on the grill which is then placed on top of a Butter Toasted Egg Bun.\n\nI have only ordered one Burger here, the Sin City: The Smash Size (1/3 lbs.) + Fried Egg + Applewood Smoked Bacon + American Cheese + Grilled Onions + Haystack Onions + Smash Sauce on an Egg Bun.  And it will probably be the only Smashburger I will ever order, it is perfection! There's just an overload of flavors, the juiciest Burger that you will ever encounter; the rich Egg and Cheese proteins just coats your mouth like no other, the combo of Grilled and Haystack Fried Onions is a double punch of decadence - it's a flavor windfall with each bite.\n\nAs for Fries, I'm partial to Smash's Signature: Fries (well cooked) tossed with Rosemary + Olive Oil and Garlic.  I like the Italian twist that Smash offers, and since I can't find that anywhere in a fast food establishment, I get it every time. (they Sweet Potato Smash Fries are yummy too!)\n\nBy the time you're almost finished, you're hands and mouth are coated with a glorious glistening of rendered oil, and with an almost animal like post-mortem, you're overcome with a sense of calm satisfaction, like a pack of lions that have finished masticating a helpless (yet yummy) antelope. (calm down PETA- I'm too insignificant to be in the crosshairs of your bitter venom..)\n\nSuffice it to say, Smashburger has the best burger in town and the reason why I go to the other side to get my fix?  Because if I start going the one closer to where I live, I would be there every day and be 400 lb. (worth every pound)\n\nRatings (Out of Five Stars)\nFood:           5\nAmbience:   4.5\nService:        5", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2012-12-02", "useful": 1, "cool": 1}, {"funny": 0, "user_id": "eivmRx_Ns10x6uJ2yybCWA", "review_id": "drLiec8QugIrWKZCwWHa2g", "text": "The burgers are great, they have canned beer for $1/can, and the service is always great.  What more could you want?  Be sure to get the SmashFries, too!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2013-09-26", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "WU1z9Nf5qXUjtsYfy6yv-A", "review_id": "1f1i3sN5t7gPgxrqdLxFzw", "text": "Fried egg on any burger is phenomenal.  The nice thing is that you can go with their creations or create your own masterpiece.  Las Vegas definitely needed another burger joint and this is it.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2010-06-27", "useful": 1, "cool": 1}, {"funny": 0, "user_id": "zFszUTKwfFIWK6EAYCyR7Q", "review_id": "VtXcUsENreZvrSX5KOpdhg", "text": "You know, Smashburger falls into the middle of my burger list, not the best but not the worst. They do have a couple of really tasty items on the menu. Go for the veggie frites instead of fries, its a nice change. The best thing on their menu is a burger you can only get in Vegas locations.. Yea I am talking about you Sin-City Burger. Keep the defibrillator handy after chowing down on one of those because you might die from your sins. ha ha zzzzzzzzzzzzzzz.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 3, "date": "2010-09-10", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "BiDYCJxpp6t12KgH3QMb1g", "review_id": "Wep3khEpo_PeLWsle5uh3g", "text": "Well, service was GREAT, food was ok.\nFries were cold,  burgers came our super quick, cold bun, just warm burger, not hot...\nAnd a little to red inside.\nCould have gotten 5 stars with hot food.!\nBy the way, Jaz gave us GREAT service..and 2nd order of fries were hot...", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 3, "date": "2016-03-02", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "ObCPZxvFruK0Th3-S7QXhA", "review_id": "uYBxBdMuHWknQB56yBzENQ", "text": "Have frequented this location off and on the past three years. For what it is the food is always good and the staff is always friendly. Never had any issues here and my kids always enjoy coming when we do. Place is great if you don't want fast food but don't have the time for a big sit down restaurant.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2014-06-21", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "9VUBm41ZyGrLo4seD7Iqgg", "review_id": "N6SksDdiKRCQh1YNQ5oGUg", "text": "Best burger in the fast food category in Las Vegas. Very fresh ingredients, served hot, and nice clean atmosphere.  Much better than Five Guys.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2014-07-15", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "BC7_wDcWGx15aCgVR9Ak2Q", "review_id": "oSeIt4_U3yur8QgdjF4BAQ", "text": "Came here last night for the first time, I'm not from around here so when my aunt said we should go, I went. Service was good and the food was great. The burger tasted fresh and the smash fries stole my heart. I'm probably gonna look for s smash burger in LA by me now.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2015-07-18", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "qPVtjjp8sNQ32p9860SR9Q", "review_id": "5hOw_rRVhfdG2Gdxk0BFoQ", "text": "Okay.. Hand down this has GOT to be the best burger place in Vegas! Food is way above par and the burgers are always so fresh! Big Smash Sin City Burger is the way to go!!! Love it!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2013-04-27", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "bnk8hI3N5tprKm_lMK4I-w", "review_id": "HHGLGSc10wSJ8jHBOzsP_g", "text": "Ordered to go. Asked for cold veggies on the side. Did not dissappoint. Got our burgers home, thirty seconds in the microwave and it was as if they had just come off of the grill. Yum!\n\nGot the fries. Really tasty, but kind of frustrating. They are so thin. You have to grab four in order to get any ketchup to stick to them.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2014-01-19", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "ZTruDUZbdto9yAMJOlPBAg", "review_id": "nvi2EYyG-jR9cb8UlKfndA", "text": "My husband and I's first experience. WHAT A JOKE!!!! I went there because I was craving onion rings. So I order haystack onions and he tells me they only have burger portions of the onions because they \"ran out\" earlier today??? How do you run out of something hours before closing with a grocery store next door!? Then I tried to order my burger rare, and he gives me some condescending banter about getting salmonella. Please don't educate me on food I'm not a child. Both my husbands burger and mine were burnt. For $1.50 I got avocado, which literally contained about a heaping tablespoon of overripe smashed avocado. The smash fries tasted like burger king twice cooked and then smothered in WAY too much rosemary. We will NEVER be going there again! Waste of $15! And we didn't even get drinks!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 1, "date": "2013-04-01", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "kJx2pW9SJdB4MAEpors46g", "review_id": "FHN5xykh3uydmWeyQrwDYg", "text": "First time visiting this establishment, my son and I both agree that we will be returning! He ordered a \"build your own\" Big Burger and after his first bite he stopped and said, \"this is a really good burger, we should come here more often!\" I had the Avocado Club with grilled chicken, DELICIOUS!!! Hit all the right spots! The chicken is cooked fresh and juicy. The meat quality was very good and the portions were very well sized. We shared a large order of the regular fries, and I have to say that I love proper shoestring fries and seldom find them so kudos for that! I saw reviews complaining about pricing, and well, you get what you pay for and there is no exception here. $24 for two including drinks, large fries and extras on both sandwiches, I can't complain about that!!! It's definitely worth the trip and the cost! Oh, and let's not forget the customer service... The girl who took our order was very helpful and gladly gave the extra explanations and suggestions for our inquiries. They bring the food out to your table once you order, and the guy running the food and bussing the tables was also very friendly. Looking forward to our next visit! Thanks for a great experience!", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2015-08-29", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "kaJCbdYCy657hmpY6Eb82w", "review_id": "tNTuBCAzufYUgvuVZ2hy1g", "text": "I like most things about this place. The food is good and sometimes the service is OK. I would prefer the one beside the college. Service need a 101 training class or something.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 4, "date": "2012-01-28", "useful": 0, "cool": 1}, {"funny": 1, "user_id": "seSoUU5iqzoCklJjpSpu8Q", "review_id": "Aa9hhsRZ162yEu89d1lqhA", "text": "Came here the other day to get some lunch. I've had smash burger before at other locations and I have to say not only is the food great, but the customer service at all of them is as well! Unfortunately my rewards point didn't show up, but both the cashier and manager helped me to the best of their abilities by giving me the points to make of for whatever technical error had occurred. Also, staff was extremely friendly like expected. Would definitely go again.", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 5, "date": "2016-04-22", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "SnW3DwEKu_LWeuYnS1AMaw", "review_id": "7ANLhKCCWQ2vaeWxgfqmDw", "text": "it has been awhile I have ventured here,, with bogo coupon in hand , there i went.. I tried the truffle/mushroom burger, got the condiment sides I wanted, but unfortunately they only can cook the burger well done?? What is with the burger cooked til it is burnt, not juicy at all( I asked for medium), but was told cannot be done that way????\nWell I guess the customer is not right and cannot get their burger their way here, so I will not be back... Service was quick and friendly, but no more burnt burgers for me.\nMy dog like the hamburger , but then again she is a dog, who loves here meat.\nI will not be back.....................", "business_id": "diY31IEunbV8MfDh81FS1A", "stars": 2, "date": "2013-08-17", "useful": 0, "cool": 0}]