[{"funny": 0, "user_id": "JXHrhT72U6sZJQSkFfNzjw", "review_id": "fECnxfascrL0Ztz8rW7H6A", "text": "We ate lunch at North 40 on a Sunday afternoon, so did not see the honky tonk in full swing.  There are 3 enormous TVs on the wall and you could hear the volume of 1 of the NFL games.  This was nice, and it made it easy to watch.\n\nFor our meal, we had a 2 meat platter (pulled pork and brisket) and a 3 meat platter (ribs, hot link and BBQ chicken).  For sides, we had mac n cheese, mashed potatoes, beans and potato salad.  \n\nPulled pork:  standard, decently juicy but dry in spots.  Needed sauce.\n\nBrisket:  tender and flavorful but a bit dry.  I bet if you get a good piece of this it's a winner.\n\nRibs:  great flavor, tender, but not too tender.  The end was slightly burnt.\n\n\"Hot\" Link:  this was not spicy at all, and is more akin to a polish sausage.  It would be great if called a sausage and not a hot link.\n\nChicken:  the dark meat was better than the white, which was a little dry.\n\nThe mac n cheese was the best side by far.  The beans and potato salad were not good.  Lacked flavor.  \n\nAlso, a hot sauce on the table would be nice other than Tabasco.  Just spice up the normal sauce with cayenne powder or something.  \n\nOverall, the portions are large and you may get messy.  It was worth it and we will likely return, just don't expect to be blown away.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 3, "date": "2011-10-31", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "gtSRsO8dV-A3dVJnzHmV9Q", "review_id": "urnGYtRkOHIkT6efF8npkg", "text": "Looks like it would be a great place to hang out at. Not a good restaurant. Horrible food.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 2, "date": "2011-03-11", "useful": 0, "cool": 0}, {"funny": 2, "user_id": "kittuNN8czCY1AVA_RvExQ", "review_id": "JrOGJNSJddUFhHEC6_NRvQ", "text": "my two roommates and I decided to venture out to north forty because we had all wanted to try it for months but never got around to it. we've had great nights out while drinking at the south las vegas branch so we were excited going into it. This place took over an old \"roadrunner\" bar and grill that we enjoyed both for food and entertainment. \n\nWe went on a sunday evening around 6 o'clock. there were only about FOUR tables occupied besides our own. we ordered a sampler platter, prime rib, and a burger. \n\nBurger: good size, very bland, ordered only TWO toppings one was missing. \n\nsampler: it was appetizers so hard to mess up. nothing on there was that good though. chicken wings were alright. \n\nprime rib: TERRIBLE. we hate sending food back but this thing was tough as hell, not very hot (probably sitting there since that afternoon). we sent it back, and the replacement was just as bad. DON'T WASTE YOUR MONEY. \n\nour waitress was very friendly, however, she took our order correctly but messed up the burger order AND totally forgot to bring an order of potato skins to the table and STILL billed it to us. when we brought it up she said \"we have no idea where it went....are you sure you didn't get it?\"\nwhat kind of question is that? either it wasn't made or you took it to the wrong table and the people there didn't speak up. don't talk to us like we are so dumb that we can't remember getting one of 4 plates or decided to eat and hide the plate to pocket a cool 6 bucks. \n\nI may visit for the nightlife, but i will never revisit or recommend their food. bring back roadrunners or at least the cooks!", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 1, "date": "2010-09-11", "useful": 1, "cool": 0}, {"funny": 2, "user_id": "BJOLgnc5gtHlkwhBIqNW5Q", "review_id": "Km9E4yS7LdbYONX8yArzpw", "text": "I really, really like this place. It feels like Texas, sounds like Texas, and tastes like Texas (I'm from Texas). The food is excellent. My husband and I disagree about whether North Forty or Famous Dave's is better, but we do agree that North Forty's brisket wins hands down. Solid 4 stars. \nMy only suggestion is to please get fried okra on the menu! If you do that, I'll come back and give you 5 stars! (okra blackmail!!)", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2012-05-18", "useful": 2, "cool": 0}, {"funny": 2, "user_id": "n86B7IkbU20AkxlFX_5aew", "review_id": "3JtrOwQ8X-rt6IM44iablQ", "text": "The month of July they were running a $12.95 AYCE ribs daily ( normally only done 2-9 Sundays) so the BF wanted to go. We have passed up this place for late night eats since it becomes country nightlife and I'm about as country as Anna Wintour. We came for lunch when it was quiet though the country music playing capped my year dose. \n\nThe ribs themselves were surprisingly good. There was a visible smoke ring on the ribs and the smokey flavor was present and just the right amount. The ribs were trimmed right as they werent overly fatty, the were tender, juicy and meaty. They had 3 types of sauces - original, a spicy and a sweet one and all were solid. \n\nThe plate comes with 2 sides and cornbread. Both the BF and I grabbed cowboy beans which was really good sweetness but a touch of tang. I got mac n cheese which at first I wasnt a fan of, but I grew to like after a few bites. It seems like it's milk cooked so its less saucy but had flavor. The BF grabbed some tater tots which were really crispy though slightly salty to me. The cornbread I wasn't a fan of as it was very dry and seemed stale. \n\nService was friendly and good. She checked on us, brought us ribs, filled our drinks in a timely manner. \n\nI am pleasantly surprised with this place. I thought it was gonna have adequate BBQ, but it's pretty solid. We rarely eat meat, or a lot of meat but I would definitely consider coming back with my in laws who like BBQ. It's far North but if you're in the area and want BBQ ribs this is definitely going to satisfy.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2012-07-31", "useful": 3, "cool": 2}, {"funny": 0, "user_id": "M6uDHCxhZybBdngFuBmrHg", "review_id": "6ztsozx_WoPKLEkEimLHSw", "text": "To Rate Stoney N40 you have to actually look at the two sides of Stoney's, the saloon/food and the club/dance hall. Food half four stars, club/dance hall pushing 3. This is a smoke free location which is a huge plus. I prefered Stoney's over Revolver for this reason.\n\nFirst off with the good: The food and service is excellent. We eat at the bar and the bartenders have always made every meal the best. Each time we've asked to substitute something else on the menu we have been accommodated. I've eaten at Famous Dave's, Mesquite BBQ, Dickie's and Lucile's.. I think Stoney's is on par with Famous Dave's, the customer service, and the local feel gives it a step above any franchise. We eat here weekly and if you don't like the food, your just don't know good BBQ. They need to advertise more though.\n\nThe Bad: The club/dance hall is lacking. They are competing with Revolver which is close by. Stoney's has recently started mixing club music within country music. Listening to Luke Bryant then going to Lady Gaga. It just doesn't do it for me at all. This typically brings in a mix from country hats to flat bill affliction-tapout-wear-young kids. Mostly everyone gets along well. They need to have gaming machines at the bar to bring in more people, which will bring in more revenue and hopefully then they can go back to being a country bar,", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2011-10-26", "useful": 3, "cool": 1}, {"funny": 0, "user_id": "l6l3y7aSBKZohlt1CYd48w", "review_id": "PKObS1Vg5CezeNvb1WcuHg", "text": "Stoney's was a big hit with us.  It's not normally a place I'd take my kids to, but I didn't choose the restaurant and we were going for a birthday dinner...  Even though I wouldn't normally take my kids, it wasn't uncomfortable either, since there were a handful of other kids there, too.  \n\nWe were a group of 15 people, including 5 kids (and 2 babies) and we did *not* make a reservation.  We tried to call but couldn't get through.  The hostess had a relaxed friendly attitude when I asked about the availability of getting a table for that many people.  The manager, Cliff, got us seated in 5 minutes and seemed happy to have us, not annoyed that we had children.\n\nOur server, Sam, couldn't have been better.  She was upbeat and always there to fill our drinks.  Our food came out surprisingly fast, too!  The only downfalls for me personally was the limited selection on some things.  They don't carry any Ciders, and the only white wine they have is Chardonnay.  They also don't have any green veggies besides the salad.  But what they DO have is really, really, really good.  Not really the place for those on a health-food kick!  \n\nI had the two-plate combo with brisket and pulled pork.  The brisket was extremely tender, and the pulled pork was just the way I like it - juicy, but not drowning in sauce.  I had a simple side salad and a baked potato with the works, and it also came with corn on the cob (a little mushy for my taste) and a really good cornbread muffin.  My oldest son had the Philly and wasn't too crazy about it, (too much bread, and he said it wasn't hot enough), but my youngest son loved the kid's sliders and fries. \n\nEveryone in our party was impressed with the level of service for such a casual place, especially being so busy!  There must have been like 30 people on the dancefloor line-dancing, ranging from kids, to older couples, to girls in Daisy-Dukes!  It was a fun yet clean and family-friendly atmosphere.  Sam really out-did herself, and Cliff was not the manager that stood around - he was helping to check on and reset tables.  I would definitely go back, only next time, I'm leaving the kids at home!", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2011-08-06", "useful": 2, "cool": 0}, {"funny": 0, "user_id": "L15JCA18Ib_vMUVJILxiSw", "review_id": "tYqQynsQ8k3XQHXiV86btw", "text": "After the remodel they hang a huge sign that says FREE beer Fridays.  You pretty much have to go if you see that right?\n\nSo I stop in with a friend about 9:00 at night.  It is nice inside - more of a dance club than a restaurant or bar.  Huge dance floor with some tables around.  It has an outdoor patio, too.  The venue is set up for a good dance place.\n\n$5 cover - maybe it was $10 can't remember.  Not too busy.  The free beer is natty light or PBR!  Yeeha.. passed on that and ordered some drinks.  Bartenders were friendly.\n\nNo comment on the food, I thought it was like a club...didn't even see anyone eating.\n\nSo I am looking around to see if there are some attractive available ladies to chat with - and the dance floor has like teenagers line dancing???  What is that???  Who brings their kids to a night club?  I guess they are 21 and over after 10:00pm.   That was wierd.  The crowd over all wasn't too much fun.  Some goofballs there for some free beer.  I thought they were going to start smashing the cans on their forehead!  \n\nThis place could be turned into a fun honkey tonk kinda place...but for now - i would skip it. Vegas could use a fun locals joint.  \n\nStoney - drop the free beer nights.  Get a band in there.  Do a ladies night or something.  Get a mechanichal bull.  Free PBR is just dumb!", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 2, "date": "2010-10-08", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "4EiFaBpiifBhGbPwQ7O-bg", "review_id": "zl0xGvFeS4OZ-FRAdD5hLg", "text": "I was very surprised by this place as I drive by it all of the time and rarely see a soul in there.  When IHOP was too crowded for breakfast one morning my husband and I opted to try their breakfast.  It was really pretty decent!  The patio is really cute and the wait staff was all over us making sure we were checked on every minute. Everyone was welcoming and super friendly.  Breakfast taters were really good - recommend those.  I had the western omelet which was good but seemed to have two slices of processed cheese slices melted on top.  Tasted good though.  Their menu for breakfast is pretty limited though.  Not sure what it's like at night since I'm not a fan of country bars, but the food was good and from what I hear their ribs are pretty good.  Might try it again for dinner or happy hour.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 3, "date": "2012-04-26", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "auDcKLs5g6BPWWmIZWfBFQ", "review_id": "KN8WuorHSyrdKhLXyTdH-g", "text": "We tried to have a nice breakfast on Sunday morning. However the service rates as one of the worst I've experienced. First off, it took 10 minutes to place our drink order. The bartender had to come over because the service was so slow. Then after placing the order and waited for an hour, the waitress came by saying our order got mixed up. Can I tell you how difficult it is to entertain kids that long? Then when I asked for the manager to explain the enormous delay, manager did not come within 10 minutes. We left. If you have kids,  DO NOT GET BREAKFAST HERE. Our bad for thinking this was a kid friendly restaurant.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 1, "date": "2011-03-20", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "cAY_gYiIq68RkWhLennaKw", "review_id": "sK_QjlZhtG4VlSsTVOF-RQ", "text": "Another country restaurant/bar option if you want to head north...", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 3, "date": "2011-12-04", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "Y3DYe_sDvg1nxglrmO5BPw", "review_id": "baAJ9DqagVPYMLz6wJ3MCQ", "text": "After a nice day just driving around seeing how much Vegas had grown, we run up on Stoney's North Forty. We didn't know what to think, but we ventured in like a couple old people that lost our way. The waitress (Kristy) came right over and showed us how to get to the table and chairs. \nKristy recommended the special for lunch, Ham and Bacon Sandwich with French fries and the fixings for homemade fry sauce. She kept our glasses full of ice cold water. \nShe then recommended a deep fried apple pie with ice cream. Ummmm good and enough to share. \nThe lunch special and desert came to $18.34 plus tip. A very good lunch, A must try again", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2010-11-21", "useful": 2, "cool": 1}, {"funny": 0, "user_id": "Tz7sOM6PYX2BgRM5hP0dQw", "review_id": "dp2qPYi4lA6VAh-VCtLNVg", "text": "Great country bar.  Free dance lessons, drink deals almost every day.  Not the best place to eat with a group after 7pm, but only because they start their music then and it is hard to talk at the table.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2010-12-14", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "IqDPuqccKntTAtSJcawbZg", "review_id": "WEx1KnkaYrESGSoIy1lbJw", "text": "I love this place!!!! I admit I was depressed when Roadrunner Saloon left and Stoney's moved in.  People at worked asked me to meet them there for dinner and I was hesitant.  Boy was I wrong!!!! \nThe food is amazing and the staff has always been super friendly!  Everytime we go we have a group of 15+ people and we always get great service. My husband and I started ordering carry out from here almost once a week.  The ribs are phenomenal, cornbread to die for, and onion rings yummy!! My son loves their Mac n cheese and my hubby loves their chicken tender salad.  Co-workers RAVE about the brisket!!!\nThey also offer a lot of coupons which makes it that much better! We get buy one meal get one free coupons every other week and they are on Groupon Now everyday.  If you are looking for great food, this is the place!!!\n\nJust for the record, I have no affiliation to Stoney's!! I know people read good reviews and automatically think someone who works there wrote it.  I just wanted to give an honest take of how good this place is because everytime I go they never disappoint!!!!", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 5, "date": "2012-04-06", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "zhkMXrCxJSH97d_pH7V6zQ", "review_id": "ga-Ii6813kCeZzz3TtI3eQ", "text": "This place is a lot of fun to go to! it is not the nightclub feel at all. There is no cover charge and wednesday nights are ladies nights and its unlimited free drinks for women & fridays are unlimited beer for $5. There are free line dance lessons wed-saturday at 730. these would be very helpful if you don't know the dancing! There is a lot of country music and almost all of it is to line dancing, and two step. They play some pop to line dancing & also have bouts of \"freestyle\" and play hiphop/rap/pop. it is a very fun enviornment and there's tables to sit at, friendly cocktail waitreses & bartenders, there's beer pong, pool tables, a mechanical bull, an outside patio....its a fun time! \n\ntheres breakfast, lunch, dinner served & i've never been, but then around 8pm ish they start changing the setting to the night bar atmosphere. \n\nAfter 7pm it's 18+ & then if they are enforcing it (don't always) 18-20 year olds have to leave by 930-1030.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 5, "date": "2010-12-13", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "tQVTyovdm4doXxDSkfYUUw", "review_id": "a4pUDxgVST2IuzSsKSydFA", "text": "Had come here previously with a $10 for $20 groupon on sunday for AYCE ribs. I thought all you got were ribs and you had to buy the sides, but nope. The AyCE ribs came with 2 sides, corn, and cornbread. They bring out half a rack to start you off, and boy were they tender and fall off the bone good. I was pleasantly surprised that they were bbq'd so well. After i devoured my half rack, I kept asking for more ribs and they came in 3's. I like this idea so that way they stay warm and fresh versus having to eat cold ribs that sat on my plate and turned cold by the time I get to them. \n\nService was excellent and they even had a band playing while you ate. The music was entertaining. \n\nI would be back. \n\nUpdate: apparently no one answers the phones as I wanted to know if they still had the sunday AYCE special ad the website is gone.\n\nUpdate again 8/25/12: They are now out of business. RIP North Forty", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 5, "date": "2012-08-31", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "5fQ9P6kbQM_E0dx8DL6JWA", "review_id": "AXxt3aEo0hXRyO2pE59pGw", "text": "The food was great, but it was so slow that night that the huge building just seemed sad. There were only two servers working (?) and so the service was a little slow. In my opinion, the food was better than the other bbq joints that I have tried in Vegas; Memphis Championship, Buzz, TC's, and Famous Dave's.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2012-01-27", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "eM09Q7l7akt2w-rLOQ19fQ", "review_id": "k8ATTaPooVkv9mM3flgEUw", "text": "Let me start out that I absolutely love the atmosphere of learning how to line dance, along with having a huge section of food and entertainment (pool, bar, and gambling)!\n\nThe food is AMAZING! I know that out of all of the trays we had ordered... the sausages, ribs, and pulled pork had been annihilated! I highly recommend ordering any of those three along with the beans and mashed potatoes for side dishes! Also, we came here on a Saturday night, so the event may have been a bit more entertaining with such a large crowd of individuals I have never met before!", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2012-09-10", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "2gzI71bypYooQkm558KnBg", "review_id": "aud5ESSSkIY10c7mTQgouw", "text": "Service was slow, don't ever try beer battered bacon.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 1, "date": "2010-10-17", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "9uSjgjiqrqxwg7a1UxiZ2Q", "review_id": "_kuQ1243lQY8G5zmsaDzQw", "text": "Went in for breakfast.  Chicken fried steak and eggs- reminds me of my great grandfather's cooking.  Staff is extremely friendly and attentive.  The waitress outfits   Are a plus also.  Will definitely be back.  And the owner is not a racist as said in a previous review-just believes in the Constitution and the conservative ideas that helped create our nation's charter.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2010-06-26", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "mrXAdAZU72ElvtuPLQzf7w", "review_id": "ARrVczskpHtn_RBqPx3W0g", "text": "Great place for large takeout orders.  We've just had the Austin Feast and it more than lived up to expectations.  Ribs were great, the brisket was really good and no complaints with any of the sides.  The BBQ sauce made every part better.  Definitely the best BBQ joint in the Northwest since Salt Lick left the Santa Fe.  One con was that it took three calls to have anyone pick up to place the order (after a long automated phone maze).", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2011-09-03", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "17YEgXio03o23KbFNAPXCA", "review_id": "rRlPYTRiS3XDS2J8-QZFbQ", "text": "Intollerable. This place wouldn't even honor their own Mother's Day special poasted on their own website. There were five servers for eleven tables. I don't know how many cooks were in back but it took over 40 minutes to get my food. Ten minutes before that for a server to even take my order. I can't tell you how many people I saw up and leave. My girlfriend and I should have been one of them. The food that came out was subpar. I think we managed to get all the heals of bread as our toast. The only thing that I had that was good were the pancakes. You may want to ask for more syrup though as mine were served with approximately two tablespoons of the sweet stuff...Thinking about breakfast or lunch? Do yourself a favor and visit a restaurant across the street.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 1, "date": "2011-05-08", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "xECpt0seSDbTmt1mGcfffA", "review_id": "x-Zc8CA8-olBK5KPDgzwrA", "text": "I have been here a number of times; there is not many food choices in the Northwest. Yesterday I came here for breakfast with a friend. I like their breakfast overall. The have later breakfast hours than most places, although only offered on weekends. It is about $10 per entree, however, it appeared popular as there were many families and kids eat free for breakfast. I have had the hash and eggs here, the hash is made there, but I will say it isn't traditional it is more like chopped up brisket - and I like it although I wouldn't really call it hash.  This last time I had the chili cheese omelet and pancakes. They have huge portions, and I don't know if the pancakes were a mix, probably, but they were good and hot. The omelet was tasty, a decent amount of melted cheese and good chili.   I will say that the hash browns were frozen which was a down side. The country potatoes are made there (at least per asking before) but they were kind of mushy before so I didn't get them. I have been here for dinner before too - not my favorite BBQ but pretty good brisket and again they are good enough that I would go back. The sides are lacking - the corn tastes frozen and I don't have anything that really sticks out as a decent side, but overall due to the meat I like it, and they have brewed ice tea.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2012-01-23", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "mCz4AYDBzpXs8wEIEcoa0A", "review_id": "chSUJB4Tn0cUcQHucvlO9Q", "text": "$5 lunch specials and girls in daisy dukes!  What more could a man ask for..  Love this place", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 5, "date": "2011-03-16", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "4wpV4DZlNxQ2xG_O3Y9lSg", "review_id": "qo1R_JM-V5zvz9iXdZjuRg", "text": "So, I think I have figured it out: Stoney's is a great place for cheap taco's & beer during football. It's fun at night for country line-dancing. It's just not a great restaurant, not even for lunch. Both times that we have gone to sit down & eat we were disappointed with the food, service & price.\nSo, it's not my choice for dining out, that's ok, cuz on a Monday afternoon, don't be surprised to see me hanging on to the bar eating cheap food & pounding beers.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2011-02-08", "useful": 0, "cool": 0}, {"funny": 3, "user_id": "kKbGPQ1Cn-6J1XRkdA50Uw", "review_id": "Z7f6BHyczh5O4tFm1GrJjw", "text": "When I first walked into Stoney's North Forty, I thought I walked into a hamster cage, not a restaurant. While I could have done without the wood chips scattered throughout the floor of North Forty, the food and service was actually quite good! This came as a surprise to me because this place was completely empty! \n\nEven though I don't dance (I'm as white as they come) and I hate country music (okay; maybe I'm NOT as white as they come), I felt comfortable eating inside of North Forty. With the big dance floor in the middle of the restaurant, I envisioned how rednecks must be having the time of their lives on Friday and Saturday nights. With FREE dance lessons and occasional FREE live events (American Idol's Bo Bice, baby!), Stoney's North Forty is a white people paradise.\n\nThe food itself at North Forty was pretty good. From the smell emanating from the restaurant you could tell they use a BBQ smoker. The portions that you receive for the price are about what you would expect. I didn't really care for the coleslaw (made with horseradish and slimy), but the philly cheese steak was big, tasty, and made me hot in the pants. Don't expect extraordinary eats at North Forty, but there is a little something for everyone. Did I mention they have their own homemade barbecue sauces? YEE HAW, PARDNER!\n\nIf you take away the poop sprayed all over one of the ladies room toilets and the wood chips on the floor (sorry to repeat myself; the wood chips aren't only tacky but how do you sweep around them? If they sweep...), Stoney's North Forty would have earned a four star rating. For lack of a more creative finish; go to Stoney's, cowboy.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 3, "date": "2011-07-29", "useful": 0, "cool": 0}, {"funny": 7, "user_id": "QJI9OSEn6ujRCtrX06vs1w", "review_id": "CXh9IqVR8FeNDmXlhBXekw", "text": "The latest in the Saga of Eating Challenges.....Stoney's North Forty was selected as the location for the 4 lb Omelet eating challenge.  Scheduled for a 9 AM start, I had to rush to get there in time to witness the action.  Four guys in our group of 12 were going for it.\n\nI didn't participate in the Challenge, but posted some pics of the Giant Omelette & participants.  I brought my Son along to witness the tomfoolery.  We opted to split an order of Potato Skins....yeah, I know B-O-R-I-N-G.....compared to the 4 lb Omelet, but I knew there was no way I could do it and I didn't feel like starting off my Sunday with a major stomachache.  The Skins were topped with Sour Cream, Bacon, Beef, Cheese, and Green Onions....Ranch was provided for dipping.  To wash it down, I had an Iced Tea.\n\nOur food came out pretty fast and the waitress was pretty cool to handle our huge order.  The Omelets came out first.....they are really, really BIG!  Not only is it a giant Omelet....but it's covered in Gravy, and you must eat 2 Biscuits & Hasbrowns in addition to that thing in order to complete the challenge.  Scott T gave it a valiant effort and came up a few ounces short of finishing the Omelet....seriously, check out the pic....he was soooo close, but couldn't do it.  Ken M who organized this thing did ok....respectable.....plus had ate it with a Shiner Bock....+1 for Ken for a Beer at 9 AM!\n\nOur Skins were very tasty.....the combination of toppings went well together.  The Sour Cream was drizzled over the top of the Skins instead of a blob of it that you have to put on yourself.....for some reason I prefer it drizzled over the Skins like they do it.  The Skins are very large too.....and stuffed full of the toppings....I'm glad I split it with my Son.....I was full after eating 1/2 of the order.\n\nLooking around the joint, it's a Country Western Dance Hall at night with plenty of room on the dance floor.  There's also a mechanical Bull in the corner for those who dare.....needless to say, nobody in our group was in the mood for a Bull Ride.....not after trying to house a 4 lb Omelet, ha!\n\nOverall, it was a great time....Will I return?  Yee haw!  that means \"Yes\" in Cowboy....I think.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2010-10-03", "useful": 10, "cool": 8}, {"funny": 0, "user_id": "wgSU5xcORL350s7PImZvdQ", "review_id": "jvFuH9hGsevypRzgkUTKYg", "text": "This was my first time here and it was for monday night football. Eagles vs Redskins. Me and two buddies went because we heard about the $5 all you can drink beer during the game with nickel drafts during half time and free shots every touch down.The free beer is either Busch or Busch lite, I went with the light and it was just fine. Plus before the game it was buy one get one free! Needless to say it was a pretty good deal. We sat down and ordered $1 worth of tacos each and that hit the spot. The tacos were only 25 cents each and they were big and delicious.\n\n The game starts and the first pass is a touchdown, That means free shots! This music comes on thats now one of my favorites and says shots shots shots to some house music! Long story short the game broke the monday night football scoring record and I got about 9-10 free shots. After the game the place pretty much cleared out and we left at around 9:00 p.m.   \n\nThe waitresses and bartenders are pretty friendly and fast. All and all it was a great monday night football hangout and I left with spending about $20 the whole night including tips!! will definately be here every monday night.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 5, "date": "2010-11-17", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "iUds9-iyxd4PFW0jMh15TA", "review_id": "GvCwRGWGTHKINaW111YdjA", "text": "Got the Groupon (or Living Social) deal they had offered a while back, pay $10 for $20 worth of food! So that was a bonus going in!\n\nNow, getting into the facility - as a first timer, I was kind of looking around before getting out of the vehicle. Kinda sketchy seeing what I felt was a homeless individual sitting on the curb of the property. \n\nWalking in - the place is HUGE! Wide open, and tall ceilings. When walking in, first view is the bar after the hostess area. You don't even see any of the tables, as it is all hiding behind a mini wall barrier and blends in with the wood walls. Got to the table, and gotta say I love the old fashioned wooden vibe in this place. A small ding on cleanliness of the tables and chairs. As I was moving down the booth, my hand kept coming across crumbs from previous diners. Was not very pleasant to feel that, and having to wipe my hands to clean off someone else's crumbs.\n\nI had gone on a week night, so there really wasn't much of a crowd - kinda surprising for a week night right at prime time dining (6pm), so that kinda made me skeptical of the food right off the bat. But I held my hopes out.\n\nI really did want to try the bbq meats, but my poor lil tummy just would not tolerate an all you can eat affair. I would not have gotten my money's worth of ribs! So instead I opted for the catfish (OK HUGE MASSIVE ALMIGHTY PROPS for having catfish on the menu!!!!! Haven't seen catfish on a menu in this valley until now, and I do like my catfish.) Now - you do get to choose two sides, so I chose - salad and coleslaw and threw veggies as an extra to balance it all out. (and I ended up having a cornbread and two little hushpuppy bites as well included in the meal).\n\nThe catfish - YUMMY crust! I'm very used to beer battered fish, so was thinking hmm don't know how the cornmeal crust thing is gonna work out but I'm game for something new. And I was not disappointed! The cornmeal was not hard at all, but had just the right amount of crunch to it without cracking your teeth or getting stuck. The fish very moist and tender, not over done, and not dried out!\n\nColeslaw - is a cross between the vinegar and mayo based types. I liked it - had the perfect crunch, and right blend of mayo and vinegar touches. I'm more partial to the vinegar based ones (sorry no offense, but no one can beat the yummy morsels from my Grandma's version, which is all vinegar based).\n\nVeggies & salad - nothing fancy to report about - frozen veggies - boiled and seasoned or steamed and seasoned. Lettuce, on a plate! (I'm just thankful it wasn't iceberg lettuce, which is known for being one of the least nutritional lettuces out there). \n\nCornbread - tasty little bite. Very sweet and moist.\n\nHushpuppies - oh boy - make sure you have drink readily available. These little devils have quite the kick! They throw in fresh jalapeno bits into the batter, so you get a little fire mouth surprise!\n\nNow ---- the folks I was with - several had the all you can eat ribs. I will review these based on appearances only! First off - you can SEEEEEE that beautiful smoke ring in these bad boys! Yes there are places here that have forgotten what a smoke ring is but N 40 is NOT one of them. :) They use a very rich dark rub mixture/ wet mopping technique. So I'm assuming molasses or uber caramalized sugar in the mix. Now 3 of our party all had the ribs, and during our dining, they were chowing it all down, finger smacking, and lots of yums going around. The meat was pulling off the bone in the right way - so that it wasn't falling off the bone, but you weren't playing tug of war with it either.\n\nSome of the gals had the mac 'n' cheese, and they all had a dislike for it. They all agreed and stated the noodles were dry, and there was not enough of a cheese sauce involved.\n\nService wise, we did have a little hiccup (a 15 min. gap) - our waitress had needed a break or something, and said she would make sure we were being looked after - fine no issues. Buuuuut apparently the folks were not to keen on helping her out as they really didn't come over to check up on us, or send out the refills outside of delivering water only once to us. Now our waitress came back and was rightfully peeved that our service was not taken care of (some needing water, others wanting a refill of their ribs, and others needing to go boxes - basic stuff, nothing outstanding). So she was a little short while trying to get everything squared away - and like I said, understandable if she was peeved that her peers weren't helping her out. I would be too if I had been in her shoes. She was very apologetic about the whole thing, and comped some of us, but we weren't really upset about it - just like \"anyone coming soon?\" with some hopeful looks to snag a service person.\n\nSoooo - I think I'll come back here again to try the bbq stuff with the fam. \n\nHappy dining!", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2012-07-18", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "F_0Rf6KGokgemEBep0v3Tg", "review_id": "_tZ3YExOj7XiNQjjVrYK3Q", "text": "We had the Austin sized family meal, which by the way its sooo much food.  I really liked  the meats they were really tender and juicy.  The thing i didn't like was the Mac and Cheese and the Coleslaw, the mac tasted weird and the slaw had waaayy to much mayo, also the cornbread was grainy and super hard, and dry, it was gross, it felt like i was eating sand. But the fries and corn were delicious as the meats.  The place is very clean, its very big, but its to dark.  The service was excellent, our food came out hot and on time.   I'm kinda of in between with this place that's why i give it 3 stars. overall its ok i guess.......", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 3, "date": "2012-02-26", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "dnZGacL1BXD7nlKN6badPw", "review_id": "PM4ru-M8Na4J0PiOahx5Ng", "text": "All I need to say is all you can drink free beer on Fridays.", "business_id": "KYEZATGRY5aD69ZR6VvyWQ", "stars": 4, "date": "2010-09-24", "useful": 1, "cool": 0}]