[{"funny": 0, "user_id": "tL2pS5UOmN6aAOi3Z-qFGg", "review_id": "OTa6_HLsGsunb4XpHbrjOw", "text": "I work in the area and have eaten here several times. I can attest to the fact that this is one of the worst McDonalds to eat at.\n\nYou can at least be sure of consistent service. Consistently lousy. Consistently noisy and consistently dirty.\n\nOnly eat here as a last resort", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 2, "date": "2013-04-27", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "fO79vR23YbIRuLKFldZgqQ", "review_id": "cYEeWB97xG284o8ZXryYdQ", "text": "Giving one star, no choice! This place has the rudest people I've ever encountered. Poor management. Managers are so rude! If you dare to ask for an extra sauce, not 2 or 3, they freak out! Really? When you pay extra because you are in Vegas, I don't think an extra sauce or two will break the bank. Just extremely bad customer service!!", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2015-07-19", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "Rq-0UlVdFJpj7zQK6bSrUg", "review_id": "cL-sESY7xXwD2wABqYii8g", "text": "Dump. No bagels. Only serves Pepsi. Trash. Theres not much else to say, but yelp requires a lot of text to count as a review, so blah blah blahblah blah blahblah blah blahblah blah blahblah blah blahblah blah blahblah blah blahblah blah blahblah blah blah", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2015-08-27", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "4IUx4mFdbyqmgq22GmQIAQ", "review_id": "rKWhSF2ATveuwiqwfrAp_w", "text": "This is a lousy McDonalds. So slow. So surly. Once you finally get the food it doesn't even seem to matter anymore.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2013-06-26", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "I7AVnd5Akgy4tPXBbDzFHA", "review_id": "CpAjyVsb7b4XyberiGHpcA", "text": "Just an unpleasant experience. I live here in Las Vegas and will often take family to the Strip when they come to town. We were looking for a late night bite to eat and decided on McDonald's since it was right in the hotel. The servers were incredibly rude. My aunt had only asked if they were serving smoothies and the girl behind the register rolled her eyes and responded with an attitude. After receiving our food, I had asked another employee where I could find straws. She intentionally ignored me upon my first attempt to get her attention. When she finally turned around after talking to her friend, she acted as if I was burdening her.\n\nMaybe I'm expecting too much from a fast food place on the Strip, but I feel that if you are working in customer service, you should be providing customer service, not acting as if you are still in high school and hanging onto that angsty teenager we all have inside us.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2013-06-15", "useful": 2, "cool": 0}, {"funny": 0, "user_id": "qMzE2-Vk86A8wrzdH-OX0g", "review_id": "J0j0kTsvEst-5CtyUVw7ew", "text": "Horrible service!! Not friendly at all. I asked for a couple of sauces, they told me I would have to pay 52 cents! What happened to customer service? Worst mcdonalds I have been too. Cheesy move on their part. Giving them one star is being generous", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2012-07-22", "useful": 2, "cool": 0}, {"funny": 0, "user_id": "q9SvwvXjdMXPz2DO2wfoAg", "review_id": "B7PzChwRDi3HZtod7Ymx3Q", "text": "This place is the worst McDonald's I've ever been to.. the staff acts angry that they have to do their job. We get it you work at McDonald's and hate your life.. buuuut I'm on vacation and don't need your attitude... and I ordered just a large fry. It's was basically the portion for small! Total rip off smh", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2015-06-21", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "pIsRDF-Z8hCWQ31ye6JBRg", "review_id": "x5H9MfDTkt3sr8YRsnYEwg", "text": "It's McDs. We ate here a couple times during our stay. Both late at night. The service was good, food was always hot and fresh. Even when walking the food back to our room. It's quick and easy especially for those late night munchies.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 4, "date": "2016-03-23", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "gdAidLTBmIgpbP8nA7JkgA", "review_id": "aK4OvtYqPIs1xg4PmlmJwQ", "text": "This place is a joke! It's disgusting enough of a fact that the only thing to eat at Excalibur between the hours of 0200 and 0600 is McDonald's, Starbucks, and Krispy Kreme. But then, to be forced to go to McDonald's and find this pitiful excuse of an establishment instead.... for shame. The first night they ran out of Butterfinger topping for a McFlurry. The second night, they claimed their ice cream machine was \"locked.\" Not broken.... but locked. WTF is that?!?! If you are the only late night eatery available, you better have all your menu items available because I have a bit of a sweet tooth. This place is a joke... do yourself a favor and walk across the footbridge to New York New York and eat at America, their late night cafe.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2012-09-16", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "G4xO4tT0ltQWUs2pKUvpfg", "review_id": "5ax_1S6l2w_oSs2Irmgkbw", "text": "I was really pleased with my visit to this restaurant.   I stopped for a quick breakfast before getting ready to head to the airport.  Had my normal hotcakes and sausage and sausage and sausage and a juice.  It's an odd order with the hotcakes and two extra sausage patties and they got it right and had it to me quickly with the right amount of butter and syrup along with a knife and fork on the plate.\n\nWhat impressed me the most was the friendliness of the employees here.  They even had staff monitoring the lobby and promptly clearing tables that tourists would just rudely abandon with all their garbage left in place.\n\nI needed a restroom and one of the lobby staff gave me clear and easy directions with a smile as if he was glad to help.\n\nConfession:  I am former McDonalds management so I am a little picky when it comes to McDonalds.  I see some negative reviews for this location, but my experience was exactly how I would have liked it.   I'm definitely marking this as \"Good For Breakfast\" as that crew had it down.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 4, "date": "2015-05-04", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "Pk9uIZ0E4RJDUNsm-mW1Qw", "review_id": "_q2iZYgjTUmerSplhLWgUw", "text": "Jera is so rude she has no costumer service skills at all. If she doesn't like her  job or what she does she should go work somewhere else. She talks with an attitude. Like she is entitled. Rolling her eyes and waving her hands. Extremely rude and unprofessional. She almost came out across raciest. Horrible service, only gave one star is because i can not give zero. \nWill not come here again!", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2015-11-27", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "8UJFLOgTuq0tw_bkKiKbEA", "review_id": "FOWBwv1To7e73dfgPkEuHg", "text": "I was thirsty and decided to get a drink.  McDonald's is the best place to get something cheap, especially when you're on the strip.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 2, "date": "2015-01-07", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "LuyR9GVsQvSOb8M4Wa3ezQ", "review_id": "s3ZtXf_eqc6UX5TmjTRLdw", "text": "Hungry college students, your quest for cheap consistent grub is over! \n\nVALUE MENU\nMore than your average mcd but 1.69 mcspicy and dollar apple pies? Pretty good for quick reliable grub\n\nDECOR\nSlightly less attractive than Caesar's palace...cmon ppl it's a mcd's!\n\nOVERALL\nWho two stars a McDonald's? You get a cheap burger, decent fries and free bathroom access.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 5, "date": "2016-01-02", "useful": 0, "cool": 0}, {"funny": 10, "user_id": "QdfFtp430K_-BP1GTPNnDg", "review_id": "MftrMWcWzxX79N9cZbRAbg", "text": "I cannot give a 4 or 5 star rating for any junk food place such as McDonald's. Their food is not fresh, but frozen so really the only rating, aside from food, is the cleanliness, staff etc.\n\nThis place is packed and understaffed. It was about midnight and I could see 2 people working behind the counter making the food. The manager was doing her best to keep the food coming out of the kitchen, but clearly was short handed. Napkins were empty, and floors were sticky.\n\nThe food even tasted worse by McDonald's standards. Just not a good experience.\n\nI come to McDonald's for emergencies only.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 2, "date": "2014-07-11", "useful": 13, "cool": 15}, {"funny": 1, "user_id": "AB91B2GNW3HL-UaaSM4O6w", "review_id": "bYoESqIdW3CzVGA6WSansQ", "text": "This McDonald's is located inside the Excalibur hotel and was one of the worst experiences I've ever had at a Mickey D's. We wanted a quick breakfast at around 9:30 a.m., so my friend decided to grab some for us to bring back to the room before heading out for the day. He ended up waiting over 30 minutes in line to get 2 egg Mcmuffins and coffee, and I had to wander out of the room to see what the hold up was. There was also no dollar menu available when we were there, so we ended up paying the $3 for a greasy sandwich. By the time we got the food back to the room it was cold, but at least the coffee stayed warm.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 2, "date": "2011-04-10", "useful": 3, "cool": 1}, {"funny": 0, "user_id": "lskjv26lnLMNN5eNt56JCg", "review_id": "uYo6oFalb96oxtvBJFaTng", "text": "This McD's wasn't too bad. Not too busy when we went to grab some late breakfast. You can't beat the dollar menu either. $1 salad from there is nutritionally equivalent to eating something from Quiznos (which my friend had in the food court and hated) at a fraction of the price.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 3, "date": "2010-02-21", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "-vTIOBkGfZ6JdP0RROs6Fw", "review_id": "6lm0h7nTr3uaPTYy8f65fg", "text": "This is, by far, the absolute WORST McDonald's I have ever been to.. that is the truth without any exaggeration.  I am not sad at all that they are now GONE...  They were extremely overpriced.  The core employees were very rude.  Never did I ever get a correct order here the first time.  Many times, not even the second try was right.  The rude employees would try to say that you got what you ordered even when you had your receipt that proved them wrong.  A couple of months ago, got some McRibs because they were on sale... they served them to me without any BBQ sauce on them.  No, not a little sauce, ZERO sauce.  When I mentioned it, they didn't say anything about them and just jerked them from me.  I had to wait more than a half hour while I watched the girl try to open the bag of BBQ sauce... that was it, they were just too lazy to open the sauce and prepare the food correctly.  EVERY TIME I was there, most of the wait was because they had to re-make so many of the orders...  The CREW and their service was PATHETIC.   Anyway, I walked through there today and was relieved that the horrible place was gone...   but the problem is that some other Burger place is going in there and you know that they'll be extremely expensive.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2016-05-18", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "VpV4i-7BTGKAfsxcKCmKfA", "review_id": "SATeH7EiWPR9iJ8MCVH4dg", "text": "I needed a quick breakfast before catching my flight back to new york. This McDonalds was located inside my hotel in the food court section. I ordered my orange juice, sausage biscuit, some pancakes and on my way I went.  It was a bit of a wait but my order was complete and the food was ok.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 3, "date": "2014-05-29", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "7TGq7RQCkUtRbPeDOLFhrw", "review_id": "BsCev6vnlcCv6N-o6Y7B0w", "text": "This is by far the worst service I have ever had in any fast food restaurant.\n\nNow I understand that working fast food isn't easy, but having a burger tossed at me was the end of the line. Enough said, so upset that I tossed right back at the rude ass lady behind the counter. If you can wait a couple more feet, there are way more options than this pile of dump. The only thing worse than having to walk through the Excalibur, is walking by that stink hole.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2013-07-24", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "tWBLn4k1M7PLBtAtwAg73g", "review_id": "-6iqADK6CpZLKWcoLEHj-Q", "text": "I would never usually review a McDonalds, but here's why this place rules:\n1) $5 for a 20 pack of Chicken McNuggets at 3am. When everything else in the food court was closed, we had this trusty option which ended up being our \"go to\". I couldn't imagine how extra hungover I would've been each morning without this grease.\n2) An alternative to overpriced breakfast at the buffet at the hotel.\n3) A quick way of grabbing something for less than $5 when not needing a full meal during the day.\n\n5 stars for that!", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 5, "date": "2014-05-04", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "wXL309gBNcRUCvV4jim8GA", "review_id": "qjpOwwLzXuppx4L9KBzn-w", "text": "The oatmeal was good. The fruit was crisp and the raisins plump. The sweet tea was fresh.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 2, "date": "2014-04-18", "useful": 0, "cool": 0}, {"funny": 3, "user_id": "upQW7sPfOfh0brmyq2byEg", "review_id": "BcArrM2cy7ZVidw0YBF43Q", "text": "On Christ almighty here it goes. If I am going to eat overpriced McDonalds in a casino I better get what the hell I want to eat. This place is so pitiful just thinking about it makes me angry. I don't even know where to start! Besides Starbucks and Krispy Kreme this is your only option for late night eats at The Excalibur. Here it goes:\n\nVisit #1: Fool me once...shame on you.\nMy husband and I head to the room early our first night in Vegas because we were tired after a long drive. After watching some TV my husband said he wanted a little something from our local McDonalds. I was not really hungry but I was craving a little something sweet so I asked him to get me a McFlurry and to call me and tell me what kind they have. He calls and they have Oreo, M&M, and Butterfinger. YUM! I want Butterfinger I exclaimed! He hangs up and calls back about a minute later to break the news to me that they are out of Butterfinger. That would've been useful info to have when he first asked! So I ended up with Oreo. He comes back and I take a bite of my McFlurry. For those who may not know a McFlurry is soft serve icecream mixed with whatever topping you get. How do you possibly mess that up? Messing up a McFlurry is equal to the stupidity of burning cornflakes! There is no excuse. I took one bite and threw it away. The icecream was warm and the oreo chucks were stale. NASTY! My husband's burger and fries turned out ok at least. \n\nVisit #2: Fool me twice....shame on me. \nAfter some late night gambling I was hungry and did not feel like searching for late night eats so I ventured into this hell hole again. I figured since I was getting regular food this time it would be ok. The customer service of this place is atrocious. You are pretty much the only 24 hour operation that offers more than donuts and coffee so change your attitude. My husband had a sweet tooth this time and wanted a McFlurry. Dun Dun Dun! I order my food and ask for a Oreo McFlurry and the guy behind the counter proceeds to tell me that the icecream machine is locked. Excuse me? WTF? I call my hubby and tell him and he is most displeased. After two minutes of straight  cursing he asks for chocolate chip cookies, they have none. The only had oatmeal raisin which I can only describe is the asshole of cookies. So literally they have no good desserts. So my poor baby goes without what he wants. We are not doughnut fans so Krispy Kreme is not really appealing. After that I was done with that place for good!\n\nIf you are ok with McDonalds go to the one at The Luxor. You will probably get better service. We should've.  If you want something better venture into NYNY into America cafe which is open 24 hours and for the same price you can get some decent food and service.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2012-09-16", "useful": 3, "cool": 1}, {"funny": 0, "user_id": "uocYGE8tosU7caXmZl3sxw", "review_id": "8H1gzba9T8EYJTSPzm8dig", "text": "Hot Mustard is back!\n\nLines can be long, but otherwise this is a par for the course McDonald's. Would eat at again.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 4, "date": "2015-05-11", "useful": 0, "cool": 0}, {"funny": 0, "user_id": "r1wLf-kupAwKZEOyenPTQw", "review_id": "ErZ_szvL2ksY0hGQhGph0A", "text": "Was a busy day, I didn't have time for a healthy lunch. I saw a Mcdonalds so I decided what the heck, im in a hurry and I m kind of hungry. My order took forever, I didn't go thru the drive thru as I don't trust them, my fries were medium warm as was my burger, I didn't have time to wait for another order so I left, I was dissatisfied with my order but it was a Mcdonalds after all.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 3, "date": "2014-08-20", "useful": 0, "cool": 0}, {"funny": 1, "user_id": "a-G8T0o_MVijtINLfyx15g", "review_id": "uWgZPtXSmoZ0e8j6ozdfXw", "text": "It's a fast food place. What is to be expected?\n\nThe cashier was completely blunt and almost rude. No smile, no real help, reciting lines like she's speaking through syrup. Just, not fun. \n\nBut again, it's fast food, and we did get our food quickly, it was edible, that's mostly the point when going from place to place.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 1, "date": "2015-03-17", "useful": 1, "cool": 0}, {"funny": 0, "user_id": "SHN5ZMyqlNdjuNv503FMvw", "review_id": "80f3EpdTo12m_KR8aNrYEQ", "text": "The McDonald's chronicles.\nHooray for free refills.\nI just want a bite to eat, make my daughter happy. not spend a lot of money, and drink as much soda as I can quenching my thirst is the dry air.  The McDonald's doesn't charge that much of a premium.  The place is clean and is a good, affordable rest before putting the feet down back on the strip's concrete.", "business_id": "EEePiBwchl-TIBVcTdE0RA", "stars": 3, "date": "2010-04-20", "useful": 1, "cool": 0}]